// Generated by jextract

package org.vulkan;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct StdVideoEncodeH265ReferenceInfo {
 *     StdVideoEncodeH265ReferenceInfoFlags flags;
 *     StdVideoH265PictureType pic_type;
 *     int32_t PicOrderCntVal;
 *     uint8_t TemporalId;
 * }
 * }
 */
public class StdVideoEncodeH265ReferenceInfo {

    StdVideoEncodeH265ReferenceInfo() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        StdVideoEncodeH265ReferenceInfoFlags.layout().withName("flags"),
        vulkan_h.C_INT.withName("pic_type"),
        vulkan_h.C_INT.withName("PicOrderCntVal"),
        vulkan_h.C_CHAR.withName("TemporalId"),
        MemoryLayout.paddingLayout(3)
    ).withName("StdVideoEncodeH265ReferenceInfo");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final GroupLayout flags$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("flags"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * StdVideoEncodeH265ReferenceInfoFlags flags
     * }
     */
    public static final GroupLayout flags$layout() {
        return flags$LAYOUT;
    }

    private static final long flags$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * StdVideoEncodeH265ReferenceInfoFlags flags
     * }
     */
    public static final long flags$offset() {
        return flags$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * StdVideoEncodeH265ReferenceInfoFlags flags
     * }
     */
    public static MemorySegment flags(MemorySegment struct) {
        return struct.asSlice(flags$OFFSET, flags$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * StdVideoEncodeH265ReferenceInfoFlags flags
     * }
     */
    public static void flags(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, flags$OFFSET, flags$LAYOUT.byteSize());
    }

    private static final OfInt pic_type$LAYOUT = (OfInt)$LAYOUT.select(groupElement("pic_type"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * StdVideoH265PictureType pic_type
     * }
     */
    public static final OfInt pic_type$layout() {
        return pic_type$LAYOUT;
    }

    private static final long pic_type$OFFSET = 4;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * StdVideoH265PictureType pic_type
     * }
     */
    public static final long pic_type$offset() {
        return pic_type$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * StdVideoH265PictureType pic_type
     * }
     */
    public static int pic_type(MemorySegment struct) {
        return struct.get(pic_type$LAYOUT, pic_type$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * StdVideoH265PictureType pic_type
     * }
     */
    public static void pic_type(MemorySegment struct, int fieldValue) {
        struct.set(pic_type$LAYOUT, pic_type$OFFSET, fieldValue);
    }

    private static final OfInt PicOrderCntVal$LAYOUT = (OfInt)$LAYOUT.select(groupElement("PicOrderCntVal"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int32_t PicOrderCntVal
     * }
     */
    public static final OfInt PicOrderCntVal$layout() {
        return PicOrderCntVal$LAYOUT;
    }

    private static final long PicOrderCntVal$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int32_t PicOrderCntVal
     * }
     */
    public static final long PicOrderCntVal$offset() {
        return PicOrderCntVal$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int32_t PicOrderCntVal
     * }
     */
    public static int PicOrderCntVal(MemorySegment struct) {
        return struct.get(PicOrderCntVal$LAYOUT, PicOrderCntVal$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int32_t PicOrderCntVal
     * }
     */
    public static void PicOrderCntVal(MemorySegment struct, int fieldValue) {
        struct.set(PicOrderCntVal$LAYOUT, PicOrderCntVal$OFFSET, fieldValue);
    }

    private static final OfByte TemporalId$LAYOUT = (OfByte)$LAYOUT.select(groupElement("TemporalId"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint8_t TemporalId
     * }
     */
    public static final OfByte TemporalId$layout() {
        return TemporalId$LAYOUT;
    }

    private static final long TemporalId$OFFSET = 12;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint8_t TemporalId
     * }
     */
    public static final long TemporalId$offset() {
        return TemporalId$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint8_t TemporalId
     * }
     */
    public static byte TemporalId(MemorySegment struct) {
        return struct.get(TemporalId$LAYOUT, TemporalId$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint8_t TemporalId
     * }
     */
    public static void TemporalId(MemorySegment struct, byte fieldValue) {
        struct.set(TemporalId$LAYOUT, TemporalId$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

