// Generated by jextract

package org.vulkan;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct VkAcquireNextImageInfoKHR {
 *     VkStructureType sType;
 *     const void *pNext;
 *     VkSwapchainKHR swapchain;
 *     uint64_t timeout;
 *     VkSemaphore semaphore;
 *     VkFence fence;
 *     uint32_t deviceMask;
 * }
 * }
 */
public class VkAcquireNextImageInfoKHR {

    VkAcquireNextImageInfoKHR() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        vulkan_h.C_INT.withName("sType"),
        MemoryLayout.paddingLayout(4),
        vulkan_h.C_POINTER.withName("pNext"),
        vulkan_h.C_POINTER.withName("swapchain"),
        vulkan_h.C_LONG_LONG.withName("timeout"),
        vulkan_h.C_POINTER.withName("semaphore"),
        vulkan_h.C_POINTER.withName("fence"),
        vulkan_h.C_INT.withName("deviceMask"),
        MemoryLayout.paddingLayout(4)
    ).withName("VkAcquireNextImageInfoKHR");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt sType$LAYOUT = (OfInt)$LAYOUT.select(groupElement("sType"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final OfInt sType$layout() {
        return sType$LAYOUT;
    }

    private static final long sType$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final long sType$offset() {
        return sType$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static int sType(MemorySegment struct) {
        return struct.get(sType$LAYOUT, sType$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static void sType(MemorySegment struct, int fieldValue) {
        struct.set(sType$LAYOUT, sType$OFFSET, fieldValue);
    }

    private static final AddressLayout pNext$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pNext"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static final AddressLayout pNext$layout() {
        return pNext$LAYOUT;
    }

    private static final long pNext$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static final long pNext$offset() {
        return pNext$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static MemorySegment pNext(MemorySegment struct) {
        return struct.get(pNext$LAYOUT, pNext$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static void pNext(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pNext$LAYOUT, pNext$OFFSET, fieldValue);
    }

    private static final AddressLayout swapchain$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("swapchain"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkSwapchainKHR swapchain
     * }
     */
    public static final AddressLayout swapchain$layout() {
        return swapchain$LAYOUT;
    }

    private static final long swapchain$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkSwapchainKHR swapchain
     * }
     */
    public static final long swapchain$offset() {
        return swapchain$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkSwapchainKHR swapchain
     * }
     */
    public static MemorySegment swapchain(MemorySegment struct) {
        return struct.get(swapchain$LAYOUT, swapchain$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkSwapchainKHR swapchain
     * }
     */
    public static void swapchain(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(swapchain$LAYOUT, swapchain$OFFSET, fieldValue);
    }

    private static final OfLong timeout$LAYOUT = (OfLong)$LAYOUT.select(groupElement("timeout"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint64_t timeout
     * }
     */
    public static final OfLong timeout$layout() {
        return timeout$LAYOUT;
    }

    private static final long timeout$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint64_t timeout
     * }
     */
    public static final long timeout$offset() {
        return timeout$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint64_t timeout
     * }
     */
    public static long timeout(MemorySegment struct) {
        return struct.get(timeout$LAYOUT, timeout$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint64_t timeout
     * }
     */
    public static void timeout(MemorySegment struct, long fieldValue) {
        struct.set(timeout$LAYOUT, timeout$OFFSET, fieldValue);
    }

    private static final AddressLayout semaphore$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("semaphore"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkSemaphore semaphore
     * }
     */
    public static final AddressLayout semaphore$layout() {
        return semaphore$LAYOUT;
    }

    private static final long semaphore$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkSemaphore semaphore
     * }
     */
    public static final long semaphore$offset() {
        return semaphore$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkSemaphore semaphore
     * }
     */
    public static MemorySegment semaphore(MemorySegment struct) {
        return struct.get(semaphore$LAYOUT, semaphore$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkSemaphore semaphore
     * }
     */
    public static void semaphore(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(semaphore$LAYOUT, semaphore$OFFSET, fieldValue);
    }

    private static final AddressLayout fence$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("fence"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkFence fence
     * }
     */
    public static final AddressLayout fence$layout() {
        return fence$LAYOUT;
    }

    private static final long fence$OFFSET = 40;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkFence fence
     * }
     */
    public static final long fence$offset() {
        return fence$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkFence fence
     * }
     */
    public static MemorySegment fence(MemorySegment struct) {
        return struct.get(fence$LAYOUT, fence$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkFence fence
     * }
     */
    public static void fence(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(fence$LAYOUT, fence$OFFSET, fieldValue);
    }

    private static final OfInt deviceMask$LAYOUT = (OfInt)$LAYOUT.select(groupElement("deviceMask"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t deviceMask
     * }
     */
    public static final OfInt deviceMask$layout() {
        return deviceMask$LAYOUT;
    }

    private static final long deviceMask$OFFSET = 48;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t deviceMask
     * }
     */
    public static final long deviceMask$offset() {
        return deviceMask$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t deviceMask
     * }
     */
    public static int deviceMask(MemorySegment struct) {
        return struct.get(deviceMask$LAYOUT, deviceMask$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t deviceMask
     * }
     */
    public static void deviceMask(MemorySegment struct, int fieldValue) {
        struct.set(deviceMask$LAYOUT, deviceMask$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

