// Generated by jextract

package org.vulkan;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct VkAccelerationStructureGeometryTrianglesDataKHR {
 *     VkStructureType sType;
 *     const void *pNext;
 *     VkFormat vertexFormat;
 *     VkDeviceOrHostAddressConstKHR vertexData;
 *     VkDeviceSize vertexStride;
 *     uint32_t maxVertex;
 *     VkIndexType indexType;
 *     VkDeviceOrHostAddressConstKHR indexData;
 *     VkDeviceOrHostAddressConstKHR transformData;
 * }
 * }
 */
public class VkAccelerationStructureGeometryTrianglesDataKHR {

    VkAccelerationStructureGeometryTrianglesDataKHR() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        vulkan_h.C_INT.withName("sType"),
        MemoryLayout.paddingLayout(4),
        vulkan_h.C_POINTER.withName("pNext"),
        vulkan_h.C_INT.withName("vertexFormat"),
        MemoryLayout.paddingLayout(4),
        VkDeviceOrHostAddressConstKHR.layout().withName("vertexData"),
        vulkan_h.C_LONG_LONG.withName("vertexStride"),
        vulkan_h.C_INT.withName("maxVertex"),
        vulkan_h.C_INT.withName("indexType"),
        VkDeviceOrHostAddressConstKHR.layout().withName("indexData"),
        VkDeviceOrHostAddressConstKHR.layout().withName("transformData")
    ).withName("VkAccelerationStructureGeometryTrianglesDataKHR");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt sType$LAYOUT = (OfInt)$LAYOUT.select(groupElement("sType"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final OfInt sType$layout() {
        return sType$LAYOUT;
    }

    private static final long sType$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final long sType$offset() {
        return sType$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static int sType(MemorySegment struct) {
        return struct.get(sType$LAYOUT, sType$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static void sType(MemorySegment struct, int fieldValue) {
        struct.set(sType$LAYOUT, sType$OFFSET, fieldValue);
    }

    private static final AddressLayout pNext$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pNext"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static final AddressLayout pNext$layout() {
        return pNext$LAYOUT;
    }

    private static final long pNext$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static final long pNext$offset() {
        return pNext$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static MemorySegment pNext(MemorySegment struct) {
        return struct.get(pNext$LAYOUT, pNext$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static void pNext(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pNext$LAYOUT, pNext$OFFSET, fieldValue);
    }

    private static final OfInt vertexFormat$LAYOUT = (OfInt)$LAYOUT.select(groupElement("vertexFormat"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkFormat vertexFormat
     * }
     */
    public static final OfInt vertexFormat$layout() {
        return vertexFormat$LAYOUT;
    }

    private static final long vertexFormat$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkFormat vertexFormat
     * }
     */
    public static final long vertexFormat$offset() {
        return vertexFormat$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkFormat vertexFormat
     * }
     */
    public static int vertexFormat(MemorySegment struct) {
        return struct.get(vertexFormat$LAYOUT, vertexFormat$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkFormat vertexFormat
     * }
     */
    public static void vertexFormat(MemorySegment struct, int fieldValue) {
        struct.set(vertexFormat$LAYOUT, vertexFormat$OFFSET, fieldValue);
    }

    private static final GroupLayout vertexData$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("vertexData"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkDeviceOrHostAddressConstKHR vertexData
     * }
     */
    public static final GroupLayout vertexData$layout() {
        return vertexData$LAYOUT;
    }

    private static final long vertexData$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkDeviceOrHostAddressConstKHR vertexData
     * }
     */
    public static final long vertexData$offset() {
        return vertexData$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkDeviceOrHostAddressConstKHR vertexData
     * }
     */
    public static MemorySegment vertexData(MemorySegment struct) {
        return struct.asSlice(vertexData$OFFSET, vertexData$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkDeviceOrHostAddressConstKHR vertexData
     * }
     */
    public static void vertexData(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, vertexData$OFFSET, vertexData$LAYOUT.byteSize());
    }

    private static final OfLong vertexStride$LAYOUT = (OfLong)$LAYOUT.select(groupElement("vertexStride"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkDeviceSize vertexStride
     * }
     */
    public static final OfLong vertexStride$layout() {
        return vertexStride$LAYOUT;
    }

    private static final long vertexStride$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkDeviceSize vertexStride
     * }
     */
    public static final long vertexStride$offset() {
        return vertexStride$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkDeviceSize vertexStride
     * }
     */
    public static long vertexStride(MemorySegment struct) {
        return struct.get(vertexStride$LAYOUT, vertexStride$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkDeviceSize vertexStride
     * }
     */
    public static void vertexStride(MemorySegment struct, long fieldValue) {
        struct.set(vertexStride$LAYOUT, vertexStride$OFFSET, fieldValue);
    }

    private static final OfInt maxVertex$LAYOUT = (OfInt)$LAYOUT.select(groupElement("maxVertex"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t maxVertex
     * }
     */
    public static final OfInt maxVertex$layout() {
        return maxVertex$LAYOUT;
    }

    private static final long maxVertex$OFFSET = 40;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t maxVertex
     * }
     */
    public static final long maxVertex$offset() {
        return maxVertex$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t maxVertex
     * }
     */
    public static int maxVertex(MemorySegment struct) {
        return struct.get(maxVertex$LAYOUT, maxVertex$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t maxVertex
     * }
     */
    public static void maxVertex(MemorySegment struct, int fieldValue) {
        struct.set(maxVertex$LAYOUT, maxVertex$OFFSET, fieldValue);
    }

    private static final OfInt indexType$LAYOUT = (OfInt)$LAYOUT.select(groupElement("indexType"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkIndexType indexType
     * }
     */
    public static final OfInt indexType$layout() {
        return indexType$LAYOUT;
    }

    private static final long indexType$OFFSET = 44;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkIndexType indexType
     * }
     */
    public static final long indexType$offset() {
        return indexType$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkIndexType indexType
     * }
     */
    public static int indexType(MemorySegment struct) {
        return struct.get(indexType$LAYOUT, indexType$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkIndexType indexType
     * }
     */
    public static void indexType(MemorySegment struct, int fieldValue) {
        struct.set(indexType$LAYOUT, indexType$OFFSET, fieldValue);
    }

    private static final GroupLayout indexData$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("indexData"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkDeviceOrHostAddressConstKHR indexData
     * }
     */
    public static final GroupLayout indexData$layout() {
        return indexData$LAYOUT;
    }

    private static final long indexData$OFFSET = 48;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkDeviceOrHostAddressConstKHR indexData
     * }
     */
    public static final long indexData$offset() {
        return indexData$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkDeviceOrHostAddressConstKHR indexData
     * }
     */
    public static MemorySegment indexData(MemorySegment struct) {
        return struct.asSlice(indexData$OFFSET, indexData$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkDeviceOrHostAddressConstKHR indexData
     * }
     */
    public static void indexData(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, indexData$OFFSET, indexData$LAYOUT.byteSize());
    }

    private static final GroupLayout transformData$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("transformData"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkDeviceOrHostAddressConstKHR transformData
     * }
     */
    public static final GroupLayout transformData$layout() {
        return transformData$LAYOUT;
    }

    private static final long transformData$OFFSET = 56;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkDeviceOrHostAddressConstKHR transformData
     * }
     */
    public static final long transformData$offset() {
        return transformData$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkDeviceOrHostAddressConstKHR transformData
     * }
     */
    public static MemorySegment transformData(MemorySegment struct) {
        return struct.asSlice(transformData$OFFSET, transformData$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkDeviceOrHostAddressConstKHR transformData
     * }
     */
    public static void transformData(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, transformData$OFFSET, transformData$LAYOUT.byteSize());
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

