// Generated by jextract

package org.vulkan;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct VkBindImageMemoryDeviceGroupInfo {
 *     VkStructureType sType;
 *     const void *pNext;
 *     uint32_t deviceIndexCount;
 *     const uint32_t *pDeviceIndices;
 *     uint32_t splitInstanceBindRegionCount;
 *     const VkRect2D *pSplitInstanceBindRegions;
 * }
 * }
 */
public class VkBindImageMemoryDeviceGroupInfo {

    VkBindImageMemoryDeviceGroupInfo() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        vulkan_h.C_INT.withName("sType"),
        MemoryLayout.paddingLayout(4),
        vulkan_h.C_POINTER.withName("pNext"),
        vulkan_h.C_INT.withName("deviceIndexCount"),
        MemoryLayout.paddingLayout(4),
        vulkan_h.C_POINTER.withName("pDeviceIndices"),
        vulkan_h.C_INT.withName("splitInstanceBindRegionCount"),
        MemoryLayout.paddingLayout(4),
        vulkan_h.C_POINTER.withName("pSplitInstanceBindRegions")
    ).withName("VkBindImageMemoryDeviceGroupInfo");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt sType$LAYOUT = (OfInt)$LAYOUT.select(groupElement("sType"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final OfInt sType$layout() {
        return sType$LAYOUT;
    }

    private static final long sType$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final long sType$offset() {
        return sType$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static int sType(MemorySegment struct) {
        return struct.get(sType$LAYOUT, sType$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static void sType(MemorySegment struct, int fieldValue) {
        struct.set(sType$LAYOUT, sType$OFFSET, fieldValue);
    }

    private static final AddressLayout pNext$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pNext"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static final AddressLayout pNext$layout() {
        return pNext$LAYOUT;
    }

    private static final long pNext$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static final long pNext$offset() {
        return pNext$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static MemorySegment pNext(MemorySegment struct) {
        return struct.get(pNext$LAYOUT, pNext$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static void pNext(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pNext$LAYOUT, pNext$OFFSET, fieldValue);
    }

    private static final OfInt deviceIndexCount$LAYOUT = (OfInt)$LAYOUT.select(groupElement("deviceIndexCount"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t deviceIndexCount
     * }
     */
    public static final OfInt deviceIndexCount$layout() {
        return deviceIndexCount$LAYOUT;
    }

    private static final long deviceIndexCount$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t deviceIndexCount
     * }
     */
    public static final long deviceIndexCount$offset() {
        return deviceIndexCount$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t deviceIndexCount
     * }
     */
    public static int deviceIndexCount(MemorySegment struct) {
        return struct.get(deviceIndexCount$LAYOUT, deviceIndexCount$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t deviceIndexCount
     * }
     */
    public static void deviceIndexCount(MemorySegment struct, int fieldValue) {
        struct.set(deviceIndexCount$LAYOUT, deviceIndexCount$OFFSET, fieldValue);
    }

    private static final AddressLayout pDeviceIndices$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pDeviceIndices"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const uint32_t *pDeviceIndices
     * }
     */
    public static final AddressLayout pDeviceIndices$layout() {
        return pDeviceIndices$LAYOUT;
    }

    private static final long pDeviceIndices$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const uint32_t *pDeviceIndices
     * }
     */
    public static final long pDeviceIndices$offset() {
        return pDeviceIndices$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const uint32_t *pDeviceIndices
     * }
     */
    public static MemorySegment pDeviceIndices(MemorySegment struct) {
        return struct.get(pDeviceIndices$LAYOUT, pDeviceIndices$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const uint32_t *pDeviceIndices
     * }
     */
    public static void pDeviceIndices(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pDeviceIndices$LAYOUT, pDeviceIndices$OFFSET, fieldValue);
    }

    private static final OfInt splitInstanceBindRegionCount$LAYOUT = (OfInt)$LAYOUT.select(groupElement("splitInstanceBindRegionCount"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t splitInstanceBindRegionCount
     * }
     */
    public static final OfInt splitInstanceBindRegionCount$layout() {
        return splitInstanceBindRegionCount$LAYOUT;
    }

    private static final long splitInstanceBindRegionCount$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t splitInstanceBindRegionCount
     * }
     */
    public static final long splitInstanceBindRegionCount$offset() {
        return splitInstanceBindRegionCount$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t splitInstanceBindRegionCount
     * }
     */
    public static int splitInstanceBindRegionCount(MemorySegment struct) {
        return struct.get(splitInstanceBindRegionCount$LAYOUT, splitInstanceBindRegionCount$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t splitInstanceBindRegionCount
     * }
     */
    public static void splitInstanceBindRegionCount(MemorySegment struct, int fieldValue) {
        struct.set(splitInstanceBindRegionCount$LAYOUT, splitInstanceBindRegionCount$OFFSET, fieldValue);
    }

    private static final AddressLayout pSplitInstanceBindRegions$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pSplitInstanceBindRegions"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const VkRect2D *pSplitInstanceBindRegions
     * }
     */
    public static final AddressLayout pSplitInstanceBindRegions$layout() {
        return pSplitInstanceBindRegions$LAYOUT;
    }

    private static final long pSplitInstanceBindRegions$OFFSET = 40;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const VkRect2D *pSplitInstanceBindRegions
     * }
     */
    public static final long pSplitInstanceBindRegions$offset() {
        return pSplitInstanceBindRegions$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const VkRect2D *pSplitInstanceBindRegions
     * }
     */
    public static MemorySegment pSplitInstanceBindRegions(MemorySegment struct) {
        return struct.get(pSplitInstanceBindRegions$LAYOUT, pSplitInstanceBindRegions$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const VkRect2D *pSplitInstanceBindRegions
     * }
     */
    public static void pSplitInstanceBindRegions(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pSplitInstanceBindRegions$LAYOUT, pSplitInstanceBindRegions$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

