// Generated by jextract

package org.vulkan;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct VkBufferCreateInfo {
 *     VkStructureType sType;
 *     const void *pNext;
 *     VkBufferCreateFlags flags;
 *     VkDeviceSize size;
 *     VkBufferUsageFlags usage;
 *     VkSharingMode sharingMode;
 *     uint32_t queueFamilyIndexCount;
 *     const uint32_t *pQueueFamilyIndices;
 * }
 * }
 */
public class VkBufferCreateInfo {

    VkBufferCreateInfo() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        vulkan_h.C_INT.withName("sType"),
        MemoryLayout.paddingLayout(4),
        vulkan_h.C_POINTER.withName("pNext"),
        vulkan_h.C_INT.withName("flags"),
        MemoryLayout.paddingLayout(4),
        vulkan_h.C_LONG_LONG.withName("size"),
        vulkan_h.C_INT.withName("usage"),
        vulkan_h.C_INT.withName("sharingMode"),
        vulkan_h.C_INT.withName("queueFamilyIndexCount"),
        MemoryLayout.paddingLayout(4),
        vulkan_h.C_POINTER.withName("pQueueFamilyIndices")
    ).withName("VkBufferCreateInfo");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt sType$LAYOUT = (OfInt)$LAYOUT.select(groupElement("sType"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final OfInt sType$layout() {
        return sType$LAYOUT;
    }

    private static final long sType$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final long sType$offset() {
        return sType$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static int sType(MemorySegment struct) {
        return struct.get(sType$LAYOUT, sType$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static void sType(MemorySegment struct, int fieldValue) {
        struct.set(sType$LAYOUT, sType$OFFSET, fieldValue);
    }

    private static final AddressLayout pNext$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pNext"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static final AddressLayout pNext$layout() {
        return pNext$LAYOUT;
    }

    private static final long pNext$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static final long pNext$offset() {
        return pNext$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static MemorySegment pNext(MemorySegment struct) {
        return struct.get(pNext$LAYOUT, pNext$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static void pNext(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pNext$LAYOUT, pNext$OFFSET, fieldValue);
    }

    private static final OfInt flags$LAYOUT = (OfInt)$LAYOUT.select(groupElement("flags"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkBufferCreateFlags flags
     * }
     */
    public static final OfInt flags$layout() {
        return flags$LAYOUT;
    }

    private static final long flags$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkBufferCreateFlags flags
     * }
     */
    public static final long flags$offset() {
        return flags$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkBufferCreateFlags flags
     * }
     */
    public static int flags(MemorySegment struct) {
        return struct.get(flags$LAYOUT, flags$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkBufferCreateFlags flags
     * }
     */
    public static void flags(MemorySegment struct, int fieldValue) {
        struct.set(flags$LAYOUT, flags$OFFSET, fieldValue);
    }

    private static final OfLong size$LAYOUT = (OfLong)$LAYOUT.select(groupElement("size"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkDeviceSize size
     * }
     */
    public static final OfLong size$layout() {
        return size$LAYOUT;
    }

    private static final long size$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkDeviceSize size
     * }
     */
    public static final long size$offset() {
        return size$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkDeviceSize size
     * }
     */
    public static long size(MemorySegment struct) {
        return struct.get(size$LAYOUT, size$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkDeviceSize size
     * }
     */
    public static void size(MemorySegment struct, long fieldValue) {
        struct.set(size$LAYOUT, size$OFFSET, fieldValue);
    }

    private static final OfInt usage$LAYOUT = (OfInt)$LAYOUT.select(groupElement("usage"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkBufferUsageFlags usage
     * }
     */
    public static final OfInt usage$layout() {
        return usage$LAYOUT;
    }

    private static final long usage$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkBufferUsageFlags usage
     * }
     */
    public static final long usage$offset() {
        return usage$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkBufferUsageFlags usage
     * }
     */
    public static int usage(MemorySegment struct) {
        return struct.get(usage$LAYOUT, usage$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkBufferUsageFlags usage
     * }
     */
    public static void usage(MemorySegment struct, int fieldValue) {
        struct.set(usage$LAYOUT, usage$OFFSET, fieldValue);
    }

    private static final OfInt sharingMode$LAYOUT = (OfInt)$LAYOUT.select(groupElement("sharingMode"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkSharingMode sharingMode
     * }
     */
    public static final OfInt sharingMode$layout() {
        return sharingMode$LAYOUT;
    }

    private static final long sharingMode$OFFSET = 36;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkSharingMode sharingMode
     * }
     */
    public static final long sharingMode$offset() {
        return sharingMode$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkSharingMode sharingMode
     * }
     */
    public static int sharingMode(MemorySegment struct) {
        return struct.get(sharingMode$LAYOUT, sharingMode$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkSharingMode sharingMode
     * }
     */
    public static void sharingMode(MemorySegment struct, int fieldValue) {
        struct.set(sharingMode$LAYOUT, sharingMode$OFFSET, fieldValue);
    }

    private static final OfInt queueFamilyIndexCount$LAYOUT = (OfInt)$LAYOUT.select(groupElement("queueFamilyIndexCount"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t queueFamilyIndexCount
     * }
     */
    public static final OfInt queueFamilyIndexCount$layout() {
        return queueFamilyIndexCount$LAYOUT;
    }

    private static final long queueFamilyIndexCount$OFFSET = 40;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t queueFamilyIndexCount
     * }
     */
    public static final long queueFamilyIndexCount$offset() {
        return queueFamilyIndexCount$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t queueFamilyIndexCount
     * }
     */
    public static int queueFamilyIndexCount(MemorySegment struct) {
        return struct.get(queueFamilyIndexCount$LAYOUT, queueFamilyIndexCount$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t queueFamilyIndexCount
     * }
     */
    public static void queueFamilyIndexCount(MemorySegment struct, int fieldValue) {
        struct.set(queueFamilyIndexCount$LAYOUT, queueFamilyIndexCount$OFFSET, fieldValue);
    }

    private static final AddressLayout pQueueFamilyIndices$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pQueueFamilyIndices"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const uint32_t *pQueueFamilyIndices
     * }
     */
    public static final AddressLayout pQueueFamilyIndices$layout() {
        return pQueueFamilyIndices$LAYOUT;
    }

    private static final long pQueueFamilyIndices$OFFSET = 48;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const uint32_t *pQueueFamilyIndices
     * }
     */
    public static final long pQueueFamilyIndices$offset() {
        return pQueueFamilyIndices$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const uint32_t *pQueueFamilyIndices
     * }
     */
    public static MemorySegment pQueueFamilyIndices(MemorySegment struct) {
        return struct.get(pQueueFamilyIndices$LAYOUT, pQueueFamilyIndices$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const uint32_t *pQueueFamilyIndices
     * }
     */
    public static void pQueueFamilyIndices(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pQueueFamilyIndices$LAYOUT, pQueueFamilyIndices$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

