// Generated by jextract

package org.vulkan;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct VkDecompressMemoryRegionNV {
 *     VkDeviceAddress srcAddress;
 *     VkDeviceAddress dstAddress;
 *     VkDeviceSize compressedSize;
 *     VkDeviceSize decompressedSize;
 *     VkMemoryDecompressionMethodFlagsNV decompressionMethod;
 * }
 * }
 */
public class VkDecompressMemoryRegionNV {

    VkDecompressMemoryRegionNV() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        vulkan_h.C_LONG_LONG.withName("srcAddress"),
        vulkan_h.C_LONG_LONG.withName("dstAddress"),
        vulkan_h.C_LONG_LONG.withName("compressedSize"),
        vulkan_h.C_LONG_LONG.withName("decompressedSize"),
        vulkan_h.C_LONG_LONG.withName("decompressionMethod")
    ).withName("VkDecompressMemoryRegionNV");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfLong srcAddress$LAYOUT = (OfLong)$LAYOUT.select(groupElement("srcAddress"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkDeviceAddress srcAddress
     * }
     */
    public static final OfLong srcAddress$layout() {
        return srcAddress$LAYOUT;
    }

    private static final long srcAddress$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkDeviceAddress srcAddress
     * }
     */
    public static final long srcAddress$offset() {
        return srcAddress$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkDeviceAddress srcAddress
     * }
     */
    public static long srcAddress(MemorySegment struct) {
        return struct.get(srcAddress$LAYOUT, srcAddress$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkDeviceAddress srcAddress
     * }
     */
    public static void srcAddress(MemorySegment struct, long fieldValue) {
        struct.set(srcAddress$LAYOUT, srcAddress$OFFSET, fieldValue);
    }

    private static final OfLong dstAddress$LAYOUT = (OfLong)$LAYOUT.select(groupElement("dstAddress"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkDeviceAddress dstAddress
     * }
     */
    public static final OfLong dstAddress$layout() {
        return dstAddress$LAYOUT;
    }

    private static final long dstAddress$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkDeviceAddress dstAddress
     * }
     */
    public static final long dstAddress$offset() {
        return dstAddress$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkDeviceAddress dstAddress
     * }
     */
    public static long dstAddress(MemorySegment struct) {
        return struct.get(dstAddress$LAYOUT, dstAddress$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkDeviceAddress dstAddress
     * }
     */
    public static void dstAddress(MemorySegment struct, long fieldValue) {
        struct.set(dstAddress$LAYOUT, dstAddress$OFFSET, fieldValue);
    }

    private static final OfLong compressedSize$LAYOUT = (OfLong)$LAYOUT.select(groupElement("compressedSize"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkDeviceSize compressedSize
     * }
     */
    public static final OfLong compressedSize$layout() {
        return compressedSize$LAYOUT;
    }

    private static final long compressedSize$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkDeviceSize compressedSize
     * }
     */
    public static final long compressedSize$offset() {
        return compressedSize$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkDeviceSize compressedSize
     * }
     */
    public static long compressedSize(MemorySegment struct) {
        return struct.get(compressedSize$LAYOUT, compressedSize$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkDeviceSize compressedSize
     * }
     */
    public static void compressedSize(MemorySegment struct, long fieldValue) {
        struct.set(compressedSize$LAYOUT, compressedSize$OFFSET, fieldValue);
    }

    private static final OfLong decompressedSize$LAYOUT = (OfLong)$LAYOUT.select(groupElement("decompressedSize"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkDeviceSize decompressedSize
     * }
     */
    public static final OfLong decompressedSize$layout() {
        return decompressedSize$LAYOUT;
    }

    private static final long decompressedSize$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkDeviceSize decompressedSize
     * }
     */
    public static final long decompressedSize$offset() {
        return decompressedSize$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkDeviceSize decompressedSize
     * }
     */
    public static long decompressedSize(MemorySegment struct) {
        return struct.get(decompressedSize$LAYOUT, decompressedSize$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkDeviceSize decompressedSize
     * }
     */
    public static void decompressedSize(MemorySegment struct, long fieldValue) {
        struct.set(decompressedSize$LAYOUT, decompressedSize$OFFSET, fieldValue);
    }

    private static final OfLong decompressionMethod$LAYOUT = (OfLong)$LAYOUT.select(groupElement("decompressionMethod"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkMemoryDecompressionMethodFlagsNV decompressionMethod
     * }
     */
    public static final OfLong decompressionMethod$layout() {
        return decompressionMethod$LAYOUT;
    }

    private static final long decompressionMethod$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkMemoryDecompressionMethodFlagsNV decompressionMethod
     * }
     */
    public static final long decompressionMethod$offset() {
        return decompressionMethod$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkMemoryDecompressionMethodFlagsNV decompressionMethod
     * }
     */
    public static long decompressionMethod(MemorySegment struct) {
        return struct.get(decompressionMethod$LAYOUT, decompressionMethod$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkMemoryDecompressionMethodFlagsNV decompressionMethod
     * }
     */
    public static void decompressionMethod(MemorySegment struct, long fieldValue) {
        struct.set(decompressionMethod$LAYOUT, decompressionMethod$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

