// Generated by jextract

package org.vulkan;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct VkDebugMarkerObjectNameInfoEXT {
 *     VkStructureType sType;
 *     const void *pNext;
 *     VkDebugReportObjectTypeEXT objectType;
 *     uint64_t object;
 *     const char *pObjectName;
 * }
 * }
 */
public class VkDebugMarkerObjectNameInfoEXT {

    VkDebugMarkerObjectNameInfoEXT() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        vulkan_h.C_INT.withName("sType"),
        MemoryLayout.paddingLayout(4),
        vulkan_h.C_POINTER.withName("pNext"),
        vulkan_h.C_INT.withName("objectType"),
        MemoryLayout.paddingLayout(4),
        vulkan_h.C_LONG_LONG.withName("object"),
        vulkan_h.C_POINTER.withName("pObjectName")
    ).withName("VkDebugMarkerObjectNameInfoEXT");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt sType$LAYOUT = (OfInt)$LAYOUT.select(groupElement("sType"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final OfInt sType$layout() {
        return sType$LAYOUT;
    }

    private static final long sType$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final long sType$offset() {
        return sType$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static int sType(MemorySegment struct) {
        return struct.get(sType$LAYOUT, sType$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static void sType(MemorySegment struct, int fieldValue) {
        struct.set(sType$LAYOUT, sType$OFFSET, fieldValue);
    }

    private static final AddressLayout pNext$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pNext"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static final AddressLayout pNext$layout() {
        return pNext$LAYOUT;
    }

    private static final long pNext$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static final long pNext$offset() {
        return pNext$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static MemorySegment pNext(MemorySegment struct) {
        return struct.get(pNext$LAYOUT, pNext$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static void pNext(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pNext$LAYOUT, pNext$OFFSET, fieldValue);
    }

    private static final OfInt objectType$LAYOUT = (OfInt)$LAYOUT.select(groupElement("objectType"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkDebugReportObjectTypeEXT objectType
     * }
     */
    public static final OfInt objectType$layout() {
        return objectType$LAYOUT;
    }

    private static final long objectType$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkDebugReportObjectTypeEXT objectType
     * }
     */
    public static final long objectType$offset() {
        return objectType$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkDebugReportObjectTypeEXT objectType
     * }
     */
    public static int objectType(MemorySegment struct) {
        return struct.get(objectType$LAYOUT, objectType$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkDebugReportObjectTypeEXT objectType
     * }
     */
    public static void objectType(MemorySegment struct, int fieldValue) {
        struct.set(objectType$LAYOUT, objectType$OFFSET, fieldValue);
    }

    private static final OfLong object$LAYOUT = (OfLong)$LAYOUT.select(groupElement("object"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint64_t object
     * }
     */
    public static final OfLong object$layout() {
        return object$LAYOUT;
    }

    private static final long object$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint64_t object
     * }
     */
    public static final long object$offset() {
        return object$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint64_t object
     * }
     */
    public static long object(MemorySegment struct) {
        return struct.get(object$LAYOUT, object$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint64_t object
     * }
     */
    public static void object(MemorySegment struct, long fieldValue) {
        struct.set(object$LAYOUT, object$OFFSET, fieldValue);
    }

    private static final AddressLayout pObjectName$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pObjectName"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const char *pObjectName
     * }
     */
    public static final AddressLayout pObjectName$layout() {
        return pObjectName$LAYOUT;
    }

    private static final long pObjectName$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const char *pObjectName
     * }
     */
    public static final long pObjectName$offset() {
        return pObjectName$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const char *pObjectName
     * }
     */
    public static MemorySegment pObjectName(MemorySegment struct) {
        return struct.get(pObjectName$LAYOUT, pObjectName$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const char *pObjectName
     * }
     */
    public static void pObjectName(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pObjectName$LAYOUT, pObjectName$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

