// Generated by jextract

package org.vulkan;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct VkDescriptorPoolCreateInfo {
 *     VkStructureType sType;
 *     const void *pNext;
 *     VkDescriptorPoolCreateFlags flags;
 *     uint32_t maxSets;
 *     uint32_t poolSizeCount;
 *     const VkDescriptorPoolSize *pPoolSizes;
 * }
 * }
 */
public class VkDescriptorPoolCreateInfo {

    VkDescriptorPoolCreateInfo() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        vulkan_h.C_INT.withName("sType"),
        MemoryLayout.paddingLayout(4),
        vulkan_h.C_POINTER.withName("pNext"),
        vulkan_h.C_INT.withName("flags"),
        vulkan_h.C_INT.withName("maxSets"),
        vulkan_h.C_INT.withName("poolSizeCount"),
        MemoryLayout.paddingLayout(4),
        vulkan_h.C_POINTER.withName("pPoolSizes")
    ).withName("VkDescriptorPoolCreateInfo");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt sType$LAYOUT = (OfInt)$LAYOUT.select(groupElement("sType"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final OfInt sType$layout() {
        return sType$LAYOUT;
    }

    private static final long sType$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final long sType$offset() {
        return sType$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static int sType(MemorySegment struct) {
        return struct.get(sType$LAYOUT, sType$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static void sType(MemorySegment struct, int fieldValue) {
        struct.set(sType$LAYOUT, sType$OFFSET, fieldValue);
    }

    private static final AddressLayout pNext$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pNext"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static final AddressLayout pNext$layout() {
        return pNext$LAYOUT;
    }

    private static final long pNext$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static final long pNext$offset() {
        return pNext$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static MemorySegment pNext(MemorySegment struct) {
        return struct.get(pNext$LAYOUT, pNext$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static void pNext(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pNext$LAYOUT, pNext$OFFSET, fieldValue);
    }

    private static final OfInt flags$LAYOUT = (OfInt)$LAYOUT.select(groupElement("flags"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkDescriptorPoolCreateFlags flags
     * }
     */
    public static final OfInt flags$layout() {
        return flags$LAYOUT;
    }

    private static final long flags$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkDescriptorPoolCreateFlags flags
     * }
     */
    public static final long flags$offset() {
        return flags$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkDescriptorPoolCreateFlags flags
     * }
     */
    public static int flags(MemorySegment struct) {
        return struct.get(flags$LAYOUT, flags$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkDescriptorPoolCreateFlags flags
     * }
     */
    public static void flags(MemorySegment struct, int fieldValue) {
        struct.set(flags$LAYOUT, flags$OFFSET, fieldValue);
    }

    private static final OfInt maxSets$LAYOUT = (OfInt)$LAYOUT.select(groupElement("maxSets"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t maxSets
     * }
     */
    public static final OfInt maxSets$layout() {
        return maxSets$LAYOUT;
    }

    private static final long maxSets$OFFSET = 20;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t maxSets
     * }
     */
    public static final long maxSets$offset() {
        return maxSets$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t maxSets
     * }
     */
    public static int maxSets(MemorySegment struct) {
        return struct.get(maxSets$LAYOUT, maxSets$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t maxSets
     * }
     */
    public static void maxSets(MemorySegment struct, int fieldValue) {
        struct.set(maxSets$LAYOUT, maxSets$OFFSET, fieldValue);
    }

    private static final OfInt poolSizeCount$LAYOUT = (OfInt)$LAYOUT.select(groupElement("poolSizeCount"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t poolSizeCount
     * }
     */
    public static final OfInt poolSizeCount$layout() {
        return poolSizeCount$LAYOUT;
    }

    private static final long poolSizeCount$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t poolSizeCount
     * }
     */
    public static final long poolSizeCount$offset() {
        return poolSizeCount$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t poolSizeCount
     * }
     */
    public static int poolSizeCount(MemorySegment struct) {
        return struct.get(poolSizeCount$LAYOUT, poolSizeCount$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t poolSizeCount
     * }
     */
    public static void poolSizeCount(MemorySegment struct, int fieldValue) {
        struct.set(poolSizeCount$LAYOUT, poolSizeCount$OFFSET, fieldValue);
    }

    private static final AddressLayout pPoolSizes$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pPoolSizes"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const VkDescriptorPoolSize *pPoolSizes
     * }
     */
    public static final AddressLayout pPoolSizes$layout() {
        return pPoolSizes$LAYOUT;
    }

    private static final long pPoolSizes$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const VkDescriptorPoolSize *pPoolSizes
     * }
     */
    public static final long pPoolSizes$offset() {
        return pPoolSizes$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const VkDescriptorPoolSize *pPoolSizes
     * }
     */
    public static MemorySegment pPoolSizes(MemorySegment struct) {
        return struct.get(pPoolSizes$LAYOUT, pPoolSizes$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const VkDescriptorPoolSize *pPoolSizes
     * }
     */
    public static void pPoolSizes(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pPoolSizes$LAYOUT, pPoolSizes$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

