// Generated by jextract

package org.vulkan;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct VkDeviceFaultInfoEXT {
 *     VkStructureType sType;
 *     void *pNext;
 *     char description[256];
 *     VkDeviceFaultAddressInfoEXT *pAddressInfos;
 *     VkDeviceFaultVendorInfoEXT *pVendorInfos;
 *     void *pVendorBinaryData;
 * }
 * }
 */
public class VkDeviceFaultInfoEXT {

    VkDeviceFaultInfoEXT() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        vulkan_h.C_INT.withName("sType"),
        MemoryLayout.paddingLayout(4),
        vulkan_h.C_POINTER.withName("pNext"),
        MemoryLayout.sequenceLayout(256, vulkan_h.C_CHAR).withName("description"),
        vulkan_h.C_POINTER.withName("pAddressInfos"),
        vulkan_h.C_POINTER.withName("pVendorInfos"),
        vulkan_h.C_POINTER.withName("pVendorBinaryData")
    ).withName("VkDeviceFaultInfoEXT");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt sType$LAYOUT = (OfInt)$LAYOUT.select(groupElement("sType"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final OfInt sType$layout() {
        return sType$LAYOUT;
    }

    private static final long sType$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final long sType$offset() {
        return sType$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static int sType(MemorySegment struct) {
        return struct.get(sType$LAYOUT, sType$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static void sType(MemorySegment struct, int fieldValue) {
        struct.set(sType$LAYOUT, sType$OFFSET, fieldValue);
    }

    private static final AddressLayout pNext$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pNext"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * void *pNext
     * }
     */
    public static final AddressLayout pNext$layout() {
        return pNext$LAYOUT;
    }

    private static final long pNext$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * void *pNext
     * }
     */
    public static final long pNext$offset() {
        return pNext$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * void *pNext
     * }
     */
    public static MemorySegment pNext(MemorySegment struct) {
        return struct.get(pNext$LAYOUT, pNext$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * void *pNext
     * }
     */
    public static void pNext(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pNext$LAYOUT, pNext$OFFSET, fieldValue);
    }

    private static final SequenceLayout description$LAYOUT = (SequenceLayout)$LAYOUT.select(groupElement("description"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * char description[256]
     * }
     */
    public static final SequenceLayout description$layout() {
        return description$LAYOUT;
    }

    private static final long description$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * char description[256]
     * }
     */
    public static final long description$offset() {
        return description$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * char description[256]
     * }
     */
    public static MemorySegment description(MemorySegment struct) {
        return struct.asSlice(description$OFFSET, description$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * char description[256]
     * }
     */
    public static void description(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, description$OFFSET, description$LAYOUT.byteSize());
    }

    private static long[] description$DIMS = { 256 };

    /**
     * Dimensions for array field:
     * {@snippet lang=c :
     * char description[256]
     * }
     */
    public static long[] description$dimensions() {
        return description$DIMS;
    }
    private static final VarHandle description$ELEM_HANDLE = description$LAYOUT.varHandle(sequenceElement());

    /**
     * Indexed getter for field:
     * {@snippet lang=c :
     * char description[256]
     * }
     */
    public static byte description(MemorySegment struct, long index0) {
        return (byte)description$ELEM_HANDLE.get(struct, 0L, index0);
    }

    /**
     * Indexed setter for field:
     * {@snippet lang=c :
     * char description[256]
     * }
     */
    public static void description(MemorySegment struct, long index0, byte fieldValue) {
        description$ELEM_HANDLE.set(struct, 0L, index0, fieldValue);
    }

    private static final AddressLayout pAddressInfos$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pAddressInfos"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkDeviceFaultAddressInfoEXT *pAddressInfos
     * }
     */
    public static final AddressLayout pAddressInfos$layout() {
        return pAddressInfos$LAYOUT;
    }

    private static final long pAddressInfos$OFFSET = 272;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkDeviceFaultAddressInfoEXT *pAddressInfos
     * }
     */
    public static final long pAddressInfos$offset() {
        return pAddressInfos$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkDeviceFaultAddressInfoEXT *pAddressInfos
     * }
     */
    public static MemorySegment pAddressInfos(MemorySegment struct) {
        return struct.get(pAddressInfos$LAYOUT, pAddressInfos$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkDeviceFaultAddressInfoEXT *pAddressInfos
     * }
     */
    public static void pAddressInfos(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pAddressInfos$LAYOUT, pAddressInfos$OFFSET, fieldValue);
    }

    private static final AddressLayout pVendorInfos$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pVendorInfos"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkDeviceFaultVendorInfoEXT *pVendorInfos
     * }
     */
    public static final AddressLayout pVendorInfos$layout() {
        return pVendorInfos$LAYOUT;
    }

    private static final long pVendorInfos$OFFSET = 280;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkDeviceFaultVendorInfoEXT *pVendorInfos
     * }
     */
    public static final long pVendorInfos$offset() {
        return pVendorInfos$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkDeviceFaultVendorInfoEXT *pVendorInfos
     * }
     */
    public static MemorySegment pVendorInfos(MemorySegment struct) {
        return struct.get(pVendorInfos$LAYOUT, pVendorInfos$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkDeviceFaultVendorInfoEXT *pVendorInfos
     * }
     */
    public static void pVendorInfos(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pVendorInfos$LAYOUT, pVendorInfos$OFFSET, fieldValue);
    }

    private static final AddressLayout pVendorBinaryData$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pVendorBinaryData"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * void *pVendorBinaryData
     * }
     */
    public static final AddressLayout pVendorBinaryData$layout() {
        return pVendorBinaryData$LAYOUT;
    }

    private static final long pVendorBinaryData$OFFSET = 288;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * void *pVendorBinaryData
     * }
     */
    public static final long pVendorBinaryData$offset() {
        return pVendorBinaryData$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * void *pVendorBinaryData
     * }
     */
    public static MemorySegment pVendorBinaryData(MemorySegment struct) {
        return struct.get(pVendorBinaryData$LAYOUT, pVendorBinaryData$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * void *pVendorBinaryData
     * }
     */
    public static void pVendorBinaryData(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pVendorBinaryData$LAYOUT, pVendorBinaryData$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

