// Generated by jextract

package org.vulkan;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct VkDepthBiasInfoEXT {
 *     VkStructureType sType;
 *     const void *pNext;
 *     float depthBiasConstantFactor;
 *     float depthBiasClamp;
 *     float depthBiasSlopeFactor;
 * }
 * }
 */
public class VkDepthBiasInfoEXT {

    VkDepthBiasInfoEXT() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        vulkan_h.C_INT.withName("sType"),
        MemoryLayout.paddingLayout(4),
        vulkan_h.C_POINTER.withName("pNext"),
        vulkan_h.C_FLOAT.withName("depthBiasConstantFactor"),
        vulkan_h.C_FLOAT.withName("depthBiasClamp"),
        vulkan_h.C_FLOAT.withName("depthBiasSlopeFactor"),
        MemoryLayout.paddingLayout(4)
    ).withName("VkDepthBiasInfoEXT");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt sType$LAYOUT = (OfInt)$LAYOUT.select(groupElement("sType"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final OfInt sType$layout() {
        return sType$LAYOUT;
    }

    private static final long sType$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final long sType$offset() {
        return sType$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static int sType(MemorySegment struct) {
        return struct.get(sType$LAYOUT, sType$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static void sType(MemorySegment struct, int fieldValue) {
        struct.set(sType$LAYOUT, sType$OFFSET, fieldValue);
    }

    private static final AddressLayout pNext$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pNext"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static final AddressLayout pNext$layout() {
        return pNext$LAYOUT;
    }

    private static final long pNext$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static final long pNext$offset() {
        return pNext$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static MemorySegment pNext(MemorySegment struct) {
        return struct.get(pNext$LAYOUT, pNext$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static void pNext(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pNext$LAYOUT, pNext$OFFSET, fieldValue);
    }

    private static final OfFloat depthBiasConstantFactor$LAYOUT = (OfFloat)$LAYOUT.select(groupElement("depthBiasConstantFactor"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * float depthBiasConstantFactor
     * }
     */
    public static final OfFloat depthBiasConstantFactor$layout() {
        return depthBiasConstantFactor$LAYOUT;
    }

    private static final long depthBiasConstantFactor$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * float depthBiasConstantFactor
     * }
     */
    public static final long depthBiasConstantFactor$offset() {
        return depthBiasConstantFactor$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * float depthBiasConstantFactor
     * }
     */
    public static float depthBiasConstantFactor(MemorySegment struct) {
        return struct.get(depthBiasConstantFactor$LAYOUT, depthBiasConstantFactor$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * float depthBiasConstantFactor
     * }
     */
    public static void depthBiasConstantFactor(MemorySegment struct, float fieldValue) {
        struct.set(depthBiasConstantFactor$LAYOUT, depthBiasConstantFactor$OFFSET, fieldValue);
    }

    private static final OfFloat depthBiasClamp$LAYOUT = (OfFloat)$LAYOUT.select(groupElement("depthBiasClamp"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * float depthBiasClamp
     * }
     */
    public static final OfFloat depthBiasClamp$layout() {
        return depthBiasClamp$LAYOUT;
    }

    private static final long depthBiasClamp$OFFSET = 20;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * float depthBiasClamp
     * }
     */
    public static final long depthBiasClamp$offset() {
        return depthBiasClamp$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * float depthBiasClamp
     * }
     */
    public static float depthBiasClamp(MemorySegment struct) {
        return struct.get(depthBiasClamp$LAYOUT, depthBiasClamp$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * float depthBiasClamp
     * }
     */
    public static void depthBiasClamp(MemorySegment struct, float fieldValue) {
        struct.set(depthBiasClamp$LAYOUT, depthBiasClamp$OFFSET, fieldValue);
    }

    private static final OfFloat depthBiasSlopeFactor$LAYOUT = (OfFloat)$LAYOUT.select(groupElement("depthBiasSlopeFactor"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * float depthBiasSlopeFactor
     * }
     */
    public static final OfFloat depthBiasSlopeFactor$layout() {
        return depthBiasSlopeFactor$LAYOUT;
    }

    private static final long depthBiasSlopeFactor$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * float depthBiasSlopeFactor
     * }
     */
    public static final long depthBiasSlopeFactor$offset() {
        return depthBiasSlopeFactor$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * float depthBiasSlopeFactor
     * }
     */
    public static float depthBiasSlopeFactor(MemorySegment struct) {
        return struct.get(depthBiasSlopeFactor$LAYOUT, depthBiasSlopeFactor$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * float depthBiasSlopeFactor
     * }
     */
    public static void depthBiasSlopeFactor(MemorySegment struct, float fieldValue) {
        struct.set(depthBiasSlopeFactor$LAYOUT, depthBiasSlopeFactor$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

