// Generated by jextract

package org.vulkan;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct VkDeviceFaultCountsEXT {
 *     VkStructureType sType;
 *     void *pNext;
 *     uint32_t addressInfoCount;
 *     uint32_t vendorInfoCount;
 *     VkDeviceSize vendorBinarySize;
 * }
 * }
 */
public class VkDeviceFaultCountsEXT {

    VkDeviceFaultCountsEXT() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        vulkan_h.C_INT.withName("sType"),
        MemoryLayout.paddingLayout(4),
        vulkan_h.C_POINTER.withName("pNext"),
        vulkan_h.C_INT.withName("addressInfoCount"),
        vulkan_h.C_INT.withName("vendorInfoCount"),
        vulkan_h.C_LONG_LONG.withName("vendorBinarySize")
    ).withName("VkDeviceFaultCountsEXT");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt sType$LAYOUT = (OfInt)$LAYOUT.select(groupElement("sType"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final OfInt sType$layout() {
        return sType$LAYOUT;
    }

    private static final long sType$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final long sType$offset() {
        return sType$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static int sType(MemorySegment struct) {
        return struct.get(sType$LAYOUT, sType$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static void sType(MemorySegment struct, int fieldValue) {
        struct.set(sType$LAYOUT, sType$OFFSET, fieldValue);
    }

    private static final AddressLayout pNext$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pNext"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * void *pNext
     * }
     */
    public static final AddressLayout pNext$layout() {
        return pNext$LAYOUT;
    }

    private static final long pNext$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * void *pNext
     * }
     */
    public static final long pNext$offset() {
        return pNext$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * void *pNext
     * }
     */
    public static MemorySegment pNext(MemorySegment struct) {
        return struct.get(pNext$LAYOUT, pNext$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * void *pNext
     * }
     */
    public static void pNext(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pNext$LAYOUT, pNext$OFFSET, fieldValue);
    }

    private static final OfInt addressInfoCount$LAYOUT = (OfInt)$LAYOUT.select(groupElement("addressInfoCount"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t addressInfoCount
     * }
     */
    public static final OfInt addressInfoCount$layout() {
        return addressInfoCount$LAYOUT;
    }

    private static final long addressInfoCount$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t addressInfoCount
     * }
     */
    public static final long addressInfoCount$offset() {
        return addressInfoCount$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t addressInfoCount
     * }
     */
    public static int addressInfoCount(MemorySegment struct) {
        return struct.get(addressInfoCount$LAYOUT, addressInfoCount$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t addressInfoCount
     * }
     */
    public static void addressInfoCount(MemorySegment struct, int fieldValue) {
        struct.set(addressInfoCount$LAYOUT, addressInfoCount$OFFSET, fieldValue);
    }

    private static final OfInt vendorInfoCount$LAYOUT = (OfInt)$LAYOUT.select(groupElement("vendorInfoCount"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t vendorInfoCount
     * }
     */
    public static final OfInt vendorInfoCount$layout() {
        return vendorInfoCount$LAYOUT;
    }

    private static final long vendorInfoCount$OFFSET = 20;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t vendorInfoCount
     * }
     */
    public static final long vendorInfoCount$offset() {
        return vendorInfoCount$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t vendorInfoCount
     * }
     */
    public static int vendorInfoCount(MemorySegment struct) {
        return struct.get(vendorInfoCount$LAYOUT, vendorInfoCount$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t vendorInfoCount
     * }
     */
    public static void vendorInfoCount(MemorySegment struct, int fieldValue) {
        struct.set(vendorInfoCount$LAYOUT, vendorInfoCount$OFFSET, fieldValue);
    }

    private static final OfLong vendorBinarySize$LAYOUT = (OfLong)$LAYOUT.select(groupElement("vendorBinarySize"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkDeviceSize vendorBinarySize
     * }
     */
    public static final OfLong vendorBinarySize$layout() {
        return vendorBinarySize$LAYOUT;
    }

    private static final long vendorBinarySize$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkDeviceSize vendorBinarySize
     * }
     */
    public static final long vendorBinarySize$offset() {
        return vendorBinarySize$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkDeviceSize vendorBinarySize
     * }
     */
    public static long vendorBinarySize(MemorySegment struct) {
        return struct.get(vendorBinarySize$LAYOUT, vendorBinarySize$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkDeviceSize vendorBinarySize
     * }
     */
    public static void vendorBinarySize(MemorySegment struct, long fieldValue) {
        struct.set(vendorBinarySize$LAYOUT, vendorBinarySize$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

