// Generated by jextract

package org.vulkan;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct VkDeviceGroupSubmitInfo {
 *     VkStructureType sType;
 *     const void *pNext;
 *     uint32_t waitSemaphoreCount;
 *     const uint32_t *pWaitSemaphoreDeviceIndices;
 *     uint32_t commandBufferCount;
 *     const uint32_t *pCommandBufferDeviceMasks;
 *     uint32_t signalSemaphoreCount;
 *     const uint32_t *pSignalSemaphoreDeviceIndices;
 * }
 * }
 */
public class VkDeviceGroupSubmitInfo {

    VkDeviceGroupSubmitInfo() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        vulkan_h.C_INT.withName("sType"),
        MemoryLayout.paddingLayout(4),
        vulkan_h.C_POINTER.withName("pNext"),
        vulkan_h.C_INT.withName("waitSemaphoreCount"),
        MemoryLayout.paddingLayout(4),
        vulkan_h.C_POINTER.withName("pWaitSemaphoreDeviceIndices"),
        vulkan_h.C_INT.withName("commandBufferCount"),
        MemoryLayout.paddingLayout(4),
        vulkan_h.C_POINTER.withName("pCommandBufferDeviceMasks"),
        vulkan_h.C_INT.withName("signalSemaphoreCount"),
        MemoryLayout.paddingLayout(4),
        vulkan_h.C_POINTER.withName("pSignalSemaphoreDeviceIndices")
    ).withName("VkDeviceGroupSubmitInfo");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt sType$LAYOUT = (OfInt)$LAYOUT.select(groupElement("sType"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final OfInt sType$layout() {
        return sType$LAYOUT;
    }

    private static final long sType$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final long sType$offset() {
        return sType$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static int sType(MemorySegment struct) {
        return struct.get(sType$LAYOUT, sType$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static void sType(MemorySegment struct, int fieldValue) {
        struct.set(sType$LAYOUT, sType$OFFSET, fieldValue);
    }

    private static final AddressLayout pNext$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pNext"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static final AddressLayout pNext$layout() {
        return pNext$LAYOUT;
    }

    private static final long pNext$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static final long pNext$offset() {
        return pNext$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static MemorySegment pNext(MemorySegment struct) {
        return struct.get(pNext$LAYOUT, pNext$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static void pNext(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pNext$LAYOUT, pNext$OFFSET, fieldValue);
    }

    private static final OfInt waitSemaphoreCount$LAYOUT = (OfInt)$LAYOUT.select(groupElement("waitSemaphoreCount"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t waitSemaphoreCount
     * }
     */
    public static final OfInt waitSemaphoreCount$layout() {
        return waitSemaphoreCount$LAYOUT;
    }

    private static final long waitSemaphoreCount$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t waitSemaphoreCount
     * }
     */
    public static final long waitSemaphoreCount$offset() {
        return waitSemaphoreCount$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t waitSemaphoreCount
     * }
     */
    public static int waitSemaphoreCount(MemorySegment struct) {
        return struct.get(waitSemaphoreCount$LAYOUT, waitSemaphoreCount$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t waitSemaphoreCount
     * }
     */
    public static void waitSemaphoreCount(MemorySegment struct, int fieldValue) {
        struct.set(waitSemaphoreCount$LAYOUT, waitSemaphoreCount$OFFSET, fieldValue);
    }

    private static final AddressLayout pWaitSemaphoreDeviceIndices$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pWaitSemaphoreDeviceIndices"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const uint32_t *pWaitSemaphoreDeviceIndices
     * }
     */
    public static final AddressLayout pWaitSemaphoreDeviceIndices$layout() {
        return pWaitSemaphoreDeviceIndices$LAYOUT;
    }

    private static final long pWaitSemaphoreDeviceIndices$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const uint32_t *pWaitSemaphoreDeviceIndices
     * }
     */
    public static final long pWaitSemaphoreDeviceIndices$offset() {
        return pWaitSemaphoreDeviceIndices$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const uint32_t *pWaitSemaphoreDeviceIndices
     * }
     */
    public static MemorySegment pWaitSemaphoreDeviceIndices(MemorySegment struct) {
        return struct.get(pWaitSemaphoreDeviceIndices$LAYOUT, pWaitSemaphoreDeviceIndices$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const uint32_t *pWaitSemaphoreDeviceIndices
     * }
     */
    public static void pWaitSemaphoreDeviceIndices(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pWaitSemaphoreDeviceIndices$LAYOUT, pWaitSemaphoreDeviceIndices$OFFSET, fieldValue);
    }

    private static final OfInt commandBufferCount$LAYOUT = (OfInt)$LAYOUT.select(groupElement("commandBufferCount"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t commandBufferCount
     * }
     */
    public static final OfInt commandBufferCount$layout() {
        return commandBufferCount$LAYOUT;
    }

    private static final long commandBufferCount$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t commandBufferCount
     * }
     */
    public static final long commandBufferCount$offset() {
        return commandBufferCount$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t commandBufferCount
     * }
     */
    public static int commandBufferCount(MemorySegment struct) {
        return struct.get(commandBufferCount$LAYOUT, commandBufferCount$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t commandBufferCount
     * }
     */
    public static void commandBufferCount(MemorySegment struct, int fieldValue) {
        struct.set(commandBufferCount$LAYOUT, commandBufferCount$OFFSET, fieldValue);
    }

    private static final AddressLayout pCommandBufferDeviceMasks$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pCommandBufferDeviceMasks"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const uint32_t *pCommandBufferDeviceMasks
     * }
     */
    public static final AddressLayout pCommandBufferDeviceMasks$layout() {
        return pCommandBufferDeviceMasks$LAYOUT;
    }

    private static final long pCommandBufferDeviceMasks$OFFSET = 40;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const uint32_t *pCommandBufferDeviceMasks
     * }
     */
    public static final long pCommandBufferDeviceMasks$offset() {
        return pCommandBufferDeviceMasks$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const uint32_t *pCommandBufferDeviceMasks
     * }
     */
    public static MemorySegment pCommandBufferDeviceMasks(MemorySegment struct) {
        return struct.get(pCommandBufferDeviceMasks$LAYOUT, pCommandBufferDeviceMasks$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const uint32_t *pCommandBufferDeviceMasks
     * }
     */
    public static void pCommandBufferDeviceMasks(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pCommandBufferDeviceMasks$LAYOUT, pCommandBufferDeviceMasks$OFFSET, fieldValue);
    }

    private static final OfInt signalSemaphoreCount$LAYOUT = (OfInt)$LAYOUT.select(groupElement("signalSemaphoreCount"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t signalSemaphoreCount
     * }
     */
    public static final OfInt signalSemaphoreCount$layout() {
        return signalSemaphoreCount$LAYOUT;
    }

    private static final long signalSemaphoreCount$OFFSET = 48;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t signalSemaphoreCount
     * }
     */
    public static final long signalSemaphoreCount$offset() {
        return signalSemaphoreCount$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t signalSemaphoreCount
     * }
     */
    public static int signalSemaphoreCount(MemorySegment struct) {
        return struct.get(signalSemaphoreCount$LAYOUT, signalSemaphoreCount$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t signalSemaphoreCount
     * }
     */
    public static void signalSemaphoreCount(MemorySegment struct, int fieldValue) {
        struct.set(signalSemaphoreCount$LAYOUT, signalSemaphoreCount$OFFSET, fieldValue);
    }

    private static final AddressLayout pSignalSemaphoreDeviceIndices$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pSignalSemaphoreDeviceIndices"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const uint32_t *pSignalSemaphoreDeviceIndices
     * }
     */
    public static final AddressLayout pSignalSemaphoreDeviceIndices$layout() {
        return pSignalSemaphoreDeviceIndices$LAYOUT;
    }

    private static final long pSignalSemaphoreDeviceIndices$OFFSET = 56;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const uint32_t *pSignalSemaphoreDeviceIndices
     * }
     */
    public static final long pSignalSemaphoreDeviceIndices$offset() {
        return pSignalSemaphoreDeviceIndices$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const uint32_t *pSignalSemaphoreDeviceIndices
     * }
     */
    public static MemorySegment pSignalSemaphoreDeviceIndices(MemorySegment struct) {
        return struct.get(pSignalSemaphoreDeviceIndices$LAYOUT, pSignalSemaphoreDeviceIndices$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const uint32_t *pSignalSemaphoreDeviceIndices
     * }
     */
    public static void pSignalSemaphoreDeviceIndices(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pSignalSemaphoreDeviceIndices$LAYOUT, pSignalSemaphoreDeviceIndices$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

