// Generated by jextract

package org.vulkan;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct VkDebugUtilsObjectTagInfoEXT {
 *     VkStructureType sType;
 *     const void *pNext;
 *     VkObjectType objectType;
 *     uint64_t objectHandle;
 *     uint64_t tagName;
 *     size_t tagSize;
 *     const void *pTag;
 * }
 * }
 */
public class VkDebugUtilsObjectTagInfoEXT {

    VkDebugUtilsObjectTagInfoEXT() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        vulkan_h.C_INT.withName("sType"),
        MemoryLayout.paddingLayout(4),
        vulkan_h.C_POINTER.withName("pNext"),
        vulkan_h.C_INT.withName("objectType"),
        MemoryLayout.paddingLayout(4),
        vulkan_h.C_LONG_LONG.withName("objectHandle"),
        vulkan_h.C_LONG_LONG.withName("tagName"),
        vulkan_h.C_LONG.withName("tagSize"),
        vulkan_h.C_POINTER.withName("pTag")
    ).withName("VkDebugUtilsObjectTagInfoEXT");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt sType$LAYOUT = (OfInt)$LAYOUT.select(groupElement("sType"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final OfInt sType$layout() {
        return sType$LAYOUT;
    }

    private static final long sType$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final long sType$offset() {
        return sType$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static int sType(MemorySegment struct) {
        return struct.get(sType$LAYOUT, sType$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static void sType(MemorySegment struct, int fieldValue) {
        struct.set(sType$LAYOUT, sType$OFFSET, fieldValue);
    }

    private static final AddressLayout pNext$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pNext"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static final AddressLayout pNext$layout() {
        return pNext$LAYOUT;
    }

    private static final long pNext$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static final long pNext$offset() {
        return pNext$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static MemorySegment pNext(MemorySegment struct) {
        return struct.get(pNext$LAYOUT, pNext$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static void pNext(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pNext$LAYOUT, pNext$OFFSET, fieldValue);
    }

    private static final OfInt objectType$LAYOUT = (OfInt)$LAYOUT.select(groupElement("objectType"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkObjectType objectType
     * }
     */
    public static final OfInt objectType$layout() {
        return objectType$LAYOUT;
    }

    private static final long objectType$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkObjectType objectType
     * }
     */
    public static final long objectType$offset() {
        return objectType$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkObjectType objectType
     * }
     */
    public static int objectType(MemorySegment struct) {
        return struct.get(objectType$LAYOUT, objectType$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkObjectType objectType
     * }
     */
    public static void objectType(MemorySegment struct, int fieldValue) {
        struct.set(objectType$LAYOUT, objectType$OFFSET, fieldValue);
    }

    private static final OfLong objectHandle$LAYOUT = (OfLong)$LAYOUT.select(groupElement("objectHandle"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint64_t objectHandle
     * }
     */
    public static final OfLong objectHandle$layout() {
        return objectHandle$LAYOUT;
    }

    private static final long objectHandle$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint64_t objectHandle
     * }
     */
    public static final long objectHandle$offset() {
        return objectHandle$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint64_t objectHandle
     * }
     */
    public static long objectHandle(MemorySegment struct) {
        return struct.get(objectHandle$LAYOUT, objectHandle$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint64_t objectHandle
     * }
     */
    public static void objectHandle(MemorySegment struct, long fieldValue) {
        struct.set(objectHandle$LAYOUT, objectHandle$OFFSET, fieldValue);
    }

    private static final OfLong tagName$LAYOUT = (OfLong)$LAYOUT.select(groupElement("tagName"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint64_t tagName
     * }
     */
    public static final OfLong tagName$layout() {
        return tagName$LAYOUT;
    }

    private static final long tagName$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint64_t tagName
     * }
     */
    public static final long tagName$offset() {
        return tagName$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint64_t tagName
     * }
     */
    public static long tagName(MemorySegment struct) {
        return struct.get(tagName$LAYOUT, tagName$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint64_t tagName
     * }
     */
    public static void tagName(MemorySegment struct, long fieldValue) {
        struct.set(tagName$LAYOUT, tagName$OFFSET, fieldValue);
    }

    private static final OfLong tagSize$LAYOUT = (OfLong)$LAYOUT.select(groupElement("tagSize"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * size_t tagSize
     * }
     */
    public static final OfLong tagSize$layout() {
        return tagSize$LAYOUT;
    }

    private static final long tagSize$OFFSET = 40;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * size_t tagSize
     * }
     */
    public static final long tagSize$offset() {
        return tagSize$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * size_t tagSize
     * }
     */
    public static long tagSize(MemorySegment struct) {
        return struct.get(tagSize$LAYOUT, tagSize$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * size_t tagSize
     * }
     */
    public static void tagSize(MemorySegment struct, long fieldValue) {
        struct.set(tagSize$LAYOUT, tagSize$OFFSET, fieldValue);
    }

    private static final AddressLayout pTag$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pTag"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const void *pTag
     * }
     */
    public static final AddressLayout pTag$layout() {
        return pTag$LAYOUT;
    }

    private static final long pTag$OFFSET = 48;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const void *pTag
     * }
     */
    public static final long pTag$offset() {
        return pTag$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const void *pTag
     * }
     */
    public static MemorySegment pTag(MemorySegment struct) {
        return struct.get(pTag$LAYOUT, pTag$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const void *pTag
     * }
     */
    public static void pTag(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pTag$LAYOUT, pTag$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

