// Generated by jextract

package org.vulkan;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct VkDescriptorUpdateTemplateEntry {
 *     uint32_t dstBinding;
 *     uint32_t dstArrayElement;
 *     uint32_t descriptorCount;
 *     VkDescriptorType descriptorType;
 *     size_t offset;
 *     size_t stride;
 * }
 * }
 */
public class VkDescriptorUpdateTemplateEntry {

    VkDescriptorUpdateTemplateEntry() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        vulkan_h.C_INT.withName("dstBinding"),
        vulkan_h.C_INT.withName("dstArrayElement"),
        vulkan_h.C_INT.withName("descriptorCount"),
        vulkan_h.C_INT.withName("descriptorType"),
        vulkan_h.C_LONG.withName("offset"),
        vulkan_h.C_LONG.withName("stride")
    ).withName("VkDescriptorUpdateTemplateEntry");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt dstBinding$LAYOUT = (OfInt)$LAYOUT.select(groupElement("dstBinding"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t dstBinding
     * }
     */
    public static final OfInt dstBinding$layout() {
        return dstBinding$LAYOUT;
    }

    private static final long dstBinding$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t dstBinding
     * }
     */
    public static final long dstBinding$offset() {
        return dstBinding$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t dstBinding
     * }
     */
    public static int dstBinding(MemorySegment struct) {
        return struct.get(dstBinding$LAYOUT, dstBinding$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t dstBinding
     * }
     */
    public static void dstBinding(MemorySegment struct, int fieldValue) {
        struct.set(dstBinding$LAYOUT, dstBinding$OFFSET, fieldValue);
    }

    private static final OfInt dstArrayElement$LAYOUT = (OfInt)$LAYOUT.select(groupElement("dstArrayElement"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t dstArrayElement
     * }
     */
    public static final OfInt dstArrayElement$layout() {
        return dstArrayElement$LAYOUT;
    }

    private static final long dstArrayElement$OFFSET = 4;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t dstArrayElement
     * }
     */
    public static final long dstArrayElement$offset() {
        return dstArrayElement$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t dstArrayElement
     * }
     */
    public static int dstArrayElement(MemorySegment struct) {
        return struct.get(dstArrayElement$LAYOUT, dstArrayElement$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t dstArrayElement
     * }
     */
    public static void dstArrayElement(MemorySegment struct, int fieldValue) {
        struct.set(dstArrayElement$LAYOUT, dstArrayElement$OFFSET, fieldValue);
    }

    private static final OfInt descriptorCount$LAYOUT = (OfInt)$LAYOUT.select(groupElement("descriptorCount"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t descriptorCount
     * }
     */
    public static final OfInt descriptorCount$layout() {
        return descriptorCount$LAYOUT;
    }

    private static final long descriptorCount$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t descriptorCount
     * }
     */
    public static final long descriptorCount$offset() {
        return descriptorCount$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t descriptorCount
     * }
     */
    public static int descriptorCount(MemorySegment struct) {
        return struct.get(descriptorCount$LAYOUT, descriptorCount$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t descriptorCount
     * }
     */
    public static void descriptorCount(MemorySegment struct, int fieldValue) {
        struct.set(descriptorCount$LAYOUT, descriptorCount$OFFSET, fieldValue);
    }

    private static final OfInt descriptorType$LAYOUT = (OfInt)$LAYOUT.select(groupElement("descriptorType"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkDescriptorType descriptorType
     * }
     */
    public static final OfInt descriptorType$layout() {
        return descriptorType$LAYOUT;
    }

    private static final long descriptorType$OFFSET = 12;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkDescriptorType descriptorType
     * }
     */
    public static final long descriptorType$offset() {
        return descriptorType$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkDescriptorType descriptorType
     * }
     */
    public static int descriptorType(MemorySegment struct) {
        return struct.get(descriptorType$LAYOUT, descriptorType$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkDescriptorType descriptorType
     * }
     */
    public static void descriptorType(MemorySegment struct, int fieldValue) {
        struct.set(descriptorType$LAYOUT, descriptorType$OFFSET, fieldValue);
    }

    private static final OfLong offset$LAYOUT = (OfLong)$LAYOUT.select(groupElement("offset"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * size_t offset
     * }
     */
    public static final OfLong offset$layout() {
        return offset$LAYOUT;
    }

    private static final long offset$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * size_t offset
     * }
     */
    public static final long offset$offset() {
        return offset$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * size_t offset
     * }
     */
    public static long offset(MemorySegment struct) {
        return struct.get(offset$LAYOUT, offset$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * size_t offset
     * }
     */
    public static void offset(MemorySegment struct, long fieldValue) {
        struct.set(offset$LAYOUT, offset$OFFSET, fieldValue);
    }

    private static final OfLong stride$LAYOUT = (OfLong)$LAYOUT.select(groupElement("stride"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * size_t stride
     * }
     */
    public static final OfLong stride$layout() {
        return stride$LAYOUT;
    }

    private static final long stride$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * size_t stride
     * }
     */
    public static final long stride$offset() {
        return stride$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * size_t stride
     * }
     */
    public static long stride(MemorySegment struct) {
        return struct.get(stride$LAYOUT, stride$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * size_t stride
     * }
     */
    public static void stride(MemorySegment struct, long fieldValue) {
        struct.set(stride$LAYOUT, stride$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

