// Generated by jextract

package org.vulkan;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct VkDisplayPresentInfoKHR {
 *     VkStructureType sType;
 *     const void *pNext;
 *     VkRect2D srcRect;
 *     VkRect2D dstRect;
 *     VkBool32 persistent;
 * }
 * }
 */
public class VkDisplayPresentInfoKHR {

    VkDisplayPresentInfoKHR() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        vulkan_h.C_INT.withName("sType"),
        MemoryLayout.paddingLayout(4),
        vulkan_h.C_POINTER.withName("pNext"),
        VkRect2D.layout().withName("srcRect"),
        VkRect2D.layout().withName("dstRect"),
        vulkan_h.C_INT.withName("persistent"),
        MemoryLayout.paddingLayout(4)
    ).withName("VkDisplayPresentInfoKHR");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt sType$LAYOUT = (OfInt)$LAYOUT.select(groupElement("sType"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final OfInt sType$layout() {
        return sType$LAYOUT;
    }

    private static final long sType$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final long sType$offset() {
        return sType$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static int sType(MemorySegment struct) {
        return struct.get(sType$LAYOUT, sType$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static void sType(MemorySegment struct, int fieldValue) {
        struct.set(sType$LAYOUT, sType$OFFSET, fieldValue);
    }

    private static final AddressLayout pNext$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pNext"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static final AddressLayout pNext$layout() {
        return pNext$LAYOUT;
    }

    private static final long pNext$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static final long pNext$offset() {
        return pNext$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static MemorySegment pNext(MemorySegment struct) {
        return struct.get(pNext$LAYOUT, pNext$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static void pNext(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pNext$LAYOUT, pNext$OFFSET, fieldValue);
    }

    private static final GroupLayout srcRect$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("srcRect"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkRect2D srcRect
     * }
     */
    public static final GroupLayout srcRect$layout() {
        return srcRect$LAYOUT;
    }

    private static final long srcRect$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkRect2D srcRect
     * }
     */
    public static final long srcRect$offset() {
        return srcRect$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkRect2D srcRect
     * }
     */
    public static MemorySegment srcRect(MemorySegment struct) {
        return struct.asSlice(srcRect$OFFSET, srcRect$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkRect2D srcRect
     * }
     */
    public static void srcRect(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, srcRect$OFFSET, srcRect$LAYOUT.byteSize());
    }

    private static final GroupLayout dstRect$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("dstRect"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkRect2D dstRect
     * }
     */
    public static final GroupLayout dstRect$layout() {
        return dstRect$LAYOUT;
    }

    private static final long dstRect$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkRect2D dstRect
     * }
     */
    public static final long dstRect$offset() {
        return dstRect$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkRect2D dstRect
     * }
     */
    public static MemorySegment dstRect(MemorySegment struct) {
        return struct.asSlice(dstRect$OFFSET, dstRect$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkRect2D dstRect
     * }
     */
    public static void dstRect(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, dstRect$OFFSET, dstRect$LAYOUT.byteSize());
    }

    private static final OfInt persistent$LAYOUT = (OfInt)$LAYOUT.select(groupElement("persistent"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkBool32 persistent
     * }
     */
    public static final OfInt persistent$layout() {
        return persistent$LAYOUT;
    }

    private static final long persistent$OFFSET = 48;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkBool32 persistent
     * }
     */
    public static final long persistent$offset() {
        return persistent$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkBool32 persistent
     * }
     */
    public static int persistent(MemorySegment struct) {
        return struct.get(persistent$LAYOUT, persistent$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkBool32 persistent
     * }
     */
    public static void persistent(MemorySegment struct, int fieldValue) {
        struct.set(persistent$LAYOUT, persistent$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

