// Generated by jextract

package org.vulkan;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct VkFormatProperties3 {
 *     VkStructureType sType;
 *     void *pNext;
 *     VkFormatFeatureFlags2 linearTilingFeatures;
 *     VkFormatFeatureFlags2 optimalTilingFeatures;
 *     VkFormatFeatureFlags2 bufferFeatures;
 * }
 * }
 */
public class VkFormatProperties3 {

    VkFormatProperties3() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        vulkan_h.C_INT.withName("sType"),
        MemoryLayout.paddingLayout(4),
        vulkan_h.C_POINTER.withName("pNext"),
        vulkan_h.C_LONG_LONG.withName("linearTilingFeatures"),
        vulkan_h.C_LONG_LONG.withName("optimalTilingFeatures"),
        vulkan_h.C_LONG_LONG.withName("bufferFeatures")
    ).withName("VkFormatProperties3");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt sType$LAYOUT = (OfInt)$LAYOUT.select(groupElement("sType"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final OfInt sType$layout() {
        return sType$LAYOUT;
    }

    private static final long sType$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final long sType$offset() {
        return sType$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static int sType(MemorySegment struct) {
        return struct.get(sType$LAYOUT, sType$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static void sType(MemorySegment struct, int fieldValue) {
        struct.set(sType$LAYOUT, sType$OFFSET, fieldValue);
    }

    private static final AddressLayout pNext$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pNext"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * void *pNext
     * }
     */
    public static final AddressLayout pNext$layout() {
        return pNext$LAYOUT;
    }

    private static final long pNext$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * void *pNext
     * }
     */
    public static final long pNext$offset() {
        return pNext$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * void *pNext
     * }
     */
    public static MemorySegment pNext(MemorySegment struct) {
        return struct.get(pNext$LAYOUT, pNext$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * void *pNext
     * }
     */
    public static void pNext(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pNext$LAYOUT, pNext$OFFSET, fieldValue);
    }

    private static final OfLong linearTilingFeatures$LAYOUT = (OfLong)$LAYOUT.select(groupElement("linearTilingFeatures"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkFormatFeatureFlags2 linearTilingFeatures
     * }
     */
    public static final OfLong linearTilingFeatures$layout() {
        return linearTilingFeatures$LAYOUT;
    }

    private static final long linearTilingFeatures$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkFormatFeatureFlags2 linearTilingFeatures
     * }
     */
    public static final long linearTilingFeatures$offset() {
        return linearTilingFeatures$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkFormatFeatureFlags2 linearTilingFeatures
     * }
     */
    public static long linearTilingFeatures(MemorySegment struct) {
        return struct.get(linearTilingFeatures$LAYOUT, linearTilingFeatures$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkFormatFeatureFlags2 linearTilingFeatures
     * }
     */
    public static void linearTilingFeatures(MemorySegment struct, long fieldValue) {
        struct.set(linearTilingFeatures$LAYOUT, linearTilingFeatures$OFFSET, fieldValue);
    }

    private static final OfLong optimalTilingFeatures$LAYOUT = (OfLong)$LAYOUT.select(groupElement("optimalTilingFeatures"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkFormatFeatureFlags2 optimalTilingFeatures
     * }
     */
    public static final OfLong optimalTilingFeatures$layout() {
        return optimalTilingFeatures$LAYOUT;
    }

    private static final long optimalTilingFeatures$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkFormatFeatureFlags2 optimalTilingFeatures
     * }
     */
    public static final long optimalTilingFeatures$offset() {
        return optimalTilingFeatures$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkFormatFeatureFlags2 optimalTilingFeatures
     * }
     */
    public static long optimalTilingFeatures(MemorySegment struct) {
        return struct.get(optimalTilingFeatures$LAYOUT, optimalTilingFeatures$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkFormatFeatureFlags2 optimalTilingFeatures
     * }
     */
    public static void optimalTilingFeatures(MemorySegment struct, long fieldValue) {
        struct.set(optimalTilingFeatures$LAYOUT, optimalTilingFeatures$OFFSET, fieldValue);
    }

    private static final OfLong bufferFeatures$LAYOUT = (OfLong)$LAYOUT.select(groupElement("bufferFeatures"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkFormatFeatureFlags2 bufferFeatures
     * }
     */
    public static final OfLong bufferFeatures$layout() {
        return bufferFeatures$LAYOUT;
    }

    private static final long bufferFeatures$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkFormatFeatureFlags2 bufferFeatures
     * }
     */
    public static final long bufferFeatures$offset() {
        return bufferFeatures$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkFormatFeatureFlags2 bufferFeatures
     * }
     */
    public static long bufferFeatures(MemorySegment struct) {
        return struct.get(bufferFeatures$LAYOUT, bufferFeatures$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkFormatFeatureFlags2 bufferFeatures
     * }
     */
    public static void bufferFeatures(MemorySegment struct, long fieldValue) {
        struct.set(bufferFeatures$LAYOUT, bufferFeatures$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

