// Generated by jextract

package org.vulkan;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct VkImageDrmFormatModifierExplicitCreateInfoEXT {
 *     VkStructureType sType;
 *     const void *pNext;
 *     uint64_t drmFormatModifier;
 *     uint32_t drmFormatModifierPlaneCount;
 *     const VkSubresourceLayout *pPlaneLayouts;
 * }
 * }
 */
public class VkImageDrmFormatModifierExplicitCreateInfoEXT {

    VkImageDrmFormatModifierExplicitCreateInfoEXT() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        vulkan_h.C_INT.withName("sType"),
        MemoryLayout.paddingLayout(4),
        vulkan_h.C_POINTER.withName("pNext"),
        vulkan_h.C_LONG_LONG.withName("drmFormatModifier"),
        vulkan_h.C_INT.withName("drmFormatModifierPlaneCount"),
        MemoryLayout.paddingLayout(4),
        vulkan_h.C_POINTER.withName("pPlaneLayouts")
    ).withName("VkImageDrmFormatModifierExplicitCreateInfoEXT");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt sType$LAYOUT = (OfInt)$LAYOUT.select(groupElement("sType"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final OfInt sType$layout() {
        return sType$LAYOUT;
    }

    private static final long sType$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final long sType$offset() {
        return sType$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static int sType(MemorySegment struct) {
        return struct.get(sType$LAYOUT, sType$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static void sType(MemorySegment struct, int fieldValue) {
        struct.set(sType$LAYOUT, sType$OFFSET, fieldValue);
    }

    private static final AddressLayout pNext$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pNext"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static final AddressLayout pNext$layout() {
        return pNext$LAYOUT;
    }

    private static final long pNext$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static final long pNext$offset() {
        return pNext$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static MemorySegment pNext(MemorySegment struct) {
        return struct.get(pNext$LAYOUT, pNext$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static void pNext(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pNext$LAYOUT, pNext$OFFSET, fieldValue);
    }

    private static final OfLong drmFormatModifier$LAYOUT = (OfLong)$LAYOUT.select(groupElement("drmFormatModifier"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint64_t drmFormatModifier
     * }
     */
    public static final OfLong drmFormatModifier$layout() {
        return drmFormatModifier$LAYOUT;
    }

    private static final long drmFormatModifier$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint64_t drmFormatModifier
     * }
     */
    public static final long drmFormatModifier$offset() {
        return drmFormatModifier$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint64_t drmFormatModifier
     * }
     */
    public static long drmFormatModifier(MemorySegment struct) {
        return struct.get(drmFormatModifier$LAYOUT, drmFormatModifier$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint64_t drmFormatModifier
     * }
     */
    public static void drmFormatModifier(MemorySegment struct, long fieldValue) {
        struct.set(drmFormatModifier$LAYOUT, drmFormatModifier$OFFSET, fieldValue);
    }

    private static final OfInt drmFormatModifierPlaneCount$LAYOUT = (OfInt)$LAYOUT.select(groupElement("drmFormatModifierPlaneCount"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t drmFormatModifierPlaneCount
     * }
     */
    public static final OfInt drmFormatModifierPlaneCount$layout() {
        return drmFormatModifierPlaneCount$LAYOUT;
    }

    private static final long drmFormatModifierPlaneCount$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t drmFormatModifierPlaneCount
     * }
     */
    public static final long drmFormatModifierPlaneCount$offset() {
        return drmFormatModifierPlaneCount$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t drmFormatModifierPlaneCount
     * }
     */
    public static int drmFormatModifierPlaneCount(MemorySegment struct) {
        return struct.get(drmFormatModifierPlaneCount$LAYOUT, drmFormatModifierPlaneCount$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t drmFormatModifierPlaneCount
     * }
     */
    public static void drmFormatModifierPlaneCount(MemorySegment struct, int fieldValue) {
        struct.set(drmFormatModifierPlaneCount$LAYOUT, drmFormatModifierPlaneCount$OFFSET, fieldValue);
    }

    private static final AddressLayout pPlaneLayouts$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pPlaneLayouts"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const VkSubresourceLayout *pPlaneLayouts
     * }
     */
    public static final AddressLayout pPlaneLayouts$layout() {
        return pPlaneLayouts$LAYOUT;
    }

    private static final long pPlaneLayouts$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const VkSubresourceLayout *pPlaneLayouts
     * }
     */
    public static final long pPlaneLayouts$offset() {
        return pPlaneLayouts$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const VkSubresourceLayout *pPlaneLayouts
     * }
     */
    public static MemorySegment pPlaneLayouts(MemorySegment struct) {
        return struct.get(pPlaneLayouts$LAYOUT, pPlaneLayouts$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const VkSubresourceLayout *pPlaneLayouts
     * }
     */
    public static void pPlaneLayouts(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pPlaneLayouts$LAYOUT, pPlaneLayouts$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

