// Generated by jextract

package org.vulkan;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct VkLatencySleepModeInfoNV {
 *     VkStructureType sType;
 *     const void *pNext;
 *     VkBool32 lowLatencyMode;
 *     VkBool32 lowLatencyBoost;
 *     uint32_t minimumIntervalUs;
 * }
 * }
 */
public class VkLatencySleepModeInfoNV {

    VkLatencySleepModeInfoNV() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        vulkan_h.C_INT.withName("sType"),
        MemoryLayout.paddingLayout(4),
        vulkan_h.C_POINTER.withName("pNext"),
        vulkan_h.C_INT.withName("lowLatencyMode"),
        vulkan_h.C_INT.withName("lowLatencyBoost"),
        vulkan_h.C_INT.withName("minimumIntervalUs"),
        MemoryLayout.paddingLayout(4)
    ).withName("VkLatencySleepModeInfoNV");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt sType$LAYOUT = (OfInt)$LAYOUT.select(groupElement("sType"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final OfInt sType$layout() {
        return sType$LAYOUT;
    }

    private static final long sType$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final long sType$offset() {
        return sType$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static int sType(MemorySegment struct) {
        return struct.get(sType$LAYOUT, sType$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static void sType(MemorySegment struct, int fieldValue) {
        struct.set(sType$LAYOUT, sType$OFFSET, fieldValue);
    }

    private static final AddressLayout pNext$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pNext"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static final AddressLayout pNext$layout() {
        return pNext$LAYOUT;
    }

    private static final long pNext$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static final long pNext$offset() {
        return pNext$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static MemorySegment pNext(MemorySegment struct) {
        return struct.get(pNext$LAYOUT, pNext$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static void pNext(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pNext$LAYOUT, pNext$OFFSET, fieldValue);
    }

    private static final OfInt lowLatencyMode$LAYOUT = (OfInt)$LAYOUT.select(groupElement("lowLatencyMode"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkBool32 lowLatencyMode
     * }
     */
    public static final OfInt lowLatencyMode$layout() {
        return lowLatencyMode$LAYOUT;
    }

    private static final long lowLatencyMode$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkBool32 lowLatencyMode
     * }
     */
    public static final long lowLatencyMode$offset() {
        return lowLatencyMode$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkBool32 lowLatencyMode
     * }
     */
    public static int lowLatencyMode(MemorySegment struct) {
        return struct.get(lowLatencyMode$LAYOUT, lowLatencyMode$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkBool32 lowLatencyMode
     * }
     */
    public static void lowLatencyMode(MemorySegment struct, int fieldValue) {
        struct.set(lowLatencyMode$LAYOUT, lowLatencyMode$OFFSET, fieldValue);
    }

    private static final OfInt lowLatencyBoost$LAYOUT = (OfInt)$LAYOUT.select(groupElement("lowLatencyBoost"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkBool32 lowLatencyBoost
     * }
     */
    public static final OfInt lowLatencyBoost$layout() {
        return lowLatencyBoost$LAYOUT;
    }

    private static final long lowLatencyBoost$OFFSET = 20;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkBool32 lowLatencyBoost
     * }
     */
    public static final long lowLatencyBoost$offset() {
        return lowLatencyBoost$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkBool32 lowLatencyBoost
     * }
     */
    public static int lowLatencyBoost(MemorySegment struct) {
        return struct.get(lowLatencyBoost$LAYOUT, lowLatencyBoost$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkBool32 lowLatencyBoost
     * }
     */
    public static void lowLatencyBoost(MemorySegment struct, int fieldValue) {
        struct.set(lowLatencyBoost$LAYOUT, lowLatencyBoost$OFFSET, fieldValue);
    }

    private static final OfInt minimumIntervalUs$LAYOUT = (OfInt)$LAYOUT.select(groupElement("minimumIntervalUs"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t minimumIntervalUs
     * }
     */
    public static final OfInt minimumIntervalUs$layout() {
        return minimumIntervalUs$LAYOUT;
    }

    private static final long minimumIntervalUs$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t minimumIntervalUs
     * }
     */
    public static final long minimumIntervalUs$offset() {
        return minimumIntervalUs$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t minimumIntervalUs
     * }
     */
    public static int minimumIntervalUs(MemorySegment struct) {
        return struct.get(minimumIntervalUs$LAYOUT, minimumIntervalUs$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t minimumIntervalUs
     * }
     */
    public static void minimumIntervalUs(MemorySegment struct, int fieldValue) {
        struct.set(minimumIntervalUs$LAYOUT, minimumIntervalUs$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

