// Generated by jextract

package org.vulkan;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct VkMicromapBuildSizesInfoEXT {
 *     VkStructureType sType;
 *     const void *pNext;
 *     VkDeviceSize micromapSize;
 *     VkDeviceSize buildScratchSize;
 *     VkBool32 discardable;
 * }
 * }
 */
public class VkMicromapBuildSizesInfoEXT {

    VkMicromapBuildSizesInfoEXT() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        vulkan_h.C_INT.withName("sType"),
        MemoryLayout.paddingLayout(4),
        vulkan_h.C_POINTER.withName("pNext"),
        vulkan_h.C_LONG_LONG.withName("micromapSize"),
        vulkan_h.C_LONG_LONG.withName("buildScratchSize"),
        vulkan_h.C_INT.withName("discardable"),
        MemoryLayout.paddingLayout(4)
    ).withName("VkMicromapBuildSizesInfoEXT");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt sType$LAYOUT = (OfInt)$LAYOUT.select(groupElement("sType"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final OfInt sType$layout() {
        return sType$LAYOUT;
    }

    private static final long sType$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final long sType$offset() {
        return sType$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static int sType(MemorySegment struct) {
        return struct.get(sType$LAYOUT, sType$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static void sType(MemorySegment struct, int fieldValue) {
        struct.set(sType$LAYOUT, sType$OFFSET, fieldValue);
    }

    private static final AddressLayout pNext$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pNext"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static final AddressLayout pNext$layout() {
        return pNext$LAYOUT;
    }

    private static final long pNext$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static final long pNext$offset() {
        return pNext$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static MemorySegment pNext(MemorySegment struct) {
        return struct.get(pNext$LAYOUT, pNext$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static void pNext(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pNext$LAYOUT, pNext$OFFSET, fieldValue);
    }

    private static final OfLong micromapSize$LAYOUT = (OfLong)$LAYOUT.select(groupElement("micromapSize"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkDeviceSize micromapSize
     * }
     */
    public static final OfLong micromapSize$layout() {
        return micromapSize$LAYOUT;
    }

    private static final long micromapSize$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkDeviceSize micromapSize
     * }
     */
    public static final long micromapSize$offset() {
        return micromapSize$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkDeviceSize micromapSize
     * }
     */
    public static long micromapSize(MemorySegment struct) {
        return struct.get(micromapSize$LAYOUT, micromapSize$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkDeviceSize micromapSize
     * }
     */
    public static void micromapSize(MemorySegment struct, long fieldValue) {
        struct.set(micromapSize$LAYOUT, micromapSize$OFFSET, fieldValue);
    }

    private static final OfLong buildScratchSize$LAYOUT = (OfLong)$LAYOUT.select(groupElement("buildScratchSize"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkDeviceSize buildScratchSize
     * }
     */
    public static final OfLong buildScratchSize$layout() {
        return buildScratchSize$LAYOUT;
    }

    private static final long buildScratchSize$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkDeviceSize buildScratchSize
     * }
     */
    public static final long buildScratchSize$offset() {
        return buildScratchSize$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkDeviceSize buildScratchSize
     * }
     */
    public static long buildScratchSize(MemorySegment struct) {
        return struct.get(buildScratchSize$LAYOUT, buildScratchSize$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkDeviceSize buildScratchSize
     * }
     */
    public static void buildScratchSize(MemorySegment struct, long fieldValue) {
        struct.set(buildScratchSize$LAYOUT, buildScratchSize$OFFSET, fieldValue);
    }

    private static final OfInt discardable$LAYOUT = (OfInt)$LAYOUT.select(groupElement("discardable"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkBool32 discardable
     * }
     */
    public static final OfInt discardable$layout() {
        return discardable$LAYOUT;
    }

    private static final long discardable$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkBool32 discardable
     * }
     */
    public static final long discardable$offset() {
        return discardable$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkBool32 discardable
     * }
     */
    public static int discardable(MemorySegment struct) {
        return struct.get(discardable$LAYOUT, discardable$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkBool32 discardable
     * }
     */
    public static void discardable(MemorySegment struct, int fieldValue) {
        struct.set(discardable$LAYOUT, discardable$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

