// Generated by jextract

package org.vulkan;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct VkMutableDescriptorTypeCreateInfoEXT {
 *     VkStructureType sType;
 *     const void *pNext;
 *     uint32_t mutableDescriptorTypeListCount;
 *     const VkMutableDescriptorTypeListEXT *pMutableDescriptorTypeLists;
 * }
 * }
 */
public class VkMutableDescriptorTypeCreateInfoEXT {

    VkMutableDescriptorTypeCreateInfoEXT() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        vulkan_h.C_INT.withName("sType"),
        MemoryLayout.paddingLayout(4),
        vulkan_h.C_POINTER.withName("pNext"),
        vulkan_h.C_INT.withName("mutableDescriptorTypeListCount"),
        MemoryLayout.paddingLayout(4),
        vulkan_h.C_POINTER.withName("pMutableDescriptorTypeLists")
    ).withName("VkMutableDescriptorTypeCreateInfoEXT");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt sType$LAYOUT = (OfInt)$LAYOUT.select(groupElement("sType"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final OfInt sType$layout() {
        return sType$LAYOUT;
    }

    private static final long sType$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final long sType$offset() {
        return sType$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static int sType(MemorySegment struct) {
        return struct.get(sType$LAYOUT, sType$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static void sType(MemorySegment struct, int fieldValue) {
        struct.set(sType$LAYOUT, sType$OFFSET, fieldValue);
    }

    private static final AddressLayout pNext$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pNext"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static final AddressLayout pNext$layout() {
        return pNext$LAYOUT;
    }

    private static final long pNext$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static final long pNext$offset() {
        return pNext$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static MemorySegment pNext(MemorySegment struct) {
        return struct.get(pNext$LAYOUT, pNext$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static void pNext(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pNext$LAYOUT, pNext$OFFSET, fieldValue);
    }

    private static final OfInt mutableDescriptorTypeListCount$LAYOUT = (OfInt)$LAYOUT.select(groupElement("mutableDescriptorTypeListCount"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t mutableDescriptorTypeListCount
     * }
     */
    public static final OfInt mutableDescriptorTypeListCount$layout() {
        return mutableDescriptorTypeListCount$LAYOUT;
    }

    private static final long mutableDescriptorTypeListCount$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t mutableDescriptorTypeListCount
     * }
     */
    public static final long mutableDescriptorTypeListCount$offset() {
        return mutableDescriptorTypeListCount$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t mutableDescriptorTypeListCount
     * }
     */
    public static int mutableDescriptorTypeListCount(MemorySegment struct) {
        return struct.get(mutableDescriptorTypeListCount$LAYOUT, mutableDescriptorTypeListCount$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t mutableDescriptorTypeListCount
     * }
     */
    public static void mutableDescriptorTypeListCount(MemorySegment struct, int fieldValue) {
        struct.set(mutableDescriptorTypeListCount$LAYOUT, mutableDescriptorTypeListCount$OFFSET, fieldValue);
    }

    private static final AddressLayout pMutableDescriptorTypeLists$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pMutableDescriptorTypeLists"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const VkMutableDescriptorTypeListEXT *pMutableDescriptorTypeLists
     * }
     */
    public static final AddressLayout pMutableDescriptorTypeLists$layout() {
        return pMutableDescriptorTypeLists$LAYOUT;
    }

    private static final long pMutableDescriptorTypeLists$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const VkMutableDescriptorTypeListEXT *pMutableDescriptorTypeLists
     * }
     */
    public static final long pMutableDescriptorTypeLists$offset() {
        return pMutableDescriptorTypeLists$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const VkMutableDescriptorTypeListEXT *pMutableDescriptorTypeLists
     * }
     */
    public static MemorySegment pMutableDescriptorTypeLists(MemorySegment struct) {
        return struct.get(pMutableDescriptorTypeLists$LAYOUT, pMutableDescriptorTypeLists$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const VkMutableDescriptorTypeListEXT *pMutableDescriptorTypeLists
     * }
     */
    public static void pMutableDescriptorTypeLists(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pMutableDescriptorTypeLists$LAYOUT, pMutableDescriptorTypeLists$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

