// Generated by jextract

package org.vulkan;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct VkPastPresentationTimingGOOGLE {
 *     uint32_t presentID;
 *     uint64_t desiredPresentTime;
 *     uint64_t actualPresentTime;
 *     uint64_t earliestPresentTime;
 *     uint64_t presentMargin;
 * }
 * }
 */
public class VkPastPresentationTimingGOOGLE {

    VkPastPresentationTimingGOOGLE() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        vulkan_h.C_INT.withName("presentID"),
        MemoryLayout.paddingLayout(4),
        vulkan_h.C_LONG_LONG.withName("desiredPresentTime"),
        vulkan_h.C_LONG_LONG.withName("actualPresentTime"),
        vulkan_h.C_LONG_LONG.withName("earliestPresentTime"),
        vulkan_h.C_LONG_LONG.withName("presentMargin")
    ).withName("VkPastPresentationTimingGOOGLE");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt presentID$LAYOUT = (OfInt)$LAYOUT.select(groupElement("presentID"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t presentID
     * }
     */
    public static final OfInt presentID$layout() {
        return presentID$LAYOUT;
    }

    private static final long presentID$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t presentID
     * }
     */
    public static final long presentID$offset() {
        return presentID$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t presentID
     * }
     */
    public static int presentID(MemorySegment struct) {
        return struct.get(presentID$LAYOUT, presentID$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t presentID
     * }
     */
    public static void presentID(MemorySegment struct, int fieldValue) {
        struct.set(presentID$LAYOUT, presentID$OFFSET, fieldValue);
    }

    private static final OfLong desiredPresentTime$LAYOUT = (OfLong)$LAYOUT.select(groupElement("desiredPresentTime"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint64_t desiredPresentTime
     * }
     */
    public static final OfLong desiredPresentTime$layout() {
        return desiredPresentTime$LAYOUT;
    }

    private static final long desiredPresentTime$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint64_t desiredPresentTime
     * }
     */
    public static final long desiredPresentTime$offset() {
        return desiredPresentTime$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint64_t desiredPresentTime
     * }
     */
    public static long desiredPresentTime(MemorySegment struct) {
        return struct.get(desiredPresentTime$LAYOUT, desiredPresentTime$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint64_t desiredPresentTime
     * }
     */
    public static void desiredPresentTime(MemorySegment struct, long fieldValue) {
        struct.set(desiredPresentTime$LAYOUT, desiredPresentTime$OFFSET, fieldValue);
    }

    private static final OfLong actualPresentTime$LAYOUT = (OfLong)$LAYOUT.select(groupElement("actualPresentTime"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint64_t actualPresentTime
     * }
     */
    public static final OfLong actualPresentTime$layout() {
        return actualPresentTime$LAYOUT;
    }

    private static final long actualPresentTime$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint64_t actualPresentTime
     * }
     */
    public static final long actualPresentTime$offset() {
        return actualPresentTime$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint64_t actualPresentTime
     * }
     */
    public static long actualPresentTime(MemorySegment struct) {
        return struct.get(actualPresentTime$LAYOUT, actualPresentTime$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint64_t actualPresentTime
     * }
     */
    public static void actualPresentTime(MemorySegment struct, long fieldValue) {
        struct.set(actualPresentTime$LAYOUT, actualPresentTime$OFFSET, fieldValue);
    }

    private static final OfLong earliestPresentTime$LAYOUT = (OfLong)$LAYOUT.select(groupElement("earliestPresentTime"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint64_t earliestPresentTime
     * }
     */
    public static final OfLong earliestPresentTime$layout() {
        return earliestPresentTime$LAYOUT;
    }

    private static final long earliestPresentTime$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint64_t earliestPresentTime
     * }
     */
    public static final long earliestPresentTime$offset() {
        return earliestPresentTime$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint64_t earliestPresentTime
     * }
     */
    public static long earliestPresentTime(MemorySegment struct) {
        return struct.get(earliestPresentTime$LAYOUT, earliestPresentTime$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint64_t earliestPresentTime
     * }
     */
    public static void earliestPresentTime(MemorySegment struct, long fieldValue) {
        struct.set(earliestPresentTime$LAYOUT, earliestPresentTime$OFFSET, fieldValue);
    }

    private static final OfLong presentMargin$LAYOUT = (OfLong)$LAYOUT.select(groupElement("presentMargin"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint64_t presentMargin
     * }
     */
    public static final OfLong presentMargin$layout() {
        return presentMargin$LAYOUT;
    }

    private static final long presentMargin$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint64_t presentMargin
     * }
     */
    public static final long presentMargin$offset() {
        return presentMargin$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint64_t presentMargin
     * }
     */
    public static long presentMargin(MemorySegment struct) {
        return struct.get(presentMargin$LAYOUT, presentMargin$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint64_t presentMargin
     * }
     */
    public static void presentMargin(MemorySegment struct, long fieldValue) {
        struct.set(presentMargin$LAYOUT, presentMargin$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

