// Generated by jextract

package org.vulkan;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct VkPhysicalDeviceDescriptorBufferFeaturesEXT {
 *     VkStructureType sType;
 *     void *pNext;
 *     VkBool32 descriptorBuffer;
 *     VkBool32 descriptorBufferCaptureReplay;
 *     VkBool32 descriptorBufferImageLayoutIgnored;
 *     VkBool32 descriptorBufferPushDescriptors;
 * }
 * }
 */
public class VkPhysicalDeviceDescriptorBufferFeaturesEXT {

    VkPhysicalDeviceDescriptorBufferFeaturesEXT() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        vulkan_h.C_INT.withName("sType"),
        MemoryLayout.paddingLayout(4),
        vulkan_h.C_POINTER.withName("pNext"),
        vulkan_h.C_INT.withName("descriptorBuffer"),
        vulkan_h.C_INT.withName("descriptorBufferCaptureReplay"),
        vulkan_h.C_INT.withName("descriptorBufferImageLayoutIgnored"),
        vulkan_h.C_INT.withName("descriptorBufferPushDescriptors")
    ).withName("VkPhysicalDeviceDescriptorBufferFeaturesEXT");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt sType$LAYOUT = (OfInt)$LAYOUT.select(groupElement("sType"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final OfInt sType$layout() {
        return sType$LAYOUT;
    }

    private static final long sType$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final long sType$offset() {
        return sType$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static int sType(MemorySegment struct) {
        return struct.get(sType$LAYOUT, sType$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static void sType(MemorySegment struct, int fieldValue) {
        struct.set(sType$LAYOUT, sType$OFFSET, fieldValue);
    }

    private static final AddressLayout pNext$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pNext"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * void *pNext
     * }
     */
    public static final AddressLayout pNext$layout() {
        return pNext$LAYOUT;
    }

    private static final long pNext$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * void *pNext
     * }
     */
    public static final long pNext$offset() {
        return pNext$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * void *pNext
     * }
     */
    public static MemorySegment pNext(MemorySegment struct) {
        return struct.get(pNext$LAYOUT, pNext$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * void *pNext
     * }
     */
    public static void pNext(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pNext$LAYOUT, pNext$OFFSET, fieldValue);
    }

    private static final OfInt descriptorBuffer$LAYOUT = (OfInt)$LAYOUT.select(groupElement("descriptorBuffer"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkBool32 descriptorBuffer
     * }
     */
    public static final OfInt descriptorBuffer$layout() {
        return descriptorBuffer$LAYOUT;
    }

    private static final long descriptorBuffer$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkBool32 descriptorBuffer
     * }
     */
    public static final long descriptorBuffer$offset() {
        return descriptorBuffer$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkBool32 descriptorBuffer
     * }
     */
    public static int descriptorBuffer(MemorySegment struct) {
        return struct.get(descriptorBuffer$LAYOUT, descriptorBuffer$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkBool32 descriptorBuffer
     * }
     */
    public static void descriptorBuffer(MemorySegment struct, int fieldValue) {
        struct.set(descriptorBuffer$LAYOUT, descriptorBuffer$OFFSET, fieldValue);
    }

    private static final OfInt descriptorBufferCaptureReplay$LAYOUT = (OfInt)$LAYOUT.select(groupElement("descriptorBufferCaptureReplay"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkBool32 descriptorBufferCaptureReplay
     * }
     */
    public static final OfInt descriptorBufferCaptureReplay$layout() {
        return descriptorBufferCaptureReplay$LAYOUT;
    }

    private static final long descriptorBufferCaptureReplay$OFFSET = 20;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkBool32 descriptorBufferCaptureReplay
     * }
     */
    public static final long descriptorBufferCaptureReplay$offset() {
        return descriptorBufferCaptureReplay$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkBool32 descriptorBufferCaptureReplay
     * }
     */
    public static int descriptorBufferCaptureReplay(MemorySegment struct) {
        return struct.get(descriptorBufferCaptureReplay$LAYOUT, descriptorBufferCaptureReplay$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkBool32 descriptorBufferCaptureReplay
     * }
     */
    public static void descriptorBufferCaptureReplay(MemorySegment struct, int fieldValue) {
        struct.set(descriptorBufferCaptureReplay$LAYOUT, descriptorBufferCaptureReplay$OFFSET, fieldValue);
    }

    private static final OfInt descriptorBufferImageLayoutIgnored$LAYOUT = (OfInt)$LAYOUT.select(groupElement("descriptorBufferImageLayoutIgnored"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkBool32 descriptorBufferImageLayoutIgnored
     * }
     */
    public static final OfInt descriptorBufferImageLayoutIgnored$layout() {
        return descriptorBufferImageLayoutIgnored$LAYOUT;
    }

    private static final long descriptorBufferImageLayoutIgnored$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkBool32 descriptorBufferImageLayoutIgnored
     * }
     */
    public static final long descriptorBufferImageLayoutIgnored$offset() {
        return descriptorBufferImageLayoutIgnored$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkBool32 descriptorBufferImageLayoutIgnored
     * }
     */
    public static int descriptorBufferImageLayoutIgnored(MemorySegment struct) {
        return struct.get(descriptorBufferImageLayoutIgnored$LAYOUT, descriptorBufferImageLayoutIgnored$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkBool32 descriptorBufferImageLayoutIgnored
     * }
     */
    public static void descriptorBufferImageLayoutIgnored(MemorySegment struct, int fieldValue) {
        struct.set(descriptorBufferImageLayoutIgnored$LAYOUT, descriptorBufferImageLayoutIgnored$OFFSET, fieldValue);
    }

    private static final OfInt descriptorBufferPushDescriptors$LAYOUT = (OfInt)$LAYOUT.select(groupElement("descriptorBufferPushDescriptors"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkBool32 descriptorBufferPushDescriptors
     * }
     */
    public static final OfInt descriptorBufferPushDescriptors$layout() {
        return descriptorBufferPushDescriptors$LAYOUT;
    }

    private static final long descriptorBufferPushDescriptors$OFFSET = 28;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkBool32 descriptorBufferPushDescriptors
     * }
     */
    public static final long descriptorBufferPushDescriptors$offset() {
        return descriptorBufferPushDescriptors$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkBool32 descriptorBufferPushDescriptors
     * }
     */
    public static int descriptorBufferPushDescriptors(MemorySegment struct) {
        return struct.get(descriptorBufferPushDescriptors$LAYOUT, descriptorBufferPushDescriptors$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkBool32 descriptorBufferPushDescriptors
     * }
     */
    public static void descriptorBufferPushDescriptors(MemorySegment struct, int fieldValue) {
        struct.set(descriptorBufferPushDescriptors$LAYOUT, descriptorBufferPushDescriptors$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

