// Generated by jextract

package org.vulkan;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct VkPhysicalDeviceFragmentShadingRateEnumsFeaturesNV {
 *     VkStructureType sType;
 *     void *pNext;
 *     VkBool32 fragmentShadingRateEnums;
 *     VkBool32 supersampleFragmentShadingRates;
 *     VkBool32 noInvocationFragmentShadingRates;
 * }
 * }
 */
public class VkPhysicalDeviceFragmentShadingRateEnumsFeaturesNV {

    VkPhysicalDeviceFragmentShadingRateEnumsFeaturesNV() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        vulkan_h.C_INT.withName("sType"),
        MemoryLayout.paddingLayout(4),
        vulkan_h.C_POINTER.withName("pNext"),
        vulkan_h.C_INT.withName("fragmentShadingRateEnums"),
        vulkan_h.C_INT.withName("supersampleFragmentShadingRates"),
        vulkan_h.C_INT.withName("noInvocationFragmentShadingRates"),
        MemoryLayout.paddingLayout(4)
    ).withName("VkPhysicalDeviceFragmentShadingRateEnumsFeaturesNV");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt sType$LAYOUT = (OfInt)$LAYOUT.select(groupElement("sType"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final OfInt sType$layout() {
        return sType$LAYOUT;
    }

    private static final long sType$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final long sType$offset() {
        return sType$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static int sType(MemorySegment struct) {
        return struct.get(sType$LAYOUT, sType$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static void sType(MemorySegment struct, int fieldValue) {
        struct.set(sType$LAYOUT, sType$OFFSET, fieldValue);
    }

    private static final AddressLayout pNext$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pNext"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * void *pNext
     * }
     */
    public static final AddressLayout pNext$layout() {
        return pNext$LAYOUT;
    }

    private static final long pNext$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * void *pNext
     * }
     */
    public static final long pNext$offset() {
        return pNext$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * void *pNext
     * }
     */
    public static MemorySegment pNext(MemorySegment struct) {
        return struct.get(pNext$LAYOUT, pNext$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * void *pNext
     * }
     */
    public static void pNext(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pNext$LAYOUT, pNext$OFFSET, fieldValue);
    }

    private static final OfInt fragmentShadingRateEnums$LAYOUT = (OfInt)$LAYOUT.select(groupElement("fragmentShadingRateEnums"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkBool32 fragmentShadingRateEnums
     * }
     */
    public static final OfInt fragmentShadingRateEnums$layout() {
        return fragmentShadingRateEnums$LAYOUT;
    }

    private static final long fragmentShadingRateEnums$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkBool32 fragmentShadingRateEnums
     * }
     */
    public static final long fragmentShadingRateEnums$offset() {
        return fragmentShadingRateEnums$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkBool32 fragmentShadingRateEnums
     * }
     */
    public static int fragmentShadingRateEnums(MemorySegment struct) {
        return struct.get(fragmentShadingRateEnums$LAYOUT, fragmentShadingRateEnums$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkBool32 fragmentShadingRateEnums
     * }
     */
    public static void fragmentShadingRateEnums(MemorySegment struct, int fieldValue) {
        struct.set(fragmentShadingRateEnums$LAYOUT, fragmentShadingRateEnums$OFFSET, fieldValue);
    }

    private static final OfInt supersampleFragmentShadingRates$LAYOUT = (OfInt)$LAYOUT.select(groupElement("supersampleFragmentShadingRates"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkBool32 supersampleFragmentShadingRates
     * }
     */
    public static final OfInt supersampleFragmentShadingRates$layout() {
        return supersampleFragmentShadingRates$LAYOUT;
    }

    private static final long supersampleFragmentShadingRates$OFFSET = 20;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkBool32 supersampleFragmentShadingRates
     * }
     */
    public static final long supersampleFragmentShadingRates$offset() {
        return supersampleFragmentShadingRates$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkBool32 supersampleFragmentShadingRates
     * }
     */
    public static int supersampleFragmentShadingRates(MemorySegment struct) {
        return struct.get(supersampleFragmentShadingRates$LAYOUT, supersampleFragmentShadingRates$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkBool32 supersampleFragmentShadingRates
     * }
     */
    public static void supersampleFragmentShadingRates(MemorySegment struct, int fieldValue) {
        struct.set(supersampleFragmentShadingRates$LAYOUT, supersampleFragmentShadingRates$OFFSET, fieldValue);
    }

    private static final OfInt noInvocationFragmentShadingRates$LAYOUT = (OfInt)$LAYOUT.select(groupElement("noInvocationFragmentShadingRates"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkBool32 noInvocationFragmentShadingRates
     * }
     */
    public static final OfInt noInvocationFragmentShadingRates$layout() {
        return noInvocationFragmentShadingRates$LAYOUT;
    }

    private static final long noInvocationFragmentShadingRates$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkBool32 noInvocationFragmentShadingRates
     * }
     */
    public static final long noInvocationFragmentShadingRates$offset() {
        return noInvocationFragmentShadingRates$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkBool32 noInvocationFragmentShadingRates
     * }
     */
    public static int noInvocationFragmentShadingRates(MemorySegment struct) {
        return struct.get(noInvocationFragmentShadingRates$LAYOUT, noInvocationFragmentShadingRates$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkBool32 noInvocationFragmentShadingRates
     * }
     */
    public static void noInvocationFragmentShadingRates(MemorySegment struct, int fieldValue) {
        struct.set(noInvocationFragmentShadingRates$LAYOUT, noInvocationFragmentShadingRates$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

