// Generated by jextract

package org.vulkan;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct VkPhysicalDeviceExtendedSparseAddressSpacePropertiesNV {
 *     VkStructureType sType;
 *     void *pNext;
 *     VkDeviceSize extendedSparseAddressSpaceSize;
 *     VkImageUsageFlags extendedSparseImageUsageFlags;
 *     VkBufferUsageFlags extendedSparseBufferUsageFlags;
 * }
 * }
 */
public class VkPhysicalDeviceExtendedSparseAddressSpacePropertiesNV {

    VkPhysicalDeviceExtendedSparseAddressSpacePropertiesNV() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        vulkan_h.C_INT.withName("sType"),
        MemoryLayout.paddingLayout(4),
        vulkan_h.C_POINTER.withName("pNext"),
        vulkan_h.C_LONG_LONG.withName("extendedSparseAddressSpaceSize"),
        vulkan_h.C_INT.withName("extendedSparseImageUsageFlags"),
        vulkan_h.C_INT.withName("extendedSparseBufferUsageFlags")
    ).withName("VkPhysicalDeviceExtendedSparseAddressSpacePropertiesNV");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt sType$LAYOUT = (OfInt)$LAYOUT.select(groupElement("sType"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final OfInt sType$layout() {
        return sType$LAYOUT;
    }

    private static final long sType$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final long sType$offset() {
        return sType$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static int sType(MemorySegment struct) {
        return struct.get(sType$LAYOUT, sType$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static void sType(MemorySegment struct, int fieldValue) {
        struct.set(sType$LAYOUT, sType$OFFSET, fieldValue);
    }

    private static final AddressLayout pNext$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pNext"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * void *pNext
     * }
     */
    public static final AddressLayout pNext$layout() {
        return pNext$LAYOUT;
    }

    private static final long pNext$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * void *pNext
     * }
     */
    public static final long pNext$offset() {
        return pNext$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * void *pNext
     * }
     */
    public static MemorySegment pNext(MemorySegment struct) {
        return struct.get(pNext$LAYOUT, pNext$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * void *pNext
     * }
     */
    public static void pNext(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pNext$LAYOUT, pNext$OFFSET, fieldValue);
    }

    private static final OfLong extendedSparseAddressSpaceSize$LAYOUT = (OfLong)$LAYOUT.select(groupElement("extendedSparseAddressSpaceSize"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkDeviceSize extendedSparseAddressSpaceSize
     * }
     */
    public static final OfLong extendedSparseAddressSpaceSize$layout() {
        return extendedSparseAddressSpaceSize$LAYOUT;
    }

    private static final long extendedSparseAddressSpaceSize$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkDeviceSize extendedSparseAddressSpaceSize
     * }
     */
    public static final long extendedSparseAddressSpaceSize$offset() {
        return extendedSparseAddressSpaceSize$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkDeviceSize extendedSparseAddressSpaceSize
     * }
     */
    public static long extendedSparseAddressSpaceSize(MemorySegment struct) {
        return struct.get(extendedSparseAddressSpaceSize$LAYOUT, extendedSparseAddressSpaceSize$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkDeviceSize extendedSparseAddressSpaceSize
     * }
     */
    public static void extendedSparseAddressSpaceSize(MemorySegment struct, long fieldValue) {
        struct.set(extendedSparseAddressSpaceSize$LAYOUT, extendedSparseAddressSpaceSize$OFFSET, fieldValue);
    }

    private static final OfInt extendedSparseImageUsageFlags$LAYOUT = (OfInt)$LAYOUT.select(groupElement("extendedSparseImageUsageFlags"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkImageUsageFlags extendedSparseImageUsageFlags
     * }
     */
    public static final OfInt extendedSparseImageUsageFlags$layout() {
        return extendedSparseImageUsageFlags$LAYOUT;
    }

    private static final long extendedSparseImageUsageFlags$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkImageUsageFlags extendedSparseImageUsageFlags
     * }
     */
    public static final long extendedSparseImageUsageFlags$offset() {
        return extendedSparseImageUsageFlags$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkImageUsageFlags extendedSparseImageUsageFlags
     * }
     */
    public static int extendedSparseImageUsageFlags(MemorySegment struct) {
        return struct.get(extendedSparseImageUsageFlags$LAYOUT, extendedSparseImageUsageFlags$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkImageUsageFlags extendedSparseImageUsageFlags
     * }
     */
    public static void extendedSparseImageUsageFlags(MemorySegment struct, int fieldValue) {
        struct.set(extendedSparseImageUsageFlags$LAYOUT, extendedSparseImageUsageFlags$OFFSET, fieldValue);
    }

    private static final OfInt extendedSparseBufferUsageFlags$LAYOUT = (OfInt)$LAYOUT.select(groupElement("extendedSparseBufferUsageFlags"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkBufferUsageFlags extendedSparseBufferUsageFlags
     * }
     */
    public static final OfInt extendedSparseBufferUsageFlags$layout() {
        return extendedSparseBufferUsageFlags$LAYOUT;
    }

    private static final long extendedSparseBufferUsageFlags$OFFSET = 28;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkBufferUsageFlags extendedSparseBufferUsageFlags
     * }
     */
    public static final long extendedSparseBufferUsageFlags$offset() {
        return extendedSparseBufferUsageFlags$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkBufferUsageFlags extendedSparseBufferUsageFlags
     * }
     */
    public static int extendedSparseBufferUsageFlags(MemorySegment struct) {
        return struct.get(extendedSparseBufferUsageFlags$LAYOUT, extendedSparseBufferUsageFlags$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkBufferUsageFlags extendedSparseBufferUsageFlags
     * }
     */
    public static void extendedSparseBufferUsageFlags(MemorySegment struct, int fieldValue) {
        struct.set(extendedSparseBufferUsageFlags$LAYOUT, extendedSparseBufferUsageFlags$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

