// Generated by jextract

package org.vulkan;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct VkPhysicalDeviceRayTracingPropertiesNV {
 *     VkStructureType sType;
 *     void *pNext;
 *     uint32_t shaderGroupHandleSize;
 *     uint32_t maxRecursionDepth;
 *     uint32_t maxShaderGroupStride;
 *     uint32_t shaderGroupBaseAlignment;
 *     uint64_t maxGeometryCount;
 *     uint64_t maxInstanceCount;
 *     uint64_t maxTriangleCount;
 *     uint32_t maxDescriptorSetAccelerationStructures;
 * }
 * }
 */
public class VkPhysicalDeviceRayTracingPropertiesNV {

    VkPhysicalDeviceRayTracingPropertiesNV() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        vulkan_h.C_INT.withName("sType"),
        MemoryLayout.paddingLayout(4),
        vulkan_h.C_POINTER.withName("pNext"),
        vulkan_h.C_INT.withName("shaderGroupHandleSize"),
        vulkan_h.C_INT.withName("maxRecursionDepth"),
        vulkan_h.C_INT.withName("maxShaderGroupStride"),
        vulkan_h.C_INT.withName("shaderGroupBaseAlignment"),
        vulkan_h.C_LONG_LONG.withName("maxGeometryCount"),
        vulkan_h.C_LONG_LONG.withName("maxInstanceCount"),
        vulkan_h.C_LONG_LONG.withName("maxTriangleCount"),
        vulkan_h.C_INT.withName("maxDescriptorSetAccelerationStructures"),
        MemoryLayout.paddingLayout(4)
    ).withName("VkPhysicalDeviceRayTracingPropertiesNV");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt sType$LAYOUT = (OfInt)$LAYOUT.select(groupElement("sType"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final OfInt sType$layout() {
        return sType$LAYOUT;
    }

    private static final long sType$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final long sType$offset() {
        return sType$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static int sType(MemorySegment struct) {
        return struct.get(sType$LAYOUT, sType$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static void sType(MemorySegment struct, int fieldValue) {
        struct.set(sType$LAYOUT, sType$OFFSET, fieldValue);
    }

    private static final AddressLayout pNext$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pNext"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * void *pNext
     * }
     */
    public static final AddressLayout pNext$layout() {
        return pNext$LAYOUT;
    }

    private static final long pNext$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * void *pNext
     * }
     */
    public static final long pNext$offset() {
        return pNext$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * void *pNext
     * }
     */
    public static MemorySegment pNext(MemorySegment struct) {
        return struct.get(pNext$LAYOUT, pNext$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * void *pNext
     * }
     */
    public static void pNext(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pNext$LAYOUT, pNext$OFFSET, fieldValue);
    }

    private static final OfInt shaderGroupHandleSize$LAYOUT = (OfInt)$LAYOUT.select(groupElement("shaderGroupHandleSize"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t shaderGroupHandleSize
     * }
     */
    public static final OfInt shaderGroupHandleSize$layout() {
        return shaderGroupHandleSize$LAYOUT;
    }

    private static final long shaderGroupHandleSize$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t shaderGroupHandleSize
     * }
     */
    public static final long shaderGroupHandleSize$offset() {
        return shaderGroupHandleSize$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t shaderGroupHandleSize
     * }
     */
    public static int shaderGroupHandleSize(MemorySegment struct) {
        return struct.get(shaderGroupHandleSize$LAYOUT, shaderGroupHandleSize$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t shaderGroupHandleSize
     * }
     */
    public static void shaderGroupHandleSize(MemorySegment struct, int fieldValue) {
        struct.set(shaderGroupHandleSize$LAYOUT, shaderGroupHandleSize$OFFSET, fieldValue);
    }

    private static final OfInt maxRecursionDepth$LAYOUT = (OfInt)$LAYOUT.select(groupElement("maxRecursionDepth"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t maxRecursionDepth
     * }
     */
    public static final OfInt maxRecursionDepth$layout() {
        return maxRecursionDepth$LAYOUT;
    }

    private static final long maxRecursionDepth$OFFSET = 20;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t maxRecursionDepth
     * }
     */
    public static final long maxRecursionDepth$offset() {
        return maxRecursionDepth$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t maxRecursionDepth
     * }
     */
    public static int maxRecursionDepth(MemorySegment struct) {
        return struct.get(maxRecursionDepth$LAYOUT, maxRecursionDepth$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t maxRecursionDepth
     * }
     */
    public static void maxRecursionDepth(MemorySegment struct, int fieldValue) {
        struct.set(maxRecursionDepth$LAYOUT, maxRecursionDepth$OFFSET, fieldValue);
    }

    private static final OfInt maxShaderGroupStride$LAYOUT = (OfInt)$LAYOUT.select(groupElement("maxShaderGroupStride"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t maxShaderGroupStride
     * }
     */
    public static final OfInt maxShaderGroupStride$layout() {
        return maxShaderGroupStride$LAYOUT;
    }

    private static final long maxShaderGroupStride$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t maxShaderGroupStride
     * }
     */
    public static final long maxShaderGroupStride$offset() {
        return maxShaderGroupStride$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t maxShaderGroupStride
     * }
     */
    public static int maxShaderGroupStride(MemorySegment struct) {
        return struct.get(maxShaderGroupStride$LAYOUT, maxShaderGroupStride$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t maxShaderGroupStride
     * }
     */
    public static void maxShaderGroupStride(MemorySegment struct, int fieldValue) {
        struct.set(maxShaderGroupStride$LAYOUT, maxShaderGroupStride$OFFSET, fieldValue);
    }

    private static final OfInt shaderGroupBaseAlignment$LAYOUT = (OfInt)$LAYOUT.select(groupElement("shaderGroupBaseAlignment"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t shaderGroupBaseAlignment
     * }
     */
    public static final OfInt shaderGroupBaseAlignment$layout() {
        return shaderGroupBaseAlignment$LAYOUT;
    }

    private static final long shaderGroupBaseAlignment$OFFSET = 28;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t shaderGroupBaseAlignment
     * }
     */
    public static final long shaderGroupBaseAlignment$offset() {
        return shaderGroupBaseAlignment$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t shaderGroupBaseAlignment
     * }
     */
    public static int shaderGroupBaseAlignment(MemorySegment struct) {
        return struct.get(shaderGroupBaseAlignment$LAYOUT, shaderGroupBaseAlignment$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t shaderGroupBaseAlignment
     * }
     */
    public static void shaderGroupBaseAlignment(MemorySegment struct, int fieldValue) {
        struct.set(shaderGroupBaseAlignment$LAYOUT, shaderGroupBaseAlignment$OFFSET, fieldValue);
    }

    private static final OfLong maxGeometryCount$LAYOUT = (OfLong)$LAYOUT.select(groupElement("maxGeometryCount"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint64_t maxGeometryCount
     * }
     */
    public static final OfLong maxGeometryCount$layout() {
        return maxGeometryCount$LAYOUT;
    }

    private static final long maxGeometryCount$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint64_t maxGeometryCount
     * }
     */
    public static final long maxGeometryCount$offset() {
        return maxGeometryCount$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint64_t maxGeometryCount
     * }
     */
    public static long maxGeometryCount(MemorySegment struct) {
        return struct.get(maxGeometryCount$LAYOUT, maxGeometryCount$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint64_t maxGeometryCount
     * }
     */
    public static void maxGeometryCount(MemorySegment struct, long fieldValue) {
        struct.set(maxGeometryCount$LAYOUT, maxGeometryCount$OFFSET, fieldValue);
    }

    private static final OfLong maxInstanceCount$LAYOUT = (OfLong)$LAYOUT.select(groupElement("maxInstanceCount"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint64_t maxInstanceCount
     * }
     */
    public static final OfLong maxInstanceCount$layout() {
        return maxInstanceCount$LAYOUT;
    }

    private static final long maxInstanceCount$OFFSET = 40;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint64_t maxInstanceCount
     * }
     */
    public static final long maxInstanceCount$offset() {
        return maxInstanceCount$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint64_t maxInstanceCount
     * }
     */
    public static long maxInstanceCount(MemorySegment struct) {
        return struct.get(maxInstanceCount$LAYOUT, maxInstanceCount$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint64_t maxInstanceCount
     * }
     */
    public static void maxInstanceCount(MemorySegment struct, long fieldValue) {
        struct.set(maxInstanceCount$LAYOUT, maxInstanceCount$OFFSET, fieldValue);
    }

    private static final OfLong maxTriangleCount$LAYOUT = (OfLong)$LAYOUT.select(groupElement("maxTriangleCount"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint64_t maxTriangleCount
     * }
     */
    public static final OfLong maxTriangleCount$layout() {
        return maxTriangleCount$LAYOUT;
    }

    private static final long maxTriangleCount$OFFSET = 48;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint64_t maxTriangleCount
     * }
     */
    public static final long maxTriangleCount$offset() {
        return maxTriangleCount$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint64_t maxTriangleCount
     * }
     */
    public static long maxTriangleCount(MemorySegment struct) {
        return struct.get(maxTriangleCount$LAYOUT, maxTriangleCount$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint64_t maxTriangleCount
     * }
     */
    public static void maxTriangleCount(MemorySegment struct, long fieldValue) {
        struct.set(maxTriangleCount$LAYOUT, maxTriangleCount$OFFSET, fieldValue);
    }

    private static final OfInt maxDescriptorSetAccelerationStructures$LAYOUT = (OfInt)$LAYOUT.select(groupElement("maxDescriptorSetAccelerationStructures"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t maxDescriptorSetAccelerationStructures
     * }
     */
    public static final OfInt maxDescriptorSetAccelerationStructures$layout() {
        return maxDescriptorSetAccelerationStructures$LAYOUT;
    }

    private static final long maxDescriptorSetAccelerationStructures$OFFSET = 56;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t maxDescriptorSetAccelerationStructures
     * }
     */
    public static final long maxDescriptorSetAccelerationStructures$offset() {
        return maxDescriptorSetAccelerationStructures$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t maxDescriptorSetAccelerationStructures
     * }
     */
    public static int maxDescriptorSetAccelerationStructures(MemorySegment struct) {
        return struct.get(maxDescriptorSetAccelerationStructures$LAYOUT, maxDescriptorSetAccelerationStructures$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t maxDescriptorSetAccelerationStructures
     * }
     */
    public static void maxDescriptorSetAccelerationStructures(MemorySegment struct, int fieldValue) {
        struct.set(maxDescriptorSetAccelerationStructures$LAYOUT, maxDescriptorSetAccelerationStructures$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

