// Generated by jextract

package org.vulkan;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct VkPhysicalDeviceClusterCullingShaderPropertiesHUAWEI {
 *     VkStructureType sType;
 *     void *pNext;
 *     uint32_t maxWorkGroupCount[3];
 *     uint32_t maxWorkGroupSize[3];
 *     uint32_t maxOutputClusterCount;
 *     VkDeviceSize indirectBufferOffsetAlignment;
 * }
 * }
 */
public class VkPhysicalDeviceClusterCullingShaderPropertiesHUAWEI {

    VkPhysicalDeviceClusterCullingShaderPropertiesHUAWEI() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        vulkan_h.C_INT.withName("sType"),
        MemoryLayout.paddingLayout(4),
        vulkan_h.C_POINTER.withName("pNext"),
        MemoryLayout.sequenceLayout(3, vulkan_h.C_INT).withName("maxWorkGroupCount"),
        MemoryLayout.sequenceLayout(3, vulkan_h.C_INT).withName("maxWorkGroupSize"),
        vulkan_h.C_INT.withName("maxOutputClusterCount"),
        MemoryLayout.paddingLayout(4),
        vulkan_h.C_LONG_LONG.withName("indirectBufferOffsetAlignment")
    ).withName("VkPhysicalDeviceClusterCullingShaderPropertiesHUAWEI");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt sType$LAYOUT = (OfInt)$LAYOUT.select(groupElement("sType"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final OfInt sType$layout() {
        return sType$LAYOUT;
    }

    private static final long sType$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final long sType$offset() {
        return sType$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static int sType(MemorySegment struct) {
        return struct.get(sType$LAYOUT, sType$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static void sType(MemorySegment struct, int fieldValue) {
        struct.set(sType$LAYOUT, sType$OFFSET, fieldValue);
    }

    private static final AddressLayout pNext$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pNext"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * void *pNext
     * }
     */
    public static final AddressLayout pNext$layout() {
        return pNext$LAYOUT;
    }

    private static final long pNext$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * void *pNext
     * }
     */
    public static final long pNext$offset() {
        return pNext$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * void *pNext
     * }
     */
    public static MemorySegment pNext(MemorySegment struct) {
        return struct.get(pNext$LAYOUT, pNext$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * void *pNext
     * }
     */
    public static void pNext(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pNext$LAYOUT, pNext$OFFSET, fieldValue);
    }

    private static final SequenceLayout maxWorkGroupCount$LAYOUT = (SequenceLayout)$LAYOUT.select(groupElement("maxWorkGroupCount"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t maxWorkGroupCount[3]
     * }
     */
    public static final SequenceLayout maxWorkGroupCount$layout() {
        return maxWorkGroupCount$LAYOUT;
    }

    private static final long maxWorkGroupCount$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t maxWorkGroupCount[3]
     * }
     */
    public static final long maxWorkGroupCount$offset() {
        return maxWorkGroupCount$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t maxWorkGroupCount[3]
     * }
     */
    public static MemorySegment maxWorkGroupCount(MemorySegment struct) {
        return struct.asSlice(maxWorkGroupCount$OFFSET, maxWorkGroupCount$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t maxWorkGroupCount[3]
     * }
     */
    public static void maxWorkGroupCount(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, maxWorkGroupCount$OFFSET, maxWorkGroupCount$LAYOUT.byteSize());
    }

    private static long[] maxWorkGroupCount$DIMS = { 3 };

    /**
     * Dimensions for array field:
     * {@snippet lang=c :
     * uint32_t maxWorkGroupCount[3]
     * }
     */
    public static long[] maxWorkGroupCount$dimensions() {
        return maxWorkGroupCount$DIMS;
    }
    private static final VarHandle maxWorkGroupCount$ELEM_HANDLE = maxWorkGroupCount$LAYOUT.varHandle(sequenceElement());

    /**
     * Indexed getter for field:
     * {@snippet lang=c :
     * uint32_t maxWorkGroupCount[3]
     * }
     */
    public static int maxWorkGroupCount(MemorySegment struct, long index0) {
        return (int)maxWorkGroupCount$ELEM_HANDLE.get(struct, 0L, index0);
    }

    /**
     * Indexed setter for field:
     * {@snippet lang=c :
     * uint32_t maxWorkGroupCount[3]
     * }
     */
    public static void maxWorkGroupCount(MemorySegment struct, long index0, int fieldValue) {
        maxWorkGroupCount$ELEM_HANDLE.set(struct, 0L, index0, fieldValue);
    }

    private static final SequenceLayout maxWorkGroupSize$LAYOUT = (SequenceLayout)$LAYOUT.select(groupElement("maxWorkGroupSize"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t maxWorkGroupSize[3]
     * }
     */
    public static final SequenceLayout maxWorkGroupSize$layout() {
        return maxWorkGroupSize$LAYOUT;
    }

    private static final long maxWorkGroupSize$OFFSET = 28;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t maxWorkGroupSize[3]
     * }
     */
    public static final long maxWorkGroupSize$offset() {
        return maxWorkGroupSize$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t maxWorkGroupSize[3]
     * }
     */
    public static MemorySegment maxWorkGroupSize(MemorySegment struct) {
        return struct.asSlice(maxWorkGroupSize$OFFSET, maxWorkGroupSize$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t maxWorkGroupSize[3]
     * }
     */
    public static void maxWorkGroupSize(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, maxWorkGroupSize$OFFSET, maxWorkGroupSize$LAYOUT.byteSize());
    }

    private static long[] maxWorkGroupSize$DIMS = { 3 };

    /**
     * Dimensions for array field:
     * {@snippet lang=c :
     * uint32_t maxWorkGroupSize[3]
     * }
     */
    public static long[] maxWorkGroupSize$dimensions() {
        return maxWorkGroupSize$DIMS;
    }
    private static final VarHandle maxWorkGroupSize$ELEM_HANDLE = maxWorkGroupSize$LAYOUT.varHandle(sequenceElement());

    /**
     * Indexed getter for field:
     * {@snippet lang=c :
     * uint32_t maxWorkGroupSize[3]
     * }
     */
    public static int maxWorkGroupSize(MemorySegment struct, long index0) {
        return (int)maxWorkGroupSize$ELEM_HANDLE.get(struct, 0L, index0);
    }

    /**
     * Indexed setter for field:
     * {@snippet lang=c :
     * uint32_t maxWorkGroupSize[3]
     * }
     */
    public static void maxWorkGroupSize(MemorySegment struct, long index0, int fieldValue) {
        maxWorkGroupSize$ELEM_HANDLE.set(struct, 0L, index0, fieldValue);
    }

    private static final OfInt maxOutputClusterCount$LAYOUT = (OfInt)$LAYOUT.select(groupElement("maxOutputClusterCount"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t maxOutputClusterCount
     * }
     */
    public static final OfInt maxOutputClusterCount$layout() {
        return maxOutputClusterCount$LAYOUT;
    }

    private static final long maxOutputClusterCount$OFFSET = 40;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t maxOutputClusterCount
     * }
     */
    public static final long maxOutputClusterCount$offset() {
        return maxOutputClusterCount$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t maxOutputClusterCount
     * }
     */
    public static int maxOutputClusterCount(MemorySegment struct) {
        return struct.get(maxOutputClusterCount$LAYOUT, maxOutputClusterCount$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t maxOutputClusterCount
     * }
     */
    public static void maxOutputClusterCount(MemorySegment struct, int fieldValue) {
        struct.set(maxOutputClusterCount$LAYOUT, maxOutputClusterCount$OFFSET, fieldValue);
    }

    private static final OfLong indirectBufferOffsetAlignment$LAYOUT = (OfLong)$LAYOUT.select(groupElement("indirectBufferOffsetAlignment"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkDeviceSize indirectBufferOffsetAlignment
     * }
     */
    public static final OfLong indirectBufferOffsetAlignment$layout() {
        return indirectBufferOffsetAlignment$LAYOUT;
    }

    private static final long indirectBufferOffsetAlignment$OFFSET = 48;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkDeviceSize indirectBufferOffsetAlignment
     * }
     */
    public static final long indirectBufferOffsetAlignment$offset() {
        return indirectBufferOffsetAlignment$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkDeviceSize indirectBufferOffsetAlignment
     * }
     */
    public static long indirectBufferOffsetAlignment(MemorySegment struct) {
        return struct.get(indirectBufferOffsetAlignment$LAYOUT, indirectBufferOffsetAlignment$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkDeviceSize indirectBufferOffsetAlignment
     * }
     */
    public static void indirectBufferOffsetAlignment(MemorySegment struct, long fieldValue) {
        struct.set(indirectBufferOffsetAlignment$LAYOUT, indirectBufferOffsetAlignment$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

