// Generated by jextract

package org.vulkan;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct VkPhysicalDeviceMapMemoryPlacedFeaturesEXT {
 *     VkStructureType sType;
 *     void *pNext;
 *     VkBool32 memoryMapPlaced;
 *     VkBool32 memoryMapRangePlaced;
 *     VkBool32 memoryUnmapReserve;
 * }
 * }
 */
public class VkPhysicalDeviceMapMemoryPlacedFeaturesEXT {

    VkPhysicalDeviceMapMemoryPlacedFeaturesEXT() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        vulkan_h.C_INT.withName("sType"),
        MemoryLayout.paddingLayout(4),
        vulkan_h.C_POINTER.withName("pNext"),
        vulkan_h.C_INT.withName("memoryMapPlaced"),
        vulkan_h.C_INT.withName("memoryMapRangePlaced"),
        vulkan_h.C_INT.withName("memoryUnmapReserve"),
        MemoryLayout.paddingLayout(4)
    ).withName("VkPhysicalDeviceMapMemoryPlacedFeaturesEXT");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt sType$LAYOUT = (OfInt)$LAYOUT.select(groupElement("sType"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final OfInt sType$layout() {
        return sType$LAYOUT;
    }

    private static final long sType$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final long sType$offset() {
        return sType$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static int sType(MemorySegment struct) {
        return struct.get(sType$LAYOUT, sType$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static void sType(MemorySegment struct, int fieldValue) {
        struct.set(sType$LAYOUT, sType$OFFSET, fieldValue);
    }

    private static final AddressLayout pNext$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pNext"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * void *pNext
     * }
     */
    public static final AddressLayout pNext$layout() {
        return pNext$LAYOUT;
    }

    private static final long pNext$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * void *pNext
     * }
     */
    public static final long pNext$offset() {
        return pNext$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * void *pNext
     * }
     */
    public static MemorySegment pNext(MemorySegment struct) {
        return struct.get(pNext$LAYOUT, pNext$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * void *pNext
     * }
     */
    public static void pNext(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pNext$LAYOUT, pNext$OFFSET, fieldValue);
    }

    private static final OfInt memoryMapPlaced$LAYOUT = (OfInt)$LAYOUT.select(groupElement("memoryMapPlaced"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkBool32 memoryMapPlaced
     * }
     */
    public static final OfInt memoryMapPlaced$layout() {
        return memoryMapPlaced$LAYOUT;
    }

    private static final long memoryMapPlaced$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkBool32 memoryMapPlaced
     * }
     */
    public static final long memoryMapPlaced$offset() {
        return memoryMapPlaced$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkBool32 memoryMapPlaced
     * }
     */
    public static int memoryMapPlaced(MemorySegment struct) {
        return struct.get(memoryMapPlaced$LAYOUT, memoryMapPlaced$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkBool32 memoryMapPlaced
     * }
     */
    public static void memoryMapPlaced(MemorySegment struct, int fieldValue) {
        struct.set(memoryMapPlaced$LAYOUT, memoryMapPlaced$OFFSET, fieldValue);
    }

    private static final OfInt memoryMapRangePlaced$LAYOUT = (OfInt)$LAYOUT.select(groupElement("memoryMapRangePlaced"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkBool32 memoryMapRangePlaced
     * }
     */
    public static final OfInt memoryMapRangePlaced$layout() {
        return memoryMapRangePlaced$LAYOUT;
    }

    private static final long memoryMapRangePlaced$OFFSET = 20;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkBool32 memoryMapRangePlaced
     * }
     */
    public static final long memoryMapRangePlaced$offset() {
        return memoryMapRangePlaced$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkBool32 memoryMapRangePlaced
     * }
     */
    public static int memoryMapRangePlaced(MemorySegment struct) {
        return struct.get(memoryMapRangePlaced$LAYOUT, memoryMapRangePlaced$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkBool32 memoryMapRangePlaced
     * }
     */
    public static void memoryMapRangePlaced(MemorySegment struct, int fieldValue) {
        struct.set(memoryMapRangePlaced$LAYOUT, memoryMapRangePlaced$OFFSET, fieldValue);
    }

    private static final OfInt memoryUnmapReserve$LAYOUT = (OfInt)$LAYOUT.select(groupElement("memoryUnmapReserve"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkBool32 memoryUnmapReserve
     * }
     */
    public static final OfInt memoryUnmapReserve$layout() {
        return memoryUnmapReserve$LAYOUT;
    }

    private static final long memoryUnmapReserve$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkBool32 memoryUnmapReserve
     * }
     */
    public static final long memoryUnmapReserve$offset() {
        return memoryUnmapReserve$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkBool32 memoryUnmapReserve
     * }
     */
    public static int memoryUnmapReserve(MemorySegment struct) {
        return struct.get(memoryUnmapReserve$LAYOUT, memoryUnmapReserve$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkBool32 memoryUnmapReserve
     * }
     */
    public static void memoryUnmapReserve(MemorySegment struct, int fieldValue) {
        struct.set(memoryUnmapReserve$LAYOUT, memoryUnmapReserve$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

