// Generated by jextract

package org.vulkan;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct VkPhysicalDeviceDepthBiasControlFeaturesEXT {
 *     VkStructureType sType;
 *     void *pNext;
 *     VkBool32 depthBiasControl;
 *     VkBool32 leastRepresentableValueForceUnormRepresentation;
 *     VkBool32 floatRepresentation;
 *     VkBool32 depthBiasExact;
 * }
 * }
 */
public class VkPhysicalDeviceDepthBiasControlFeaturesEXT {

    VkPhysicalDeviceDepthBiasControlFeaturesEXT() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        vulkan_h.C_INT.withName("sType"),
        MemoryLayout.paddingLayout(4),
        vulkan_h.C_POINTER.withName("pNext"),
        vulkan_h.C_INT.withName("depthBiasControl"),
        vulkan_h.C_INT.withName("leastRepresentableValueForceUnormRepresentation"),
        vulkan_h.C_INT.withName("floatRepresentation"),
        vulkan_h.C_INT.withName("depthBiasExact")
    ).withName("VkPhysicalDeviceDepthBiasControlFeaturesEXT");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt sType$LAYOUT = (OfInt)$LAYOUT.select(groupElement("sType"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final OfInt sType$layout() {
        return sType$LAYOUT;
    }

    private static final long sType$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final long sType$offset() {
        return sType$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static int sType(MemorySegment struct) {
        return struct.get(sType$LAYOUT, sType$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static void sType(MemorySegment struct, int fieldValue) {
        struct.set(sType$LAYOUT, sType$OFFSET, fieldValue);
    }

    private static final AddressLayout pNext$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pNext"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * void *pNext
     * }
     */
    public static final AddressLayout pNext$layout() {
        return pNext$LAYOUT;
    }

    private static final long pNext$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * void *pNext
     * }
     */
    public static final long pNext$offset() {
        return pNext$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * void *pNext
     * }
     */
    public static MemorySegment pNext(MemorySegment struct) {
        return struct.get(pNext$LAYOUT, pNext$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * void *pNext
     * }
     */
    public static void pNext(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pNext$LAYOUT, pNext$OFFSET, fieldValue);
    }

    private static final OfInt depthBiasControl$LAYOUT = (OfInt)$LAYOUT.select(groupElement("depthBiasControl"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkBool32 depthBiasControl
     * }
     */
    public static final OfInt depthBiasControl$layout() {
        return depthBiasControl$LAYOUT;
    }

    private static final long depthBiasControl$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkBool32 depthBiasControl
     * }
     */
    public static final long depthBiasControl$offset() {
        return depthBiasControl$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkBool32 depthBiasControl
     * }
     */
    public static int depthBiasControl(MemorySegment struct) {
        return struct.get(depthBiasControl$LAYOUT, depthBiasControl$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkBool32 depthBiasControl
     * }
     */
    public static void depthBiasControl(MemorySegment struct, int fieldValue) {
        struct.set(depthBiasControl$LAYOUT, depthBiasControl$OFFSET, fieldValue);
    }

    private static final OfInt leastRepresentableValueForceUnormRepresentation$LAYOUT = (OfInt)$LAYOUT.select(groupElement("leastRepresentableValueForceUnormRepresentation"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkBool32 leastRepresentableValueForceUnormRepresentation
     * }
     */
    public static final OfInt leastRepresentableValueForceUnormRepresentation$layout() {
        return leastRepresentableValueForceUnormRepresentation$LAYOUT;
    }

    private static final long leastRepresentableValueForceUnormRepresentation$OFFSET = 20;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkBool32 leastRepresentableValueForceUnormRepresentation
     * }
     */
    public static final long leastRepresentableValueForceUnormRepresentation$offset() {
        return leastRepresentableValueForceUnormRepresentation$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkBool32 leastRepresentableValueForceUnormRepresentation
     * }
     */
    public static int leastRepresentableValueForceUnormRepresentation(MemorySegment struct) {
        return struct.get(leastRepresentableValueForceUnormRepresentation$LAYOUT, leastRepresentableValueForceUnormRepresentation$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkBool32 leastRepresentableValueForceUnormRepresentation
     * }
     */
    public static void leastRepresentableValueForceUnormRepresentation(MemorySegment struct, int fieldValue) {
        struct.set(leastRepresentableValueForceUnormRepresentation$LAYOUT, leastRepresentableValueForceUnormRepresentation$OFFSET, fieldValue);
    }

    private static final OfInt floatRepresentation$LAYOUT = (OfInt)$LAYOUT.select(groupElement("floatRepresentation"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkBool32 floatRepresentation
     * }
     */
    public static final OfInt floatRepresentation$layout() {
        return floatRepresentation$LAYOUT;
    }

    private static final long floatRepresentation$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkBool32 floatRepresentation
     * }
     */
    public static final long floatRepresentation$offset() {
        return floatRepresentation$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkBool32 floatRepresentation
     * }
     */
    public static int floatRepresentation(MemorySegment struct) {
        return struct.get(floatRepresentation$LAYOUT, floatRepresentation$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkBool32 floatRepresentation
     * }
     */
    public static void floatRepresentation(MemorySegment struct, int fieldValue) {
        struct.set(floatRepresentation$LAYOUT, floatRepresentation$OFFSET, fieldValue);
    }

    private static final OfInt depthBiasExact$LAYOUT = (OfInt)$LAYOUT.select(groupElement("depthBiasExact"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkBool32 depthBiasExact
     * }
     */
    public static final OfInt depthBiasExact$layout() {
        return depthBiasExact$LAYOUT;
    }

    private static final long depthBiasExact$OFFSET = 28;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkBool32 depthBiasExact
     * }
     */
    public static final long depthBiasExact$offset() {
        return depthBiasExact$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkBool32 depthBiasExact
     * }
     */
    public static int depthBiasExact(MemorySegment struct) {
        return struct.get(depthBiasExact$LAYOUT, depthBiasExact$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkBool32 depthBiasExact
     * }
     */
    public static void depthBiasExact(MemorySegment struct, int fieldValue) {
        struct.set(depthBiasExact$LAYOUT, depthBiasExact$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

