// Generated by jextract

package org.vulkan;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct VkPhysicalDeviceShaderCorePropertiesARM {
 *     VkStructureType sType;
 *     void *pNext;
 *     uint32_t pixelRate;
 *     uint32_t texelRate;
 *     uint32_t fmaRate;
 * }
 * }
 */
public class VkPhysicalDeviceShaderCorePropertiesARM {

    VkPhysicalDeviceShaderCorePropertiesARM() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        vulkan_h.C_INT.withName("sType"),
        MemoryLayout.paddingLayout(4),
        vulkan_h.C_POINTER.withName("pNext"),
        vulkan_h.C_INT.withName("pixelRate"),
        vulkan_h.C_INT.withName("texelRate"),
        vulkan_h.C_INT.withName("fmaRate"),
        MemoryLayout.paddingLayout(4)
    ).withName("VkPhysicalDeviceShaderCorePropertiesARM");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt sType$LAYOUT = (OfInt)$LAYOUT.select(groupElement("sType"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final OfInt sType$layout() {
        return sType$LAYOUT;
    }

    private static final long sType$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final long sType$offset() {
        return sType$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static int sType(MemorySegment struct) {
        return struct.get(sType$LAYOUT, sType$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static void sType(MemorySegment struct, int fieldValue) {
        struct.set(sType$LAYOUT, sType$OFFSET, fieldValue);
    }

    private static final AddressLayout pNext$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pNext"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * void *pNext
     * }
     */
    public static final AddressLayout pNext$layout() {
        return pNext$LAYOUT;
    }

    private static final long pNext$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * void *pNext
     * }
     */
    public static final long pNext$offset() {
        return pNext$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * void *pNext
     * }
     */
    public static MemorySegment pNext(MemorySegment struct) {
        return struct.get(pNext$LAYOUT, pNext$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * void *pNext
     * }
     */
    public static void pNext(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pNext$LAYOUT, pNext$OFFSET, fieldValue);
    }

    private static final OfInt pixelRate$LAYOUT = (OfInt)$LAYOUT.select(groupElement("pixelRate"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t pixelRate
     * }
     */
    public static final OfInt pixelRate$layout() {
        return pixelRate$LAYOUT;
    }

    private static final long pixelRate$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t pixelRate
     * }
     */
    public static final long pixelRate$offset() {
        return pixelRate$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t pixelRate
     * }
     */
    public static int pixelRate(MemorySegment struct) {
        return struct.get(pixelRate$LAYOUT, pixelRate$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t pixelRate
     * }
     */
    public static void pixelRate(MemorySegment struct, int fieldValue) {
        struct.set(pixelRate$LAYOUT, pixelRate$OFFSET, fieldValue);
    }

    private static final OfInt texelRate$LAYOUT = (OfInt)$LAYOUT.select(groupElement("texelRate"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t texelRate
     * }
     */
    public static final OfInt texelRate$layout() {
        return texelRate$LAYOUT;
    }

    private static final long texelRate$OFFSET = 20;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t texelRate
     * }
     */
    public static final long texelRate$offset() {
        return texelRate$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t texelRate
     * }
     */
    public static int texelRate(MemorySegment struct) {
        return struct.get(texelRate$LAYOUT, texelRate$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t texelRate
     * }
     */
    public static void texelRate(MemorySegment struct, int fieldValue) {
        struct.set(texelRate$LAYOUT, texelRate$OFFSET, fieldValue);
    }

    private static final OfInt fmaRate$LAYOUT = (OfInt)$LAYOUT.select(groupElement("fmaRate"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t fmaRate
     * }
     */
    public static final OfInt fmaRate$layout() {
        return fmaRate$LAYOUT;
    }

    private static final long fmaRate$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t fmaRate
     * }
     */
    public static final long fmaRate$offset() {
        return fmaRate$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t fmaRate
     * }
     */
    public static int fmaRate(MemorySegment struct) {
        return struct.get(fmaRate$LAYOUT, fmaRate$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t fmaRate
     * }
     */
    public static void fmaRate(MemorySegment struct, int fieldValue) {
        struct.set(fmaRate$LAYOUT, fmaRate$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

