// Generated by jextract

package org.vulkan;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct VkPhysicalDevice8BitStorageFeatures {
 *     VkStructureType sType;
 *     void *pNext;
 *     VkBool32 storageBuffer8BitAccess;
 *     VkBool32 uniformAndStorageBuffer8BitAccess;
 *     VkBool32 storagePushConstant8;
 * }
 * }
 */
public class VkPhysicalDevice8BitStorageFeatures {

    VkPhysicalDevice8BitStorageFeatures() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        vulkan_h.C_INT.withName("sType"),
        MemoryLayout.paddingLayout(4),
        vulkan_h.C_POINTER.withName("pNext"),
        vulkan_h.C_INT.withName("storageBuffer8BitAccess"),
        vulkan_h.C_INT.withName("uniformAndStorageBuffer8BitAccess"),
        vulkan_h.C_INT.withName("storagePushConstant8"),
        MemoryLayout.paddingLayout(4)
    ).withName("VkPhysicalDevice8BitStorageFeatures");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt sType$LAYOUT = (OfInt)$LAYOUT.select(groupElement("sType"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final OfInt sType$layout() {
        return sType$LAYOUT;
    }

    private static final long sType$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final long sType$offset() {
        return sType$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static int sType(MemorySegment struct) {
        return struct.get(sType$LAYOUT, sType$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static void sType(MemorySegment struct, int fieldValue) {
        struct.set(sType$LAYOUT, sType$OFFSET, fieldValue);
    }

    private static final AddressLayout pNext$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pNext"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * void *pNext
     * }
     */
    public static final AddressLayout pNext$layout() {
        return pNext$LAYOUT;
    }

    private static final long pNext$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * void *pNext
     * }
     */
    public static final long pNext$offset() {
        return pNext$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * void *pNext
     * }
     */
    public static MemorySegment pNext(MemorySegment struct) {
        return struct.get(pNext$LAYOUT, pNext$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * void *pNext
     * }
     */
    public static void pNext(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pNext$LAYOUT, pNext$OFFSET, fieldValue);
    }

    private static final OfInt storageBuffer8BitAccess$LAYOUT = (OfInt)$LAYOUT.select(groupElement("storageBuffer8BitAccess"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkBool32 storageBuffer8BitAccess
     * }
     */
    public static final OfInt storageBuffer8BitAccess$layout() {
        return storageBuffer8BitAccess$LAYOUT;
    }

    private static final long storageBuffer8BitAccess$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkBool32 storageBuffer8BitAccess
     * }
     */
    public static final long storageBuffer8BitAccess$offset() {
        return storageBuffer8BitAccess$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkBool32 storageBuffer8BitAccess
     * }
     */
    public static int storageBuffer8BitAccess(MemorySegment struct) {
        return struct.get(storageBuffer8BitAccess$LAYOUT, storageBuffer8BitAccess$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkBool32 storageBuffer8BitAccess
     * }
     */
    public static void storageBuffer8BitAccess(MemorySegment struct, int fieldValue) {
        struct.set(storageBuffer8BitAccess$LAYOUT, storageBuffer8BitAccess$OFFSET, fieldValue);
    }

    private static final OfInt uniformAndStorageBuffer8BitAccess$LAYOUT = (OfInt)$LAYOUT.select(groupElement("uniformAndStorageBuffer8BitAccess"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkBool32 uniformAndStorageBuffer8BitAccess
     * }
     */
    public static final OfInt uniformAndStorageBuffer8BitAccess$layout() {
        return uniformAndStorageBuffer8BitAccess$LAYOUT;
    }

    private static final long uniformAndStorageBuffer8BitAccess$OFFSET = 20;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkBool32 uniformAndStorageBuffer8BitAccess
     * }
     */
    public static final long uniformAndStorageBuffer8BitAccess$offset() {
        return uniformAndStorageBuffer8BitAccess$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkBool32 uniformAndStorageBuffer8BitAccess
     * }
     */
    public static int uniformAndStorageBuffer8BitAccess(MemorySegment struct) {
        return struct.get(uniformAndStorageBuffer8BitAccess$LAYOUT, uniformAndStorageBuffer8BitAccess$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkBool32 uniformAndStorageBuffer8BitAccess
     * }
     */
    public static void uniformAndStorageBuffer8BitAccess(MemorySegment struct, int fieldValue) {
        struct.set(uniformAndStorageBuffer8BitAccess$LAYOUT, uniformAndStorageBuffer8BitAccess$OFFSET, fieldValue);
    }

    private static final OfInt storagePushConstant8$LAYOUT = (OfInt)$LAYOUT.select(groupElement("storagePushConstant8"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkBool32 storagePushConstant8
     * }
     */
    public static final OfInt storagePushConstant8$layout() {
        return storagePushConstant8$LAYOUT;
    }

    private static final long storagePushConstant8$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkBool32 storagePushConstant8
     * }
     */
    public static final long storagePushConstant8$offset() {
        return storagePushConstant8$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkBool32 storagePushConstant8
     * }
     */
    public static int storagePushConstant8(MemorySegment struct) {
        return struct.get(storagePushConstant8$LAYOUT, storagePushConstant8$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkBool32 storagePushConstant8
     * }
     */
    public static void storagePushConstant8(MemorySegment struct, int fieldValue) {
        struct.set(storagePushConstant8$LAYOUT, storagePushConstant8$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

