// Generated by jextract

package org.vulkan;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct VkPhysicalDeviceShaderTileImageFeaturesEXT {
 *     VkStructureType sType;
 *     void *pNext;
 *     VkBool32 shaderTileImageColorReadAccess;
 *     VkBool32 shaderTileImageDepthReadAccess;
 *     VkBool32 shaderTileImageStencilReadAccess;
 * }
 * }
 */
public class VkPhysicalDeviceShaderTileImageFeaturesEXT {

    VkPhysicalDeviceShaderTileImageFeaturesEXT() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        vulkan_h.C_INT.withName("sType"),
        MemoryLayout.paddingLayout(4),
        vulkan_h.C_POINTER.withName("pNext"),
        vulkan_h.C_INT.withName("shaderTileImageColorReadAccess"),
        vulkan_h.C_INT.withName("shaderTileImageDepthReadAccess"),
        vulkan_h.C_INT.withName("shaderTileImageStencilReadAccess"),
        MemoryLayout.paddingLayout(4)
    ).withName("VkPhysicalDeviceShaderTileImageFeaturesEXT");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt sType$LAYOUT = (OfInt)$LAYOUT.select(groupElement("sType"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final OfInt sType$layout() {
        return sType$LAYOUT;
    }

    private static final long sType$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final long sType$offset() {
        return sType$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static int sType(MemorySegment struct) {
        return struct.get(sType$LAYOUT, sType$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static void sType(MemorySegment struct, int fieldValue) {
        struct.set(sType$LAYOUT, sType$OFFSET, fieldValue);
    }

    private static final AddressLayout pNext$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pNext"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * void *pNext
     * }
     */
    public static final AddressLayout pNext$layout() {
        return pNext$LAYOUT;
    }

    private static final long pNext$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * void *pNext
     * }
     */
    public static final long pNext$offset() {
        return pNext$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * void *pNext
     * }
     */
    public static MemorySegment pNext(MemorySegment struct) {
        return struct.get(pNext$LAYOUT, pNext$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * void *pNext
     * }
     */
    public static void pNext(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pNext$LAYOUT, pNext$OFFSET, fieldValue);
    }

    private static final OfInt shaderTileImageColorReadAccess$LAYOUT = (OfInt)$LAYOUT.select(groupElement("shaderTileImageColorReadAccess"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkBool32 shaderTileImageColorReadAccess
     * }
     */
    public static final OfInt shaderTileImageColorReadAccess$layout() {
        return shaderTileImageColorReadAccess$LAYOUT;
    }

    private static final long shaderTileImageColorReadAccess$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkBool32 shaderTileImageColorReadAccess
     * }
     */
    public static final long shaderTileImageColorReadAccess$offset() {
        return shaderTileImageColorReadAccess$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkBool32 shaderTileImageColorReadAccess
     * }
     */
    public static int shaderTileImageColorReadAccess(MemorySegment struct) {
        return struct.get(shaderTileImageColorReadAccess$LAYOUT, shaderTileImageColorReadAccess$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkBool32 shaderTileImageColorReadAccess
     * }
     */
    public static void shaderTileImageColorReadAccess(MemorySegment struct, int fieldValue) {
        struct.set(shaderTileImageColorReadAccess$LAYOUT, shaderTileImageColorReadAccess$OFFSET, fieldValue);
    }

    private static final OfInt shaderTileImageDepthReadAccess$LAYOUT = (OfInt)$LAYOUT.select(groupElement("shaderTileImageDepthReadAccess"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkBool32 shaderTileImageDepthReadAccess
     * }
     */
    public static final OfInt shaderTileImageDepthReadAccess$layout() {
        return shaderTileImageDepthReadAccess$LAYOUT;
    }

    private static final long shaderTileImageDepthReadAccess$OFFSET = 20;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkBool32 shaderTileImageDepthReadAccess
     * }
     */
    public static final long shaderTileImageDepthReadAccess$offset() {
        return shaderTileImageDepthReadAccess$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkBool32 shaderTileImageDepthReadAccess
     * }
     */
    public static int shaderTileImageDepthReadAccess(MemorySegment struct) {
        return struct.get(shaderTileImageDepthReadAccess$LAYOUT, shaderTileImageDepthReadAccess$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkBool32 shaderTileImageDepthReadAccess
     * }
     */
    public static void shaderTileImageDepthReadAccess(MemorySegment struct, int fieldValue) {
        struct.set(shaderTileImageDepthReadAccess$LAYOUT, shaderTileImageDepthReadAccess$OFFSET, fieldValue);
    }

    private static final OfInt shaderTileImageStencilReadAccess$LAYOUT = (OfInt)$LAYOUT.select(groupElement("shaderTileImageStencilReadAccess"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkBool32 shaderTileImageStencilReadAccess
     * }
     */
    public static final OfInt shaderTileImageStencilReadAccess$layout() {
        return shaderTileImageStencilReadAccess$LAYOUT;
    }

    private static final long shaderTileImageStencilReadAccess$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkBool32 shaderTileImageStencilReadAccess
     * }
     */
    public static final long shaderTileImageStencilReadAccess$offset() {
        return shaderTileImageStencilReadAccess$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkBool32 shaderTileImageStencilReadAccess
     * }
     */
    public static int shaderTileImageStencilReadAccess(MemorySegment struct) {
        return struct.get(shaderTileImageStencilReadAccess$LAYOUT, shaderTileImageStencilReadAccess$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkBool32 shaderTileImageStencilReadAccess
     * }
     */
    public static void shaderTileImageStencilReadAccess(MemorySegment struct, int fieldValue) {
        struct.set(shaderTileImageStencilReadAccess$LAYOUT, shaderTileImageStencilReadAccess$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

