// Generated by jextract

package org.vulkan;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct VkPhysicalDeviceAccelerationStructureFeaturesKHR {
 *     VkStructureType sType;
 *     void *pNext;
 *     VkBool32 accelerationStructure;
 *     VkBool32 accelerationStructureCaptureReplay;
 *     VkBool32 accelerationStructureIndirectBuild;
 *     VkBool32 accelerationStructureHostCommands;
 *     VkBool32 descriptorBindingAccelerationStructureUpdateAfterBind;
 * }
 * }
 */
public class VkPhysicalDeviceAccelerationStructureFeaturesKHR {

    VkPhysicalDeviceAccelerationStructureFeaturesKHR() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        vulkan_h.C_INT.withName("sType"),
        MemoryLayout.paddingLayout(4),
        vulkan_h.C_POINTER.withName("pNext"),
        vulkan_h.C_INT.withName("accelerationStructure"),
        vulkan_h.C_INT.withName("accelerationStructureCaptureReplay"),
        vulkan_h.C_INT.withName("accelerationStructureIndirectBuild"),
        vulkan_h.C_INT.withName("accelerationStructureHostCommands"),
        vulkan_h.C_INT.withName("descriptorBindingAccelerationStructureUpdateAfterBind"),
        MemoryLayout.paddingLayout(4)
    ).withName("VkPhysicalDeviceAccelerationStructureFeaturesKHR");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt sType$LAYOUT = (OfInt)$LAYOUT.select(groupElement("sType"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final OfInt sType$layout() {
        return sType$LAYOUT;
    }

    private static final long sType$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final long sType$offset() {
        return sType$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static int sType(MemorySegment struct) {
        return struct.get(sType$LAYOUT, sType$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static void sType(MemorySegment struct, int fieldValue) {
        struct.set(sType$LAYOUT, sType$OFFSET, fieldValue);
    }

    private static final AddressLayout pNext$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pNext"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * void *pNext
     * }
     */
    public static final AddressLayout pNext$layout() {
        return pNext$LAYOUT;
    }

    private static final long pNext$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * void *pNext
     * }
     */
    public static final long pNext$offset() {
        return pNext$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * void *pNext
     * }
     */
    public static MemorySegment pNext(MemorySegment struct) {
        return struct.get(pNext$LAYOUT, pNext$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * void *pNext
     * }
     */
    public static void pNext(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pNext$LAYOUT, pNext$OFFSET, fieldValue);
    }

    private static final OfInt accelerationStructure$LAYOUT = (OfInt)$LAYOUT.select(groupElement("accelerationStructure"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkBool32 accelerationStructure
     * }
     */
    public static final OfInt accelerationStructure$layout() {
        return accelerationStructure$LAYOUT;
    }

    private static final long accelerationStructure$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkBool32 accelerationStructure
     * }
     */
    public static final long accelerationStructure$offset() {
        return accelerationStructure$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkBool32 accelerationStructure
     * }
     */
    public static int accelerationStructure(MemorySegment struct) {
        return struct.get(accelerationStructure$LAYOUT, accelerationStructure$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkBool32 accelerationStructure
     * }
     */
    public static void accelerationStructure(MemorySegment struct, int fieldValue) {
        struct.set(accelerationStructure$LAYOUT, accelerationStructure$OFFSET, fieldValue);
    }

    private static final OfInt accelerationStructureCaptureReplay$LAYOUT = (OfInt)$LAYOUT.select(groupElement("accelerationStructureCaptureReplay"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkBool32 accelerationStructureCaptureReplay
     * }
     */
    public static final OfInt accelerationStructureCaptureReplay$layout() {
        return accelerationStructureCaptureReplay$LAYOUT;
    }

    private static final long accelerationStructureCaptureReplay$OFFSET = 20;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkBool32 accelerationStructureCaptureReplay
     * }
     */
    public static final long accelerationStructureCaptureReplay$offset() {
        return accelerationStructureCaptureReplay$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkBool32 accelerationStructureCaptureReplay
     * }
     */
    public static int accelerationStructureCaptureReplay(MemorySegment struct) {
        return struct.get(accelerationStructureCaptureReplay$LAYOUT, accelerationStructureCaptureReplay$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkBool32 accelerationStructureCaptureReplay
     * }
     */
    public static void accelerationStructureCaptureReplay(MemorySegment struct, int fieldValue) {
        struct.set(accelerationStructureCaptureReplay$LAYOUT, accelerationStructureCaptureReplay$OFFSET, fieldValue);
    }

    private static final OfInt accelerationStructureIndirectBuild$LAYOUT = (OfInt)$LAYOUT.select(groupElement("accelerationStructureIndirectBuild"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkBool32 accelerationStructureIndirectBuild
     * }
     */
    public static final OfInt accelerationStructureIndirectBuild$layout() {
        return accelerationStructureIndirectBuild$LAYOUT;
    }

    private static final long accelerationStructureIndirectBuild$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkBool32 accelerationStructureIndirectBuild
     * }
     */
    public static final long accelerationStructureIndirectBuild$offset() {
        return accelerationStructureIndirectBuild$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkBool32 accelerationStructureIndirectBuild
     * }
     */
    public static int accelerationStructureIndirectBuild(MemorySegment struct) {
        return struct.get(accelerationStructureIndirectBuild$LAYOUT, accelerationStructureIndirectBuild$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkBool32 accelerationStructureIndirectBuild
     * }
     */
    public static void accelerationStructureIndirectBuild(MemorySegment struct, int fieldValue) {
        struct.set(accelerationStructureIndirectBuild$LAYOUT, accelerationStructureIndirectBuild$OFFSET, fieldValue);
    }

    private static final OfInt accelerationStructureHostCommands$LAYOUT = (OfInt)$LAYOUT.select(groupElement("accelerationStructureHostCommands"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkBool32 accelerationStructureHostCommands
     * }
     */
    public static final OfInt accelerationStructureHostCommands$layout() {
        return accelerationStructureHostCommands$LAYOUT;
    }

    private static final long accelerationStructureHostCommands$OFFSET = 28;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkBool32 accelerationStructureHostCommands
     * }
     */
    public static final long accelerationStructureHostCommands$offset() {
        return accelerationStructureHostCommands$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkBool32 accelerationStructureHostCommands
     * }
     */
    public static int accelerationStructureHostCommands(MemorySegment struct) {
        return struct.get(accelerationStructureHostCommands$LAYOUT, accelerationStructureHostCommands$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkBool32 accelerationStructureHostCommands
     * }
     */
    public static void accelerationStructureHostCommands(MemorySegment struct, int fieldValue) {
        struct.set(accelerationStructureHostCommands$LAYOUT, accelerationStructureHostCommands$OFFSET, fieldValue);
    }

    private static final OfInt descriptorBindingAccelerationStructureUpdateAfterBind$LAYOUT = (OfInt)$LAYOUT.select(groupElement("descriptorBindingAccelerationStructureUpdateAfterBind"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkBool32 descriptorBindingAccelerationStructureUpdateAfterBind
     * }
     */
    public static final OfInt descriptorBindingAccelerationStructureUpdateAfterBind$layout() {
        return descriptorBindingAccelerationStructureUpdateAfterBind$LAYOUT;
    }

    private static final long descriptorBindingAccelerationStructureUpdateAfterBind$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkBool32 descriptorBindingAccelerationStructureUpdateAfterBind
     * }
     */
    public static final long descriptorBindingAccelerationStructureUpdateAfterBind$offset() {
        return descriptorBindingAccelerationStructureUpdateAfterBind$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkBool32 descriptorBindingAccelerationStructureUpdateAfterBind
     * }
     */
    public static int descriptorBindingAccelerationStructureUpdateAfterBind(MemorySegment struct) {
        return struct.get(descriptorBindingAccelerationStructureUpdateAfterBind$LAYOUT, descriptorBindingAccelerationStructureUpdateAfterBind$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkBool32 descriptorBindingAccelerationStructureUpdateAfterBind
     * }
     */
    public static void descriptorBindingAccelerationStructureUpdateAfterBind(MemorySegment struct, int fieldValue) {
        struct.set(descriptorBindingAccelerationStructureUpdateAfterBind$LAYOUT, descriptorBindingAccelerationStructureUpdateAfterBind$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

