// Generated by jextract

package org.vulkan;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct VkPhysicalDeviceTexelBufferAlignmentProperties {
 *     VkStructureType sType;
 *     void *pNext;
 *     VkDeviceSize storageTexelBufferOffsetAlignmentBytes;
 *     VkBool32 storageTexelBufferOffsetSingleTexelAlignment;
 *     VkDeviceSize uniformTexelBufferOffsetAlignmentBytes;
 *     VkBool32 uniformTexelBufferOffsetSingleTexelAlignment;
 * }
 * }
 */
public class VkPhysicalDeviceTexelBufferAlignmentProperties {

    VkPhysicalDeviceTexelBufferAlignmentProperties() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        vulkan_h.C_INT.withName("sType"),
        MemoryLayout.paddingLayout(4),
        vulkan_h.C_POINTER.withName("pNext"),
        vulkan_h.C_LONG_LONG.withName("storageTexelBufferOffsetAlignmentBytes"),
        vulkan_h.C_INT.withName("storageTexelBufferOffsetSingleTexelAlignment"),
        MemoryLayout.paddingLayout(4),
        vulkan_h.C_LONG_LONG.withName("uniformTexelBufferOffsetAlignmentBytes"),
        vulkan_h.C_INT.withName("uniformTexelBufferOffsetSingleTexelAlignment"),
        MemoryLayout.paddingLayout(4)
    ).withName("VkPhysicalDeviceTexelBufferAlignmentProperties");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt sType$LAYOUT = (OfInt)$LAYOUT.select(groupElement("sType"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final OfInt sType$layout() {
        return sType$LAYOUT;
    }

    private static final long sType$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final long sType$offset() {
        return sType$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static int sType(MemorySegment struct) {
        return struct.get(sType$LAYOUT, sType$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static void sType(MemorySegment struct, int fieldValue) {
        struct.set(sType$LAYOUT, sType$OFFSET, fieldValue);
    }

    private static final AddressLayout pNext$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pNext"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * void *pNext
     * }
     */
    public static final AddressLayout pNext$layout() {
        return pNext$LAYOUT;
    }

    private static final long pNext$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * void *pNext
     * }
     */
    public static final long pNext$offset() {
        return pNext$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * void *pNext
     * }
     */
    public static MemorySegment pNext(MemorySegment struct) {
        return struct.get(pNext$LAYOUT, pNext$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * void *pNext
     * }
     */
    public static void pNext(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pNext$LAYOUT, pNext$OFFSET, fieldValue);
    }

    private static final OfLong storageTexelBufferOffsetAlignmentBytes$LAYOUT = (OfLong)$LAYOUT.select(groupElement("storageTexelBufferOffsetAlignmentBytes"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkDeviceSize storageTexelBufferOffsetAlignmentBytes
     * }
     */
    public static final OfLong storageTexelBufferOffsetAlignmentBytes$layout() {
        return storageTexelBufferOffsetAlignmentBytes$LAYOUT;
    }

    private static final long storageTexelBufferOffsetAlignmentBytes$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkDeviceSize storageTexelBufferOffsetAlignmentBytes
     * }
     */
    public static final long storageTexelBufferOffsetAlignmentBytes$offset() {
        return storageTexelBufferOffsetAlignmentBytes$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkDeviceSize storageTexelBufferOffsetAlignmentBytes
     * }
     */
    public static long storageTexelBufferOffsetAlignmentBytes(MemorySegment struct) {
        return struct.get(storageTexelBufferOffsetAlignmentBytes$LAYOUT, storageTexelBufferOffsetAlignmentBytes$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkDeviceSize storageTexelBufferOffsetAlignmentBytes
     * }
     */
    public static void storageTexelBufferOffsetAlignmentBytes(MemorySegment struct, long fieldValue) {
        struct.set(storageTexelBufferOffsetAlignmentBytes$LAYOUT, storageTexelBufferOffsetAlignmentBytes$OFFSET, fieldValue);
    }

    private static final OfInt storageTexelBufferOffsetSingleTexelAlignment$LAYOUT = (OfInt)$LAYOUT.select(groupElement("storageTexelBufferOffsetSingleTexelAlignment"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkBool32 storageTexelBufferOffsetSingleTexelAlignment
     * }
     */
    public static final OfInt storageTexelBufferOffsetSingleTexelAlignment$layout() {
        return storageTexelBufferOffsetSingleTexelAlignment$LAYOUT;
    }

    private static final long storageTexelBufferOffsetSingleTexelAlignment$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkBool32 storageTexelBufferOffsetSingleTexelAlignment
     * }
     */
    public static final long storageTexelBufferOffsetSingleTexelAlignment$offset() {
        return storageTexelBufferOffsetSingleTexelAlignment$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkBool32 storageTexelBufferOffsetSingleTexelAlignment
     * }
     */
    public static int storageTexelBufferOffsetSingleTexelAlignment(MemorySegment struct) {
        return struct.get(storageTexelBufferOffsetSingleTexelAlignment$LAYOUT, storageTexelBufferOffsetSingleTexelAlignment$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkBool32 storageTexelBufferOffsetSingleTexelAlignment
     * }
     */
    public static void storageTexelBufferOffsetSingleTexelAlignment(MemorySegment struct, int fieldValue) {
        struct.set(storageTexelBufferOffsetSingleTexelAlignment$LAYOUT, storageTexelBufferOffsetSingleTexelAlignment$OFFSET, fieldValue);
    }

    private static final OfLong uniformTexelBufferOffsetAlignmentBytes$LAYOUT = (OfLong)$LAYOUT.select(groupElement("uniformTexelBufferOffsetAlignmentBytes"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkDeviceSize uniformTexelBufferOffsetAlignmentBytes
     * }
     */
    public static final OfLong uniformTexelBufferOffsetAlignmentBytes$layout() {
        return uniformTexelBufferOffsetAlignmentBytes$LAYOUT;
    }

    private static final long uniformTexelBufferOffsetAlignmentBytes$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkDeviceSize uniformTexelBufferOffsetAlignmentBytes
     * }
     */
    public static final long uniformTexelBufferOffsetAlignmentBytes$offset() {
        return uniformTexelBufferOffsetAlignmentBytes$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkDeviceSize uniformTexelBufferOffsetAlignmentBytes
     * }
     */
    public static long uniformTexelBufferOffsetAlignmentBytes(MemorySegment struct) {
        return struct.get(uniformTexelBufferOffsetAlignmentBytes$LAYOUT, uniformTexelBufferOffsetAlignmentBytes$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkDeviceSize uniformTexelBufferOffsetAlignmentBytes
     * }
     */
    public static void uniformTexelBufferOffsetAlignmentBytes(MemorySegment struct, long fieldValue) {
        struct.set(uniformTexelBufferOffsetAlignmentBytes$LAYOUT, uniformTexelBufferOffsetAlignmentBytes$OFFSET, fieldValue);
    }

    private static final OfInt uniformTexelBufferOffsetSingleTexelAlignment$LAYOUT = (OfInt)$LAYOUT.select(groupElement("uniformTexelBufferOffsetSingleTexelAlignment"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkBool32 uniformTexelBufferOffsetSingleTexelAlignment
     * }
     */
    public static final OfInt uniformTexelBufferOffsetSingleTexelAlignment$layout() {
        return uniformTexelBufferOffsetSingleTexelAlignment$LAYOUT;
    }

    private static final long uniformTexelBufferOffsetSingleTexelAlignment$OFFSET = 40;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkBool32 uniformTexelBufferOffsetSingleTexelAlignment
     * }
     */
    public static final long uniformTexelBufferOffsetSingleTexelAlignment$offset() {
        return uniformTexelBufferOffsetSingleTexelAlignment$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkBool32 uniformTexelBufferOffsetSingleTexelAlignment
     * }
     */
    public static int uniformTexelBufferOffsetSingleTexelAlignment(MemorySegment struct) {
        return struct.get(uniformTexelBufferOffsetSingleTexelAlignment$LAYOUT, uniformTexelBufferOffsetSingleTexelAlignment$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkBool32 uniformTexelBufferOffsetSingleTexelAlignment
     * }
     */
    public static void uniformTexelBufferOffsetSingleTexelAlignment(MemorySegment struct, int fieldValue) {
        struct.set(uniformTexelBufferOffsetSingleTexelAlignment$LAYOUT, uniformTexelBufferOffsetSingleTexelAlignment$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

