// Generated by jextract

package org.vulkan;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct VkPhysicalDeviceShadingRateImagePropertiesNV {
 *     VkStructureType sType;
 *     void *pNext;
 *     VkExtent2D shadingRateTexelSize;
 *     uint32_t shadingRatePaletteSize;
 *     uint32_t shadingRateMaxCoarseSamples;
 * }
 * }
 */
public class VkPhysicalDeviceShadingRateImagePropertiesNV {

    VkPhysicalDeviceShadingRateImagePropertiesNV() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        vulkan_h.C_INT.withName("sType"),
        MemoryLayout.paddingLayout(4),
        vulkan_h.C_POINTER.withName("pNext"),
        VkExtent2D.layout().withName("shadingRateTexelSize"),
        vulkan_h.C_INT.withName("shadingRatePaletteSize"),
        vulkan_h.C_INT.withName("shadingRateMaxCoarseSamples")
    ).withName("VkPhysicalDeviceShadingRateImagePropertiesNV");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt sType$LAYOUT = (OfInt)$LAYOUT.select(groupElement("sType"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final OfInt sType$layout() {
        return sType$LAYOUT;
    }

    private static final long sType$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final long sType$offset() {
        return sType$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static int sType(MemorySegment struct) {
        return struct.get(sType$LAYOUT, sType$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static void sType(MemorySegment struct, int fieldValue) {
        struct.set(sType$LAYOUT, sType$OFFSET, fieldValue);
    }

    private static final AddressLayout pNext$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pNext"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * void *pNext
     * }
     */
    public static final AddressLayout pNext$layout() {
        return pNext$LAYOUT;
    }

    private static final long pNext$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * void *pNext
     * }
     */
    public static final long pNext$offset() {
        return pNext$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * void *pNext
     * }
     */
    public static MemorySegment pNext(MemorySegment struct) {
        return struct.get(pNext$LAYOUT, pNext$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * void *pNext
     * }
     */
    public static void pNext(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pNext$LAYOUT, pNext$OFFSET, fieldValue);
    }

    private static final GroupLayout shadingRateTexelSize$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("shadingRateTexelSize"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkExtent2D shadingRateTexelSize
     * }
     */
    public static final GroupLayout shadingRateTexelSize$layout() {
        return shadingRateTexelSize$LAYOUT;
    }

    private static final long shadingRateTexelSize$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkExtent2D shadingRateTexelSize
     * }
     */
    public static final long shadingRateTexelSize$offset() {
        return shadingRateTexelSize$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkExtent2D shadingRateTexelSize
     * }
     */
    public static MemorySegment shadingRateTexelSize(MemorySegment struct) {
        return struct.asSlice(shadingRateTexelSize$OFFSET, shadingRateTexelSize$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkExtent2D shadingRateTexelSize
     * }
     */
    public static void shadingRateTexelSize(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, shadingRateTexelSize$OFFSET, shadingRateTexelSize$LAYOUT.byteSize());
    }

    private static final OfInt shadingRatePaletteSize$LAYOUT = (OfInt)$LAYOUT.select(groupElement("shadingRatePaletteSize"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t shadingRatePaletteSize
     * }
     */
    public static final OfInt shadingRatePaletteSize$layout() {
        return shadingRatePaletteSize$LAYOUT;
    }

    private static final long shadingRatePaletteSize$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t shadingRatePaletteSize
     * }
     */
    public static final long shadingRatePaletteSize$offset() {
        return shadingRatePaletteSize$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t shadingRatePaletteSize
     * }
     */
    public static int shadingRatePaletteSize(MemorySegment struct) {
        return struct.get(shadingRatePaletteSize$LAYOUT, shadingRatePaletteSize$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t shadingRatePaletteSize
     * }
     */
    public static void shadingRatePaletteSize(MemorySegment struct, int fieldValue) {
        struct.set(shadingRatePaletteSize$LAYOUT, shadingRatePaletteSize$OFFSET, fieldValue);
    }

    private static final OfInt shadingRateMaxCoarseSamples$LAYOUT = (OfInt)$LAYOUT.select(groupElement("shadingRateMaxCoarseSamples"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t shadingRateMaxCoarseSamples
     * }
     */
    public static final OfInt shadingRateMaxCoarseSamples$layout() {
        return shadingRateMaxCoarseSamples$LAYOUT;
    }

    private static final long shadingRateMaxCoarseSamples$OFFSET = 28;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t shadingRateMaxCoarseSamples
     * }
     */
    public static final long shadingRateMaxCoarseSamples$offset() {
        return shadingRateMaxCoarseSamples$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t shadingRateMaxCoarseSamples
     * }
     */
    public static int shadingRateMaxCoarseSamples(MemorySegment struct) {
        return struct.get(shadingRateMaxCoarseSamples$LAYOUT, shadingRateMaxCoarseSamples$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t shadingRateMaxCoarseSamples
     * }
     */
    public static void shadingRateMaxCoarseSamples(MemorySegment struct, int fieldValue) {
        struct.set(shadingRateMaxCoarseSamples$LAYOUT, shadingRateMaxCoarseSamples$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

