// Generated by jextract

package org.vulkan;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct VkPhysicalDeviceShaderCoreBuiltinsPropertiesARM {
 *     VkStructureType sType;
 *     void *pNext;
 *     uint64_t shaderCoreMask;
 *     uint32_t shaderCoreCount;
 *     uint32_t shaderWarpsPerCore;
 * }
 * }
 */
public class VkPhysicalDeviceShaderCoreBuiltinsPropertiesARM {

    VkPhysicalDeviceShaderCoreBuiltinsPropertiesARM() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        vulkan_h.C_INT.withName("sType"),
        MemoryLayout.paddingLayout(4),
        vulkan_h.C_POINTER.withName("pNext"),
        vulkan_h.C_LONG_LONG.withName("shaderCoreMask"),
        vulkan_h.C_INT.withName("shaderCoreCount"),
        vulkan_h.C_INT.withName("shaderWarpsPerCore")
    ).withName("VkPhysicalDeviceShaderCoreBuiltinsPropertiesARM");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt sType$LAYOUT = (OfInt)$LAYOUT.select(groupElement("sType"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final OfInt sType$layout() {
        return sType$LAYOUT;
    }

    private static final long sType$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final long sType$offset() {
        return sType$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static int sType(MemorySegment struct) {
        return struct.get(sType$LAYOUT, sType$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static void sType(MemorySegment struct, int fieldValue) {
        struct.set(sType$LAYOUT, sType$OFFSET, fieldValue);
    }

    private static final AddressLayout pNext$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pNext"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * void *pNext
     * }
     */
    public static final AddressLayout pNext$layout() {
        return pNext$LAYOUT;
    }

    private static final long pNext$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * void *pNext
     * }
     */
    public static final long pNext$offset() {
        return pNext$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * void *pNext
     * }
     */
    public static MemorySegment pNext(MemorySegment struct) {
        return struct.get(pNext$LAYOUT, pNext$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * void *pNext
     * }
     */
    public static void pNext(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pNext$LAYOUT, pNext$OFFSET, fieldValue);
    }

    private static final OfLong shaderCoreMask$LAYOUT = (OfLong)$LAYOUT.select(groupElement("shaderCoreMask"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint64_t shaderCoreMask
     * }
     */
    public static final OfLong shaderCoreMask$layout() {
        return shaderCoreMask$LAYOUT;
    }

    private static final long shaderCoreMask$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint64_t shaderCoreMask
     * }
     */
    public static final long shaderCoreMask$offset() {
        return shaderCoreMask$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint64_t shaderCoreMask
     * }
     */
    public static long shaderCoreMask(MemorySegment struct) {
        return struct.get(shaderCoreMask$LAYOUT, shaderCoreMask$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint64_t shaderCoreMask
     * }
     */
    public static void shaderCoreMask(MemorySegment struct, long fieldValue) {
        struct.set(shaderCoreMask$LAYOUT, shaderCoreMask$OFFSET, fieldValue);
    }

    private static final OfInt shaderCoreCount$LAYOUT = (OfInt)$LAYOUT.select(groupElement("shaderCoreCount"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t shaderCoreCount
     * }
     */
    public static final OfInt shaderCoreCount$layout() {
        return shaderCoreCount$LAYOUT;
    }

    private static final long shaderCoreCount$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t shaderCoreCount
     * }
     */
    public static final long shaderCoreCount$offset() {
        return shaderCoreCount$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t shaderCoreCount
     * }
     */
    public static int shaderCoreCount(MemorySegment struct) {
        return struct.get(shaderCoreCount$LAYOUT, shaderCoreCount$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t shaderCoreCount
     * }
     */
    public static void shaderCoreCount(MemorySegment struct, int fieldValue) {
        struct.set(shaderCoreCount$LAYOUT, shaderCoreCount$OFFSET, fieldValue);
    }

    private static final OfInt shaderWarpsPerCore$LAYOUT = (OfInt)$LAYOUT.select(groupElement("shaderWarpsPerCore"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t shaderWarpsPerCore
     * }
     */
    public static final OfInt shaderWarpsPerCore$layout() {
        return shaderWarpsPerCore$LAYOUT;
    }

    private static final long shaderWarpsPerCore$OFFSET = 28;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t shaderWarpsPerCore
     * }
     */
    public static final long shaderWarpsPerCore$offset() {
        return shaderWarpsPerCore$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t shaderWarpsPerCore
     * }
     */
    public static int shaderWarpsPerCore(MemorySegment struct) {
        return struct.get(shaderWarpsPerCore$LAYOUT, shaderWarpsPerCore$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t shaderWarpsPerCore
     * }
     */
    public static void shaderWarpsPerCore(MemorySegment struct, int fieldValue) {
        struct.set(shaderWarpsPerCore$LAYOUT, shaderWarpsPerCore$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

