// Generated by jextract

package org.vulkan;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct VkPhysicalDeviceRayTracingPipelineFeaturesKHR {
 *     VkStructureType sType;
 *     void *pNext;
 *     VkBool32 rayTracingPipeline;
 *     VkBool32 rayTracingPipelineShaderGroupHandleCaptureReplay;
 *     VkBool32 rayTracingPipelineShaderGroupHandleCaptureReplayMixed;
 *     VkBool32 rayTracingPipelineTraceRaysIndirect;
 *     VkBool32 rayTraversalPrimitiveCulling;
 * }
 * }
 */
public class VkPhysicalDeviceRayTracingPipelineFeaturesKHR {

    VkPhysicalDeviceRayTracingPipelineFeaturesKHR() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        vulkan_h.C_INT.withName("sType"),
        MemoryLayout.paddingLayout(4),
        vulkan_h.C_POINTER.withName("pNext"),
        vulkan_h.C_INT.withName("rayTracingPipeline"),
        vulkan_h.C_INT.withName("rayTracingPipelineShaderGroupHandleCaptureReplay"),
        vulkan_h.C_INT.withName("rayTracingPipelineShaderGroupHandleCaptureReplayMixed"),
        vulkan_h.C_INT.withName("rayTracingPipelineTraceRaysIndirect"),
        vulkan_h.C_INT.withName("rayTraversalPrimitiveCulling"),
        MemoryLayout.paddingLayout(4)
    ).withName("VkPhysicalDeviceRayTracingPipelineFeaturesKHR");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt sType$LAYOUT = (OfInt)$LAYOUT.select(groupElement("sType"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final OfInt sType$layout() {
        return sType$LAYOUT;
    }

    private static final long sType$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final long sType$offset() {
        return sType$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static int sType(MemorySegment struct) {
        return struct.get(sType$LAYOUT, sType$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static void sType(MemorySegment struct, int fieldValue) {
        struct.set(sType$LAYOUT, sType$OFFSET, fieldValue);
    }

    private static final AddressLayout pNext$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pNext"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * void *pNext
     * }
     */
    public static final AddressLayout pNext$layout() {
        return pNext$LAYOUT;
    }

    private static final long pNext$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * void *pNext
     * }
     */
    public static final long pNext$offset() {
        return pNext$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * void *pNext
     * }
     */
    public static MemorySegment pNext(MemorySegment struct) {
        return struct.get(pNext$LAYOUT, pNext$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * void *pNext
     * }
     */
    public static void pNext(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pNext$LAYOUT, pNext$OFFSET, fieldValue);
    }

    private static final OfInt rayTracingPipeline$LAYOUT = (OfInt)$LAYOUT.select(groupElement("rayTracingPipeline"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkBool32 rayTracingPipeline
     * }
     */
    public static final OfInt rayTracingPipeline$layout() {
        return rayTracingPipeline$LAYOUT;
    }

    private static final long rayTracingPipeline$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkBool32 rayTracingPipeline
     * }
     */
    public static final long rayTracingPipeline$offset() {
        return rayTracingPipeline$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkBool32 rayTracingPipeline
     * }
     */
    public static int rayTracingPipeline(MemorySegment struct) {
        return struct.get(rayTracingPipeline$LAYOUT, rayTracingPipeline$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkBool32 rayTracingPipeline
     * }
     */
    public static void rayTracingPipeline(MemorySegment struct, int fieldValue) {
        struct.set(rayTracingPipeline$LAYOUT, rayTracingPipeline$OFFSET, fieldValue);
    }

    private static final OfInt rayTracingPipelineShaderGroupHandleCaptureReplay$LAYOUT = (OfInt)$LAYOUT.select(groupElement("rayTracingPipelineShaderGroupHandleCaptureReplay"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkBool32 rayTracingPipelineShaderGroupHandleCaptureReplay
     * }
     */
    public static final OfInt rayTracingPipelineShaderGroupHandleCaptureReplay$layout() {
        return rayTracingPipelineShaderGroupHandleCaptureReplay$LAYOUT;
    }

    private static final long rayTracingPipelineShaderGroupHandleCaptureReplay$OFFSET = 20;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkBool32 rayTracingPipelineShaderGroupHandleCaptureReplay
     * }
     */
    public static final long rayTracingPipelineShaderGroupHandleCaptureReplay$offset() {
        return rayTracingPipelineShaderGroupHandleCaptureReplay$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkBool32 rayTracingPipelineShaderGroupHandleCaptureReplay
     * }
     */
    public static int rayTracingPipelineShaderGroupHandleCaptureReplay(MemorySegment struct) {
        return struct.get(rayTracingPipelineShaderGroupHandleCaptureReplay$LAYOUT, rayTracingPipelineShaderGroupHandleCaptureReplay$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkBool32 rayTracingPipelineShaderGroupHandleCaptureReplay
     * }
     */
    public static void rayTracingPipelineShaderGroupHandleCaptureReplay(MemorySegment struct, int fieldValue) {
        struct.set(rayTracingPipelineShaderGroupHandleCaptureReplay$LAYOUT, rayTracingPipelineShaderGroupHandleCaptureReplay$OFFSET, fieldValue);
    }

    private static final OfInt rayTracingPipelineShaderGroupHandleCaptureReplayMixed$LAYOUT = (OfInt)$LAYOUT.select(groupElement("rayTracingPipelineShaderGroupHandleCaptureReplayMixed"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkBool32 rayTracingPipelineShaderGroupHandleCaptureReplayMixed
     * }
     */
    public static final OfInt rayTracingPipelineShaderGroupHandleCaptureReplayMixed$layout() {
        return rayTracingPipelineShaderGroupHandleCaptureReplayMixed$LAYOUT;
    }

    private static final long rayTracingPipelineShaderGroupHandleCaptureReplayMixed$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkBool32 rayTracingPipelineShaderGroupHandleCaptureReplayMixed
     * }
     */
    public static final long rayTracingPipelineShaderGroupHandleCaptureReplayMixed$offset() {
        return rayTracingPipelineShaderGroupHandleCaptureReplayMixed$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkBool32 rayTracingPipelineShaderGroupHandleCaptureReplayMixed
     * }
     */
    public static int rayTracingPipelineShaderGroupHandleCaptureReplayMixed(MemorySegment struct) {
        return struct.get(rayTracingPipelineShaderGroupHandleCaptureReplayMixed$LAYOUT, rayTracingPipelineShaderGroupHandleCaptureReplayMixed$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkBool32 rayTracingPipelineShaderGroupHandleCaptureReplayMixed
     * }
     */
    public static void rayTracingPipelineShaderGroupHandleCaptureReplayMixed(MemorySegment struct, int fieldValue) {
        struct.set(rayTracingPipelineShaderGroupHandleCaptureReplayMixed$LAYOUT, rayTracingPipelineShaderGroupHandleCaptureReplayMixed$OFFSET, fieldValue);
    }

    private static final OfInt rayTracingPipelineTraceRaysIndirect$LAYOUT = (OfInt)$LAYOUT.select(groupElement("rayTracingPipelineTraceRaysIndirect"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkBool32 rayTracingPipelineTraceRaysIndirect
     * }
     */
    public static final OfInt rayTracingPipelineTraceRaysIndirect$layout() {
        return rayTracingPipelineTraceRaysIndirect$LAYOUT;
    }

    private static final long rayTracingPipelineTraceRaysIndirect$OFFSET = 28;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkBool32 rayTracingPipelineTraceRaysIndirect
     * }
     */
    public static final long rayTracingPipelineTraceRaysIndirect$offset() {
        return rayTracingPipelineTraceRaysIndirect$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkBool32 rayTracingPipelineTraceRaysIndirect
     * }
     */
    public static int rayTracingPipelineTraceRaysIndirect(MemorySegment struct) {
        return struct.get(rayTracingPipelineTraceRaysIndirect$LAYOUT, rayTracingPipelineTraceRaysIndirect$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkBool32 rayTracingPipelineTraceRaysIndirect
     * }
     */
    public static void rayTracingPipelineTraceRaysIndirect(MemorySegment struct, int fieldValue) {
        struct.set(rayTracingPipelineTraceRaysIndirect$LAYOUT, rayTracingPipelineTraceRaysIndirect$OFFSET, fieldValue);
    }

    private static final OfInt rayTraversalPrimitiveCulling$LAYOUT = (OfInt)$LAYOUT.select(groupElement("rayTraversalPrimitiveCulling"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkBool32 rayTraversalPrimitiveCulling
     * }
     */
    public static final OfInt rayTraversalPrimitiveCulling$layout() {
        return rayTraversalPrimitiveCulling$LAYOUT;
    }

    private static final long rayTraversalPrimitiveCulling$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkBool32 rayTraversalPrimitiveCulling
     * }
     */
    public static final long rayTraversalPrimitiveCulling$offset() {
        return rayTraversalPrimitiveCulling$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkBool32 rayTraversalPrimitiveCulling
     * }
     */
    public static int rayTraversalPrimitiveCulling(MemorySegment struct) {
        return struct.get(rayTraversalPrimitiveCulling$LAYOUT, rayTraversalPrimitiveCulling$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkBool32 rayTraversalPrimitiveCulling
     * }
     */
    public static void rayTraversalPrimitiveCulling(MemorySegment struct, int fieldValue) {
        struct.set(rayTraversalPrimitiveCulling$LAYOUT, rayTraversalPrimitiveCulling$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

