// Generated by jextract

package org.vulkan;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct VkPhysicalDeviceRobustness2FeaturesEXT {
 *     VkStructureType sType;
 *     void *pNext;
 *     VkBool32 robustBufferAccess2;
 *     VkBool32 robustImageAccess2;
 *     VkBool32 nullDescriptor;
 * }
 * }
 */
public class VkPhysicalDeviceRobustness2FeaturesEXT {

    VkPhysicalDeviceRobustness2FeaturesEXT() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        vulkan_h.C_INT.withName("sType"),
        MemoryLayout.paddingLayout(4),
        vulkan_h.C_POINTER.withName("pNext"),
        vulkan_h.C_INT.withName("robustBufferAccess2"),
        vulkan_h.C_INT.withName("robustImageAccess2"),
        vulkan_h.C_INT.withName("nullDescriptor"),
        MemoryLayout.paddingLayout(4)
    ).withName("VkPhysicalDeviceRobustness2FeaturesEXT");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt sType$LAYOUT = (OfInt)$LAYOUT.select(groupElement("sType"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final OfInt sType$layout() {
        return sType$LAYOUT;
    }

    private static final long sType$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final long sType$offset() {
        return sType$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static int sType(MemorySegment struct) {
        return struct.get(sType$LAYOUT, sType$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static void sType(MemorySegment struct, int fieldValue) {
        struct.set(sType$LAYOUT, sType$OFFSET, fieldValue);
    }

    private static final AddressLayout pNext$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pNext"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * void *pNext
     * }
     */
    public static final AddressLayout pNext$layout() {
        return pNext$LAYOUT;
    }

    private static final long pNext$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * void *pNext
     * }
     */
    public static final long pNext$offset() {
        return pNext$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * void *pNext
     * }
     */
    public static MemorySegment pNext(MemorySegment struct) {
        return struct.get(pNext$LAYOUT, pNext$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * void *pNext
     * }
     */
    public static void pNext(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pNext$LAYOUT, pNext$OFFSET, fieldValue);
    }

    private static final OfInt robustBufferAccess2$LAYOUT = (OfInt)$LAYOUT.select(groupElement("robustBufferAccess2"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkBool32 robustBufferAccess2
     * }
     */
    public static final OfInt robustBufferAccess2$layout() {
        return robustBufferAccess2$LAYOUT;
    }

    private static final long robustBufferAccess2$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkBool32 robustBufferAccess2
     * }
     */
    public static final long robustBufferAccess2$offset() {
        return robustBufferAccess2$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkBool32 robustBufferAccess2
     * }
     */
    public static int robustBufferAccess2(MemorySegment struct) {
        return struct.get(robustBufferAccess2$LAYOUT, robustBufferAccess2$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkBool32 robustBufferAccess2
     * }
     */
    public static void robustBufferAccess2(MemorySegment struct, int fieldValue) {
        struct.set(robustBufferAccess2$LAYOUT, robustBufferAccess2$OFFSET, fieldValue);
    }

    private static final OfInt robustImageAccess2$LAYOUT = (OfInt)$LAYOUT.select(groupElement("robustImageAccess2"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkBool32 robustImageAccess2
     * }
     */
    public static final OfInt robustImageAccess2$layout() {
        return robustImageAccess2$LAYOUT;
    }

    private static final long robustImageAccess2$OFFSET = 20;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkBool32 robustImageAccess2
     * }
     */
    public static final long robustImageAccess2$offset() {
        return robustImageAccess2$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkBool32 robustImageAccess2
     * }
     */
    public static int robustImageAccess2(MemorySegment struct) {
        return struct.get(robustImageAccess2$LAYOUT, robustImageAccess2$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkBool32 robustImageAccess2
     * }
     */
    public static void robustImageAccess2(MemorySegment struct, int fieldValue) {
        struct.set(robustImageAccess2$LAYOUT, robustImageAccess2$OFFSET, fieldValue);
    }

    private static final OfInt nullDescriptor$LAYOUT = (OfInt)$LAYOUT.select(groupElement("nullDescriptor"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkBool32 nullDescriptor
     * }
     */
    public static final OfInt nullDescriptor$layout() {
        return nullDescriptor$LAYOUT;
    }

    private static final long nullDescriptor$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkBool32 nullDescriptor
     * }
     */
    public static final long nullDescriptor$offset() {
        return nullDescriptor$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkBool32 nullDescriptor
     * }
     */
    public static int nullDescriptor(MemorySegment struct) {
        return struct.get(nullDescriptor$LAYOUT, nullDescriptor$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkBool32 nullDescriptor
     * }
     */
    public static void nullDescriptor(MemorySegment struct, int fieldValue) {
        struct.set(nullDescriptor$LAYOUT, nullDescriptor$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

