// Generated by jextract

package org.vulkan;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct VkPhysicalDeviceInlineUniformBlockProperties {
 *     VkStructureType sType;
 *     void *pNext;
 *     uint32_t maxInlineUniformBlockSize;
 *     uint32_t maxPerStageDescriptorInlineUniformBlocks;
 *     uint32_t maxPerStageDescriptorUpdateAfterBindInlineUniformBlocks;
 *     uint32_t maxDescriptorSetInlineUniformBlocks;
 *     uint32_t maxDescriptorSetUpdateAfterBindInlineUniformBlocks;
 * }
 * }
 */
public class VkPhysicalDeviceInlineUniformBlockProperties {

    VkPhysicalDeviceInlineUniformBlockProperties() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        vulkan_h.C_INT.withName("sType"),
        MemoryLayout.paddingLayout(4),
        vulkan_h.C_POINTER.withName("pNext"),
        vulkan_h.C_INT.withName("maxInlineUniformBlockSize"),
        vulkan_h.C_INT.withName("maxPerStageDescriptorInlineUniformBlocks"),
        vulkan_h.C_INT.withName("maxPerStageDescriptorUpdateAfterBindInlineUniformBlocks"),
        vulkan_h.C_INT.withName("maxDescriptorSetInlineUniformBlocks"),
        vulkan_h.C_INT.withName("maxDescriptorSetUpdateAfterBindInlineUniformBlocks"),
        MemoryLayout.paddingLayout(4)
    ).withName("VkPhysicalDeviceInlineUniformBlockProperties");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt sType$LAYOUT = (OfInt)$LAYOUT.select(groupElement("sType"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final OfInt sType$layout() {
        return sType$LAYOUT;
    }

    private static final long sType$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final long sType$offset() {
        return sType$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static int sType(MemorySegment struct) {
        return struct.get(sType$LAYOUT, sType$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static void sType(MemorySegment struct, int fieldValue) {
        struct.set(sType$LAYOUT, sType$OFFSET, fieldValue);
    }

    private static final AddressLayout pNext$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pNext"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * void *pNext
     * }
     */
    public static final AddressLayout pNext$layout() {
        return pNext$LAYOUT;
    }

    private static final long pNext$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * void *pNext
     * }
     */
    public static final long pNext$offset() {
        return pNext$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * void *pNext
     * }
     */
    public static MemorySegment pNext(MemorySegment struct) {
        return struct.get(pNext$LAYOUT, pNext$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * void *pNext
     * }
     */
    public static void pNext(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pNext$LAYOUT, pNext$OFFSET, fieldValue);
    }

    private static final OfInt maxInlineUniformBlockSize$LAYOUT = (OfInt)$LAYOUT.select(groupElement("maxInlineUniformBlockSize"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t maxInlineUniformBlockSize
     * }
     */
    public static final OfInt maxInlineUniformBlockSize$layout() {
        return maxInlineUniformBlockSize$LAYOUT;
    }

    private static final long maxInlineUniformBlockSize$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t maxInlineUniformBlockSize
     * }
     */
    public static final long maxInlineUniformBlockSize$offset() {
        return maxInlineUniformBlockSize$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t maxInlineUniformBlockSize
     * }
     */
    public static int maxInlineUniformBlockSize(MemorySegment struct) {
        return struct.get(maxInlineUniformBlockSize$LAYOUT, maxInlineUniformBlockSize$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t maxInlineUniformBlockSize
     * }
     */
    public static void maxInlineUniformBlockSize(MemorySegment struct, int fieldValue) {
        struct.set(maxInlineUniformBlockSize$LAYOUT, maxInlineUniformBlockSize$OFFSET, fieldValue);
    }

    private static final OfInt maxPerStageDescriptorInlineUniformBlocks$LAYOUT = (OfInt)$LAYOUT.select(groupElement("maxPerStageDescriptorInlineUniformBlocks"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t maxPerStageDescriptorInlineUniformBlocks
     * }
     */
    public static final OfInt maxPerStageDescriptorInlineUniformBlocks$layout() {
        return maxPerStageDescriptorInlineUniformBlocks$LAYOUT;
    }

    private static final long maxPerStageDescriptorInlineUniformBlocks$OFFSET = 20;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t maxPerStageDescriptorInlineUniformBlocks
     * }
     */
    public static final long maxPerStageDescriptorInlineUniformBlocks$offset() {
        return maxPerStageDescriptorInlineUniformBlocks$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t maxPerStageDescriptorInlineUniformBlocks
     * }
     */
    public static int maxPerStageDescriptorInlineUniformBlocks(MemorySegment struct) {
        return struct.get(maxPerStageDescriptorInlineUniformBlocks$LAYOUT, maxPerStageDescriptorInlineUniformBlocks$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t maxPerStageDescriptorInlineUniformBlocks
     * }
     */
    public static void maxPerStageDescriptorInlineUniformBlocks(MemorySegment struct, int fieldValue) {
        struct.set(maxPerStageDescriptorInlineUniformBlocks$LAYOUT, maxPerStageDescriptorInlineUniformBlocks$OFFSET, fieldValue);
    }

    private static final OfInt maxPerStageDescriptorUpdateAfterBindInlineUniformBlocks$LAYOUT = (OfInt)$LAYOUT.select(groupElement("maxPerStageDescriptorUpdateAfterBindInlineUniformBlocks"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t maxPerStageDescriptorUpdateAfterBindInlineUniformBlocks
     * }
     */
    public static final OfInt maxPerStageDescriptorUpdateAfterBindInlineUniformBlocks$layout() {
        return maxPerStageDescriptorUpdateAfterBindInlineUniformBlocks$LAYOUT;
    }

    private static final long maxPerStageDescriptorUpdateAfterBindInlineUniformBlocks$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t maxPerStageDescriptorUpdateAfterBindInlineUniformBlocks
     * }
     */
    public static final long maxPerStageDescriptorUpdateAfterBindInlineUniformBlocks$offset() {
        return maxPerStageDescriptorUpdateAfterBindInlineUniformBlocks$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t maxPerStageDescriptorUpdateAfterBindInlineUniformBlocks
     * }
     */
    public static int maxPerStageDescriptorUpdateAfterBindInlineUniformBlocks(MemorySegment struct) {
        return struct.get(maxPerStageDescriptorUpdateAfterBindInlineUniformBlocks$LAYOUT, maxPerStageDescriptorUpdateAfterBindInlineUniformBlocks$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t maxPerStageDescriptorUpdateAfterBindInlineUniformBlocks
     * }
     */
    public static void maxPerStageDescriptorUpdateAfterBindInlineUniformBlocks(MemorySegment struct, int fieldValue) {
        struct.set(maxPerStageDescriptorUpdateAfterBindInlineUniformBlocks$LAYOUT, maxPerStageDescriptorUpdateAfterBindInlineUniformBlocks$OFFSET, fieldValue);
    }

    private static final OfInt maxDescriptorSetInlineUniformBlocks$LAYOUT = (OfInt)$LAYOUT.select(groupElement("maxDescriptorSetInlineUniformBlocks"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t maxDescriptorSetInlineUniformBlocks
     * }
     */
    public static final OfInt maxDescriptorSetInlineUniformBlocks$layout() {
        return maxDescriptorSetInlineUniformBlocks$LAYOUT;
    }

    private static final long maxDescriptorSetInlineUniformBlocks$OFFSET = 28;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t maxDescriptorSetInlineUniformBlocks
     * }
     */
    public static final long maxDescriptorSetInlineUniformBlocks$offset() {
        return maxDescriptorSetInlineUniformBlocks$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t maxDescriptorSetInlineUniformBlocks
     * }
     */
    public static int maxDescriptorSetInlineUniformBlocks(MemorySegment struct) {
        return struct.get(maxDescriptorSetInlineUniformBlocks$LAYOUT, maxDescriptorSetInlineUniformBlocks$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t maxDescriptorSetInlineUniformBlocks
     * }
     */
    public static void maxDescriptorSetInlineUniformBlocks(MemorySegment struct, int fieldValue) {
        struct.set(maxDescriptorSetInlineUniformBlocks$LAYOUT, maxDescriptorSetInlineUniformBlocks$OFFSET, fieldValue);
    }

    private static final OfInt maxDescriptorSetUpdateAfterBindInlineUniformBlocks$LAYOUT = (OfInt)$LAYOUT.select(groupElement("maxDescriptorSetUpdateAfterBindInlineUniformBlocks"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t maxDescriptorSetUpdateAfterBindInlineUniformBlocks
     * }
     */
    public static final OfInt maxDescriptorSetUpdateAfterBindInlineUniformBlocks$layout() {
        return maxDescriptorSetUpdateAfterBindInlineUniformBlocks$LAYOUT;
    }

    private static final long maxDescriptorSetUpdateAfterBindInlineUniformBlocks$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t maxDescriptorSetUpdateAfterBindInlineUniformBlocks
     * }
     */
    public static final long maxDescriptorSetUpdateAfterBindInlineUniformBlocks$offset() {
        return maxDescriptorSetUpdateAfterBindInlineUniformBlocks$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t maxDescriptorSetUpdateAfterBindInlineUniformBlocks
     * }
     */
    public static int maxDescriptorSetUpdateAfterBindInlineUniformBlocks(MemorySegment struct) {
        return struct.get(maxDescriptorSetUpdateAfterBindInlineUniformBlocks$LAYOUT, maxDescriptorSetUpdateAfterBindInlineUniformBlocks$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t maxDescriptorSetUpdateAfterBindInlineUniformBlocks
     * }
     */
    public static void maxDescriptorSetUpdateAfterBindInlineUniformBlocks(MemorySegment struct, int fieldValue) {
        struct.set(maxDescriptorSetUpdateAfterBindInlineUniformBlocks$LAYOUT, maxDescriptorSetUpdateAfterBindInlineUniformBlocks$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

