// Generated by jextract

package org.vulkan;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct VkPhysicalDeviceExtendedDynamicState2FeaturesEXT {
 *     VkStructureType sType;
 *     void *pNext;
 *     VkBool32 extendedDynamicState2;
 *     VkBool32 extendedDynamicState2LogicOp;
 *     VkBool32 extendedDynamicState2PatchControlPoints;
 * }
 * }
 */
public class VkPhysicalDeviceExtendedDynamicState2FeaturesEXT {

    VkPhysicalDeviceExtendedDynamicState2FeaturesEXT() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        vulkan_h.C_INT.withName("sType"),
        MemoryLayout.paddingLayout(4),
        vulkan_h.C_POINTER.withName("pNext"),
        vulkan_h.C_INT.withName("extendedDynamicState2"),
        vulkan_h.C_INT.withName("extendedDynamicState2LogicOp"),
        vulkan_h.C_INT.withName("extendedDynamicState2PatchControlPoints"),
        MemoryLayout.paddingLayout(4)
    ).withName("VkPhysicalDeviceExtendedDynamicState2FeaturesEXT");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt sType$LAYOUT = (OfInt)$LAYOUT.select(groupElement("sType"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final OfInt sType$layout() {
        return sType$LAYOUT;
    }

    private static final long sType$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final long sType$offset() {
        return sType$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static int sType(MemorySegment struct) {
        return struct.get(sType$LAYOUT, sType$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static void sType(MemorySegment struct, int fieldValue) {
        struct.set(sType$LAYOUT, sType$OFFSET, fieldValue);
    }

    private static final AddressLayout pNext$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pNext"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * void *pNext
     * }
     */
    public static final AddressLayout pNext$layout() {
        return pNext$LAYOUT;
    }

    private static final long pNext$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * void *pNext
     * }
     */
    public static final long pNext$offset() {
        return pNext$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * void *pNext
     * }
     */
    public static MemorySegment pNext(MemorySegment struct) {
        return struct.get(pNext$LAYOUT, pNext$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * void *pNext
     * }
     */
    public static void pNext(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pNext$LAYOUT, pNext$OFFSET, fieldValue);
    }

    private static final OfInt extendedDynamicState2$LAYOUT = (OfInt)$LAYOUT.select(groupElement("extendedDynamicState2"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkBool32 extendedDynamicState2
     * }
     */
    public static final OfInt extendedDynamicState2$layout() {
        return extendedDynamicState2$LAYOUT;
    }

    private static final long extendedDynamicState2$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkBool32 extendedDynamicState2
     * }
     */
    public static final long extendedDynamicState2$offset() {
        return extendedDynamicState2$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkBool32 extendedDynamicState2
     * }
     */
    public static int extendedDynamicState2(MemorySegment struct) {
        return struct.get(extendedDynamicState2$LAYOUT, extendedDynamicState2$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkBool32 extendedDynamicState2
     * }
     */
    public static void extendedDynamicState2(MemorySegment struct, int fieldValue) {
        struct.set(extendedDynamicState2$LAYOUT, extendedDynamicState2$OFFSET, fieldValue);
    }

    private static final OfInt extendedDynamicState2LogicOp$LAYOUT = (OfInt)$LAYOUT.select(groupElement("extendedDynamicState2LogicOp"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkBool32 extendedDynamicState2LogicOp
     * }
     */
    public static final OfInt extendedDynamicState2LogicOp$layout() {
        return extendedDynamicState2LogicOp$LAYOUT;
    }

    private static final long extendedDynamicState2LogicOp$OFFSET = 20;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkBool32 extendedDynamicState2LogicOp
     * }
     */
    public static final long extendedDynamicState2LogicOp$offset() {
        return extendedDynamicState2LogicOp$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkBool32 extendedDynamicState2LogicOp
     * }
     */
    public static int extendedDynamicState2LogicOp(MemorySegment struct) {
        return struct.get(extendedDynamicState2LogicOp$LAYOUT, extendedDynamicState2LogicOp$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkBool32 extendedDynamicState2LogicOp
     * }
     */
    public static void extendedDynamicState2LogicOp(MemorySegment struct, int fieldValue) {
        struct.set(extendedDynamicState2LogicOp$LAYOUT, extendedDynamicState2LogicOp$OFFSET, fieldValue);
    }

    private static final OfInt extendedDynamicState2PatchControlPoints$LAYOUT = (OfInt)$LAYOUT.select(groupElement("extendedDynamicState2PatchControlPoints"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkBool32 extendedDynamicState2PatchControlPoints
     * }
     */
    public static final OfInt extendedDynamicState2PatchControlPoints$layout() {
        return extendedDynamicState2PatchControlPoints$LAYOUT;
    }

    private static final long extendedDynamicState2PatchControlPoints$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkBool32 extendedDynamicState2PatchControlPoints
     * }
     */
    public static final long extendedDynamicState2PatchControlPoints$offset() {
        return extendedDynamicState2PatchControlPoints$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkBool32 extendedDynamicState2PatchControlPoints
     * }
     */
    public static int extendedDynamicState2PatchControlPoints(MemorySegment struct) {
        return struct.get(extendedDynamicState2PatchControlPoints$LAYOUT, extendedDynamicState2PatchControlPoints$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkBool32 extendedDynamicState2PatchControlPoints
     * }
     */
    public static void extendedDynamicState2PatchControlPoints(MemorySegment struct, int fieldValue) {
        struct.set(extendedDynamicState2PatchControlPoints$LAYOUT, extendedDynamicState2PatchControlPoints$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

