// Generated by jextract

package org.vulkan;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct VkPhysicalDeviceSampleLocationsPropertiesEXT {
 *     VkStructureType sType;
 *     void *pNext;
 *     VkSampleCountFlags sampleLocationSampleCounts;
 *     VkExtent2D maxSampleLocationGridSize;
 *     float sampleLocationCoordinateRange[2];
 *     uint32_t sampleLocationSubPixelBits;
 *     VkBool32 variableSampleLocations;
 * }
 * }
 */
public class VkPhysicalDeviceSampleLocationsPropertiesEXT {

    VkPhysicalDeviceSampleLocationsPropertiesEXT() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        vulkan_h.C_INT.withName("sType"),
        MemoryLayout.paddingLayout(4),
        vulkan_h.C_POINTER.withName("pNext"),
        vulkan_h.C_INT.withName("sampleLocationSampleCounts"),
        VkExtent2D.layout().withName("maxSampleLocationGridSize"),
        MemoryLayout.sequenceLayout(2, vulkan_h.C_FLOAT).withName("sampleLocationCoordinateRange"),
        vulkan_h.C_INT.withName("sampleLocationSubPixelBits"),
        vulkan_h.C_INT.withName("variableSampleLocations"),
        MemoryLayout.paddingLayout(4)
    ).withName("VkPhysicalDeviceSampleLocationsPropertiesEXT");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt sType$LAYOUT = (OfInt)$LAYOUT.select(groupElement("sType"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final OfInt sType$layout() {
        return sType$LAYOUT;
    }

    private static final long sType$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final long sType$offset() {
        return sType$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static int sType(MemorySegment struct) {
        return struct.get(sType$LAYOUT, sType$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static void sType(MemorySegment struct, int fieldValue) {
        struct.set(sType$LAYOUT, sType$OFFSET, fieldValue);
    }

    private static final AddressLayout pNext$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pNext"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * void *pNext
     * }
     */
    public static final AddressLayout pNext$layout() {
        return pNext$LAYOUT;
    }

    private static final long pNext$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * void *pNext
     * }
     */
    public static final long pNext$offset() {
        return pNext$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * void *pNext
     * }
     */
    public static MemorySegment pNext(MemorySegment struct) {
        return struct.get(pNext$LAYOUT, pNext$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * void *pNext
     * }
     */
    public static void pNext(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pNext$LAYOUT, pNext$OFFSET, fieldValue);
    }

    private static final OfInt sampleLocationSampleCounts$LAYOUT = (OfInt)$LAYOUT.select(groupElement("sampleLocationSampleCounts"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkSampleCountFlags sampleLocationSampleCounts
     * }
     */
    public static final OfInt sampleLocationSampleCounts$layout() {
        return sampleLocationSampleCounts$LAYOUT;
    }

    private static final long sampleLocationSampleCounts$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkSampleCountFlags sampleLocationSampleCounts
     * }
     */
    public static final long sampleLocationSampleCounts$offset() {
        return sampleLocationSampleCounts$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkSampleCountFlags sampleLocationSampleCounts
     * }
     */
    public static int sampleLocationSampleCounts(MemorySegment struct) {
        return struct.get(sampleLocationSampleCounts$LAYOUT, sampleLocationSampleCounts$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkSampleCountFlags sampleLocationSampleCounts
     * }
     */
    public static void sampleLocationSampleCounts(MemorySegment struct, int fieldValue) {
        struct.set(sampleLocationSampleCounts$LAYOUT, sampleLocationSampleCounts$OFFSET, fieldValue);
    }

    private static final GroupLayout maxSampleLocationGridSize$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("maxSampleLocationGridSize"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkExtent2D maxSampleLocationGridSize
     * }
     */
    public static final GroupLayout maxSampleLocationGridSize$layout() {
        return maxSampleLocationGridSize$LAYOUT;
    }

    private static final long maxSampleLocationGridSize$OFFSET = 20;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkExtent2D maxSampleLocationGridSize
     * }
     */
    public static final long maxSampleLocationGridSize$offset() {
        return maxSampleLocationGridSize$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkExtent2D maxSampleLocationGridSize
     * }
     */
    public static MemorySegment maxSampleLocationGridSize(MemorySegment struct) {
        return struct.asSlice(maxSampleLocationGridSize$OFFSET, maxSampleLocationGridSize$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkExtent2D maxSampleLocationGridSize
     * }
     */
    public static void maxSampleLocationGridSize(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, maxSampleLocationGridSize$OFFSET, maxSampleLocationGridSize$LAYOUT.byteSize());
    }

    private static final SequenceLayout sampleLocationCoordinateRange$LAYOUT = (SequenceLayout)$LAYOUT.select(groupElement("sampleLocationCoordinateRange"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * float sampleLocationCoordinateRange[2]
     * }
     */
    public static final SequenceLayout sampleLocationCoordinateRange$layout() {
        return sampleLocationCoordinateRange$LAYOUT;
    }

    private static final long sampleLocationCoordinateRange$OFFSET = 28;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * float sampleLocationCoordinateRange[2]
     * }
     */
    public static final long sampleLocationCoordinateRange$offset() {
        return sampleLocationCoordinateRange$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * float sampleLocationCoordinateRange[2]
     * }
     */
    public static MemorySegment sampleLocationCoordinateRange(MemorySegment struct) {
        return struct.asSlice(sampleLocationCoordinateRange$OFFSET, sampleLocationCoordinateRange$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * float sampleLocationCoordinateRange[2]
     * }
     */
    public static void sampleLocationCoordinateRange(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, sampleLocationCoordinateRange$OFFSET, sampleLocationCoordinateRange$LAYOUT.byteSize());
    }

    private static long[] sampleLocationCoordinateRange$DIMS = { 2 };

    /**
     * Dimensions for array field:
     * {@snippet lang=c :
     * float sampleLocationCoordinateRange[2]
     * }
     */
    public static long[] sampleLocationCoordinateRange$dimensions() {
        return sampleLocationCoordinateRange$DIMS;
    }
    private static final VarHandle sampleLocationCoordinateRange$ELEM_HANDLE = sampleLocationCoordinateRange$LAYOUT.varHandle(sequenceElement());

    /**
     * Indexed getter for field:
     * {@snippet lang=c :
     * float sampleLocationCoordinateRange[2]
     * }
     */
    public static float sampleLocationCoordinateRange(MemorySegment struct, long index0) {
        return (float)sampleLocationCoordinateRange$ELEM_HANDLE.get(struct, 0L, index0);
    }

    /**
     * Indexed setter for field:
     * {@snippet lang=c :
     * float sampleLocationCoordinateRange[2]
     * }
     */
    public static void sampleLocationCoordinateRange(MemorySegment struct, long index0, float fieldValue) {
        sampleLocationCoordinateRange$ELEM_HANDLE.set(struct, 0L, index0, fieldValue);
    }

    private static final OfInt sampleLocationSubPixelBits$LAYOUT = (OfInt)$LAYOUT.select(groupElement("sampleLocationSubPixelBits"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t sampleLocationSubPixelBits
     * }
     */
    public static final OfInt sampleLocationSubPixelBits$layout() {
        return sampleLocationSubPixelBits$LAYOUT;
    }

    private static final long sampleLocationSubPixelBits$OFFSET = 36;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t sampleLocationSubPixelBits
     * }
     */
    public static final long sampleLocationSubPixelBits$offset() {
        return sampleLocationSubPixelBits$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t sampleLocationSubPixelBits
     * }
     */
    public static int sampleLocationSubPixelBits(MemorySegment struct) {
        return struct.get(sampleLocationSubPixelBits$LAYOUT, sampleLocationSubPixelBits$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t sampleLocationSubPixelBits
     * }
     */
    public static void sampleLocationSubPixelBits(MemorySegment struct, int fieldValue) {
        struct.set(sampleLocationSubPixelBits$LAYOUT, sampleLocationSubPixelBits$OFFSET, fieldValue);
    }

    private static final OfInt variableSampleLocations$LAYOUT = (OfInt)$LAYOUT.select(groupElement("variableSampleLocations"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkBool32 variableSampleLocations
     * }
     */
    public static final OfInt variableSampleLocations$layout() {
        return variableSampleLocations$LAYOUT;
    }

    private static final long variableSampleLocations$OFFSET = 40;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkBool32 variableSampleLocations
     * }
     */
    public static final long variableSampleLocations$offset() {
        return variableSampleLocations$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkBool32 variableSampleLocations
     * }
     */
    public static int variableSampleLocations(MemorySegment struct) {
        return struct.get(variableSampleLocations$LAYOUT, variableSampleLocations$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkBool32 variableSampleLocations
     * }
     */
    public static void variableSampleLocations(MemorySegment struct, int fieldValue) {
        struct.set(variableSampleLocations$LAYOUT, variableSampleLocations$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

