// Generated by jextract

package org.vulkan;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct VkPhysicalDevicePipelineRobustnessPropertiesEXT {
 *     VkStructureType sType;
 *     void *pNext;
 *     VkPipelineRobustnessBufferBehaviorEXT defaultRobustnessStorageBuffers;
 *     VkPipelineRobustnessBufferBehaviorEXT defaultRobustnessUniformBuffers;
 *     VkPipelineRobustnessBufferBehaviorEXT defaultRobustnessVertexInputs;
 *     VkPipelineRobustnessImageBehaviorEXT defaultRobustnessImages;
 * }
 * }
 */
public class VkPhysicalDevicePipelineRobustnessPropertiesEXT {

    VkPhysicalDevicePipelineRobustnessPropertiesEXT() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        vulkan_h.C_INT.withName("sType"),
        MemoryLayout.paddingLayout(4),
        vulkan_h.C_POINTER.withName("pNext"),
        vulkan_h.C_INT.withName("defaultRobustnessStorageBuffers"),
        vulkan_h.C_INT.withName("defaultRobustnessUniformBuffers"),
        vulkan_h.C_INT.withName("defaultRobustnessVertexInputs"),
        vulkan_h.C_INT.withName("defaultRobustnessImages")
    ).withName("VkPhysicalDevicePipelineRobustnessPropertiesEXT");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt sType$LAYOUT = (OfInt)$LAYOUT.select(groupElement("sType"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final OfInt sType$layout() {
        return sType$LAYOUT;
    }

    private static final long sType$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final long sType$offset() {
        return sType$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static int sType(MemorySegment struct) {
        return struct.get(sType$LAYOUT, sType$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static void sType(MemorySegment struct, int fieldValue) {
        struct.set(sType$LAYOUT, sType$OFFSET, fieldValue);
    }

    private static final AddressLayout pNext$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pNext"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * void *pNext
     * }
     */
    public static final AddressLayout pNext$layout() {
        return pNext$LAYOUT;
    }

    private static final long pNext$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * void *pNext
     * }
     */
    public static final long pNext$offset() {
        return pNext$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * void *pNext
     * }
     */
    public static MemorySegment pNext(MemorySegment struct) {
        return struct.get(pNext$LAYOUT, pNext$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * void *pNext
     * }
     */
    public static void pNext(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pNext$LAYOUT, pNext$OFFSET, fieldValue);
    }

    private static final OfInt defaultRobustnessStorageBuffers$LAYOUT = (OfInt)$LAYOUT.select(groupElement("defaultRobustnessStorageBuffers"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkPipelineRobustnessBufferBehaviorEXT defaultRobustnessStorageBuffers
     * }
     */
    public static final OfInt defaultRobustnessStorageBuffers$layout() {
        return defaultRobustnessStorageBuffers$LAYOUT;
    }

    private static final long defaultRobustnessStorageBuffers$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkPipelineRobustnessBufferBehaviorEXT defaultRobustnessStorageBuffers
     * }
     */
    public static final long defaultRobustnessStorageBuffers$offset() {
        return defaultRobustnessStorageBuffers$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkPipelineRobustnessBufferBehaviorEXT defaultRobustnessStorageBuffers
     * }
     */
    public static int defaultRobustnessStorageBuffers(MemorySegment struct) {
        return struct.get(defaultRobustnessStorageBuffers$LAYOUT, defaultRobustnessStorageBuffers$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkPipelineRobustnessBufferBehaviorEXT defaultRobustnessStorageBuffers
     * }
     */
    public static void defaultRobustnessStorageBuffers(MemorySegment struct, int fieldValue) {
        struct.set(defaultRobustnessStorageBuffers$LAYOUT, defaultRobustnessStorageBuffers$OFFSET, fieldValue);
    }

    private static final OfInt defaultRobustnessUniformBuffers$LAYOUT = (OfInt)$LAYOUT.select(groupElement("defaultRobustnessUniformBuffers"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkPipelineRobustnessBufferBehaviorEXT defaultRobustnessUniformBuffers
     * }
     */
    public static final OfInt defaultRobustnessUniformBuffers$layout() {
        return defaultRobustnessUniformBuffers$LAYOUT;
    }

    private static final long defaultRobustnessUniformBuffers$OFFSET = 20;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkPipelineRobustnessBufferBehaviorEXT defaultRobustnessUniformBuffers
     * }
     */
    public static final long defaultRobustnessUniformBuffers$offset() {
        return defaultRobustnessUniformBuffers$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkPipelineRobustnessBufferBehaviorEXT defaultRobustnessUniformBuffers
     * }
     */
    public static int defaultRobustnessUniformBuffers(MemorySegment struct) {
        return struct.get(defaultRobustnessUniformBuffers$LAYOUT, defaultRobustnessUniformBuffers$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkPipelineRobustnessBufferBehaviorEXT defaultRobustnessUniformBuffers
     * }
     */
    public static void defaultRobustnessUniformBuffers(MemorySegment struct, int fieldValue) {
        struct.set(defaultRobustnessUniformBuffers$LAYOUT, defaultRobustnessUniformBuffers$OFFSET, fieldValue);
    }

    private static final OfInt defaultRobustnessVertexInputs$LAYOUT = (OfInt)$LAYOUT.select(groupElement("defaultRobustnessVertexInputs"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkPipelineRobustnessBufferBehaviorEXT defaultRobustnessVertexInputs
     * }
     */
    public static final OfInt defaultRobustnessVertexInputs$layout() {
        return defaultRobustnessVertexInputs$LAYOUT;
    }

    private static final long defaultRobustnessVertexInputs$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkPipelineRobustnessBufferBehaviorEXT defaultRobustnessVertexInputs
     * }
     */
    public static final long defaultRobustnessVertexInputs$offset() {
        return defaultRobustnessVertexInputs$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkPipelineRobustnessBufferBehaviorEXT defaultRobustnessVertexInputs
     * }
     */
    public static int defaultRobustnessVertexInputs(MemorySegment struct) {
        return struct.get(defaultRobustnessVertexInputs$LAYOUT, defaultRobustnessVertexInputs$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkPipelineRobustnessBufferBehaviorEXT defaultRobustnessVertexInputs
     * }
     */
    public static void defaultRobustnessVertexInputs(MemorySegment struct, int fieldValue) {
        struct.set(defaultRobustnessVertexInputs$LAYOUT, defaultRobustnessVertexInputs$OFFSET, fieldValue);
    }

    private static final OfInt defaultRobustnessImages$LAYOUT = (OfInt)$LAYOUT.select(groupElement("defaultRobustnessImages"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkPipelineRobustnessImageBehaviorEXT defaultRobustnessImages
     * }
     */
    public static final OfInt defaultRobustnessImages$layout() {
        return defaultRobustnessImages$LAYOUT;
    }

    private static final long defaultRobustnessImages$OFFSET = 28;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkPipelineRobustnessImageBehaviorEXT defaultRobustnessImages
     * }
     */
    public static final long defaultRobustnessImages$offset() {
        return defaultRobustnessImages$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkPipelineRobustnessImageBehaviorEXT defaultRobustnessImages
     * }
     */
    public static int defaultRobustnessImages(MemorySegment struct) {
        return struct.get(defaultRobustnessImages$LAYOUT, defaultRobustnessImages$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkPipelineRobustnessImageBehaviorEXT defaultRobustnessImages
     * }
     */
    public static void defaultRobustnessImages(MemorySegment struct, int fieldValue) {
        struct.set(defaultRobustnessImages$LAYOUT, defaultRobustnessImages$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

