// Generated by jextract

package org.vulkan;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct VkPhysicalDeviceShaderIntegerDotProductProperties {
 *     VkStructureType sType;
 *     void *pNext;
 *     VkBool32 integerDotProduct8BitUnsignedAccelerated;
 *     VkBool32 integerDotProduct8BitSignedAccelerated;
 *     VkBool32 integerDotProduct8BitMixedSignednessAccelerated;
 *     VkBool32 integerDotProduct4x8BitPackedUnsignedAccelerated;
 *     VkBool32 integerDotProduct4x8BitPackedSignedAccelerated;
 *     VkBool32 integerDotProduct4x8BitPackedMixedSignednessAccelerated;
 *     VkBool32 integerDotProduct16BitUnsignedAccelerated;
 *     VkBool32 integerDotProduct16BitSignedAccelerated;
 *     VkBool32 integerDotProduct16BitMixedSignednessAccelerated;
 *     VkBool32 integerDotProduct32BitUnsignedAccelerated;
 *     VkBool32 integerDotProduct32BitSignedAccelerated;
 *     VkBool32 integerDotProduct32BitMixedSignednessAccelerated;
 *     VkBool32 integerDotProduct64BitUnsignedAccelerated;
 *     VkBool32 integerDotProduct64BitSignedAccelerated;
 *     VkBool32 integerDotProduct64BitMixedSignednessAccelerated;
 *     VkBool32 integerDotProductAccumulatingSaturating8BitUnsignedAccelerated;
 *     VkBool32 integerDotProductAccumulatingSaturating8BitSignedAccelerated;
 *     VkBool32 integerDotProductAccumulatingSaturating8BitMixedSignednessAccelerated;
 *     VkBool32 integerDotProductAccumulatingSaturating4x8BitPackedUnsignedAccelerated;
 *     VkBool32 integerDotProductAccumulatingSaturating4x8BitPackedSignedAccelerated;
 *     VkBool32 integerDotProductAccumulatingSaturating4x8BitPackedMixedSignednessAccelerated;
 *     VkBool32 integerDotProductAccumulatingSaturating16BitUnsignedAccelerated;
 *     VkBool32 integerDotProductAccumulatingSaturating16BitSignedAccelerated;
 *     VkBool32 integerDotProductAccumulatingSaturating16BitMixedSignednessAccelerated;
 *     VkBool32 integerDotProductAccumulatingSaturating32BitUnsignedAccelerated;
 *     VkBool32 integerDotProductAccumulatingSaturating32BitSignedAccelerated;
 *     VkBool32 integerDotProductAccumulatingSaturating32BitMixedSignednessAccelerated;
 *     VkBool32 integerDotProductAccumulatingSaturating64BitUnsignedAccelerated;
 *     VkBool32 integerDotProductAccumulatingSaturating64BitSignedAccelerated;
 *     VkBool32 integerDotProductAccumulatingSaturating64BitMixedSignednessAccelerated;
 * }
 * }
 */
public class VkPhysicalDeviceShaderIntegerDotProductProperties {

    VkPhysicalDeviceShaderIntegerDotProductProperties() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        vulkan_h.C_INT.withName("sType"),
        MemoryLayout.paddingLayout(4),
        vulkan_h.C_POINTER.withName("pNext"),
        vulkan_h.C_INT.withName("integerDotProduct8BitUnsignedAccelerated"),
        vulkan_h.C_INT.withName("integerDotProduct8BitSignedAccelerated"),
        vulkan_h.C_INT.withName("integerDotProduct8BitMixedSignednessAccelerated"),
        vulkan_h.C_INT.withName("integerDotProduct4x8BitPackedUnsignedAccelerated"),
        vulkan_h.C_INT.withName("integerDotProduct4x8BitPackedSignedAccelerated"),
        vulkan_h.C_INT.withName("integerDotProduct4x8BitPackedMixedSignednessAccelerated"),
        vulkan_h.C_INT.withName("integerDotProduct16BitUnsignedAccelerated"),
        vulkan_h.C_INT.withName("integerDotProduct16BitSignedAccelerated"),
        vulkan_h.C_INT.withName("integerDotProduct16BitMixedSignednessAccelerated"),
        vulkan_h.C_INT.withName("integerDotProduct32BitUnsignedAccelerated"),
        vulkan_h.C_INT.withName("integerDotProduct32BitSignedAccelerated"),
        vulkan_h.C_INT.withName("integerDotProduct32BitMixedSignednessAccelerated"),
        vulkan_h.C_INT.withName("integerDotProduct64BitUnsignedAccelerated"),
        vulkan_h.C_INT.withName("integerDotProduct64BitSignedAccelerated"),
        vulkan_h.C_INT.withName("integerDotProduct64BitMixedSignednessAccelerated"),
        vulkan_h.C_INT.withName("integerDotProductAccumulatingSaturating8BitUnsignedAccelerated"),
        vulkan_h.C_INT.withName("integerDotProductAccumulatingSaturating8BitSignedAccelerated"),
        vulkan_h.C_INT.withName("integerDotProductAccumulatingSaturating8BitMixedSignednessAccelerated"),
        vulkan_h.C_INT.withName("integerDotProductAccumulatingSaturating4x8BitPackedUnsignedAccelerated"),
        vulkan_h.C_INT.withName("integerDotProductAccumulatingSaturating4x8BitPackedSignedAccelerated"),
        vulkan_h.C_INT.withName("integerDotProductAccumulatingSaturating4x8BitPackedMixedSignednessAccelerated"),
        vulkan_h.C_INT.withName("integerDotProductAccumulatingSaturating16BitUnsignedAccelerated"),
        vulkan_h.C_INT.withName("integerDotProductAccumulatingSaturating16BitSignedAccelerated"),
        vulkan_h.C_INT.withName("integerDotProductAccumulatingSaturating16BitMixedSignednessAccelerated"),
        vulkan_h.C_INT.withName("integerDotProductAccumulatingSaturating32BitUnsignedAccelerated"),
        vulkan_h.C_INT.withName("integerDotProductAccumulatingSaturating32BitSignedAccelerated"),
        vulkan_h.C_INT.withName("integerDotProductAccumulatingSaturating32BitMixedSignednessAccelerated"),
        vulkan_h.C_INT.withName("integerDotProductAccumulatingSaturating64BitUnsignedAccelerated"),
        vulkan_h.C_INT.withName("integerDotProductAccumulatingSaturating64BitSignedAccelerated"),
        vulkan_h.C_INT.withName("integerDotProductAccumulatingSaturating64BitMixedSignednessAccelerated")
    ).withName("VkPhysicalDeviceShaderIntegerDotProductProperties");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt sType$LAYOUT = (OfInt)$LAYOUT.select(groupElement("sType"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final OfInt sType$layout() {
        return sType$LAYOUT;
    }

    private static final long sType$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final long sType$offset() {
        return sType$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static int sType(MemorySegment struct) {
        return struct.get(sType$LAYOUT, sType$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static void sType(MemorySegment struct, int fieldValue) {
        struct.set(sType$LAYOUT, sType$OFFSET, fieldValue);
    }

    private static final AddressLayout pNext$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pNext"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * void *pNext
     * }
     */
    public static final AddressLayout pNext$layout() {
        return pNext$LAYOUT;
    }

    private static final long pNext$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * void *pNext
     * }
     */
    public static final long pNext$offset() {
        return pNext$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * void *pNext
     * }
     */
    public static MemorySegment pNext(MemorySegment struct) {
        return struct.get(pNext$LAYOUT, pNext$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * void *pNext
     * }
     */
    public static void pNext(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pNext$LAYOUT, pNext$OFFSET, fieldValue);
    }

    private static final OfInt integerDotProduct8BitUnsignedAccelerated$LAYOUT = (OfInt)$LAYOUT.select(groupElement("integerDotProduct8BitUnsignedAccelerated"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProduct8BitUnsignedAccelerated
     * }
     */
    public static final OfInt integerDotProduct8BitUnsignedAccelerated$layout() {
        return integerDotProduct8BitUnsignedAccelerated$LAYOUT;
    }

    private static final long integerDotProduct8BitUnsignedAccelerated$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProduct8BitUnsignedAccelerated
     * }
     */
    public static final long integerDotProduct8BitUnsignedAccelerated$offset() {
        return integerDotProduct8BitUnsignedAccelerated$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProduct8BitUnsignedAccelerated
     * }
     */
    public static int integerDotProduct8BitUnsignedAccelerated(MemorySegment struct) {
        return struct.get(integerDotProduct8BitUnsignedAccelerated$LAYOUT, integerDotProduct8BitUnsignedAccelerated$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProduct8BitUnsignedAccelerated
     * }
     */
    public static void integerDotProduct8BitUnsignedAccelerated(MemorySegment struct, int fieldValue) {
        struct.set(integerDotProduct8BitUnsignedAccelerated$LAYOUT, integerDotProduct8BitUnsignedAccelerated$OFFSET, fieldValue);
    }

    private static final OfInt integerDotProduct8BitSignedAccelerated$LAYOUT = (OfInt)$LAYOUT.select(groupElement("integerDotProduct8BitSignedAccelerated"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProduct8BitSignedAccelerated
     * }
     */
    public static final OfInt integerDotProduct8BitSignedAccelerated$layout() {
        return integerDotProduct8BitSignedAccelerated$LAYOUT;
    }

    private static final long integerDotProduct8BitSignedAccelerated$OFFSET = 20;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProduct8BitSignedAccelerated
     * }
     */
    public static final long integerDotProduct8BitSignedAccelerated$offset() {
        return integerDotProduct8BitSignedAccelerated$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProduct8BitSignedAccelerated
     * }
     */
    public static int integerDotProduct8BitSignedAccelerated(MemorySegment struct) {
        return struct.get(integerDotProduct8BitSignedAccelerated$LAYOUT, integerDotProduct8BitSignedAccelerated$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProduct8BitSignedAccelerated
     * }
     */
    public static void integerDotProduct8BitSignedAccelerated(MemorySegment struct, int fieldValue) {
        struct.set(integerDotProduct8BitSignedAccelerated$LAYOUT, integerDotProduct8BitSignedAccelerated$OFFSET, fieldValue);
    }

    private static final OfInt integerDotProduct8BitMixedSignednessAccelerated$LAYOUT = (OfInt)$LAYOUT.select(groupElement("integerDotProduct8BitMixedSignednessAccelerated"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProduct8BitMixedSignednessAccelerated
     * }
     */
    public static final OfInt integerDotProduct8BitMixedSignednessAccelerated$layout() {
        return integerDotProduct8BitMixedSignednessAccelerated$LAYOUT;
    }

    private static final long integerDotProduct8BitMixedSignednessAccelerated$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProduct8BitMixedSignednessAccelerated
     * }
     */
    public static final long integerDotProduct8BitMixedSignednessAccelerated$offset() {
        return integerDotProduct8BitMixedSignednessAccelerated$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProduct8BitMixedSignednessAccelerated
     * }
     */
    public static int integerDotProduct8BitMixedSignednessAccelerated(MemorySegment struct) {
        return struct.get(integerDotProduct8BitMixedSignednessAccelerated$LAYOUT, integerDotProduct8BitMixedSignednessAccelerated$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProduct8BitMixedSignednessAccelerated
     * }
     */
    public static void integerDotProduct8BitMixedSignednessAccelerated(MemorySegment struct, int fieldValue) {
        struct.set(integerDotProduct8BitMixedSignednessAccelerated$LAYOUT, integerDotProduct8BitMixedSignednessAccelerated$OFFSET, fieldValue);
    }

    private static final OfInt integerDotProduct4x8BitPackedUnsignedAccelerated$LAYOUT = (OfInt)$LAYOUT.select(groupElement("integerDotProduct4x8BitPackedUnsignedAccelerated"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProduct4x8BitPackedUnsignedAccelerated
     * }
     */
    public static final OfInt integerDotProduct4x8BitPackedUnsignedAccelerated$layout() {
        return integerDotProduct4x8BitPackedUnsignedAccelerated$LAYOUT;
    }

    private static final long integerDotProduct4x8BitPackedUnsignedAccelerated$OFFSET = 28;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProduct4x8BitPackedUnsignedAccelerated
     * }
     */
    public static final long integerDotProduct4x8BitPackedUnsignedAccelerated$offset() {
        return integerDotProduct4x8BitPackedUnsignedAccelerated$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProduct4x8BitPackedUnsignedAccelerated
     * }
     */
    public static int integerDotProduct4x8BitPackedUnsignedAccelerated(MemorySegment struct) {
        return struct.get(integerDotProduct4x8BitPackedUnsignedAccelerated$LAYOUT, integerDotProduct4x8BitPackedUnsignedAccelerated$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProduct4x8BitPackedUnsignedAccelerated
     * }
     */
    public static void integerDotProduct4x8BitPackedUnsignedAccelerated(MemorySegment struct, int fieldValue) {
        struct.set(integerDotProduct4x8BitPackedUnsignedAccelerated$LAYOUT, integerDotProduct4x8BitPackedUnsignedAccelerated$OFFSET, fieldValue);
    }

    private static final OfInt integerDotProduct4x8BitPackedSignedAccelerated$LAYOUT = (OfInt)$LAYOUT.select(groupElement("integerDotProduct4x8BitPackedSignedAccelerated"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProduct4x8BitPackedSignedAccelerated
     * }
     */
    public static final OfInt integerDotProduct4x8BitPackedSignedAccelerated$layout() {
        return integerDotProduct4x8BitPackedSignedAccelerated$LAYOUT;
    }

    private static final long integerDotProduct4x8BitPackedSignedAccelerated$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProduct4x8BitPackedSignedAccelerated
     * }
     */
    public static final long integerDotProduct4x8BitPackedSignedAccelerated$offset() {
        return integerDotProduct4x8BitPackedSignedAccelerated$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProduct4x8BitPackedSignedAccelerated
     * }
     */
    public static int integerDotProduct4x8BitPackedSignedAccelerated(MemorySegment struct) {
        return struct.get(integerDotProduct4x8BitPackedSignedAccelerated$LAYOUT, integerDotProduct4x8BitPackedSignedAccelerated$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProduct4x8BitPackedSignedAccelerated
     * }
     */
    public static void integerDotProduct4x8BitPackedSignedAccelerated(MemorySegment struct, int fieldValue) {
        struct.set(integerDotProduct4x8BitPackedSignedAccelerated$LAYOUT, integerDotProduct4x8BitPackedSignedAccelerated$OFFSET, fieldValue);
    }

    private static final OfInt integerDotProduct4x8BitPackedMixedSignednessAccelerated$LAYOUT = (OfInt)$LAYOUT.select(groupElement("integerDotProduct4x8BitPackedMixedSignednessAccelerated"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProduct4x8BitPackedMixedSignednessAccelerated
     * }
     */
    public static final OfInt integerDotProduct4x8BitPackedMixedSignednessAccelerated$layout() {
        return integerDotProduct4x8BitPackedMixedSignednessAccelerated$LAYOUT;
    }

    private static final long integerDotProduct4x8BitPackedMixedSignednessAccelerated$OFFSET = 36;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProduct4x8BitPackedMixedSignednessAccelerated
     * }
     */
    public static final long integerDotProduct4x8BitPackedMixedSignednessAccelerated$offset() {
        return integerDotProduct4x8BitPackedMixedSignednessAccelerated$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProduct4x8BitPackedMixedSignednessAccelerated
     * }
     */
    public static int integerDotProduct4x8BitPackedMixedSignednessAccelerated(MemorySegment struct) {
        return struct.get(integerDotProduct4x8BitPackedMixedSignednessAccelerated$LAYOUT, integerDotProduct4x8BitPackedMixedSignednessAccelerated$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProduct4x8BitPackedMixedSignednessAccelerated
     * }
     */
    public static void integerDotProduct4x8BitPackedMixedSignednessAccelerated(MemorySegment struct, int fieldValue) {
        struct.set(integerDotProduct4x8BitPackedMixedSignednessAccelerated$LAYOUT, integerDotProduct4x8BitPackedMixedSignednessAccelerated$OFFSET, fieldValue);
    }

    private static final OfInt integerDotProduct16BitUnsignedAccelerated$LAYOUT = (OfInt)$LAYOUT.select(groupElement("integerDotProduct16BitUnsignedAccelerated"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProduct16BitUnsignedAccelerated
     * }
     */
    public static final OfInt integerDotProduct16BitUnsignedAccelerated$layout() {
        return integerDotProduct16BitUnsignedAccelerated$LAYOUT;
    }

    private static final long integerDotProduct16BitUnsignedAccelerated$OFFSET = 40;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProduct16BitUnsignedAccelerated
     * }
     */
    public static final long integerDotProduct16BitUnsignedAccelerated$offset() {
        return integerDotProduct16BitUnsignedAccelerated$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProduct16BitUnsignedAccelerated
     * }
     */
    public static int integerDotProduct16BitUnsignedAccelerated(MemorySegment struct) {
        return struct.get(integerDotProduct16BitUnsignedAccelerated$LAYOUT, integerDotProduct16BitUnsignedAccelerated$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProduct16BitUnsignedAccelerated
     * }
     */
    public static void integerDotProduct16BitUnsignedAccelerated(MemorySegment struct, int fieldValue) {
        struct.set(integerDotProduct16BitUnsignedAccelerated$LAYOUT, integerDotProduct16BitUnsignedAccelerated$OFFSET, fieldValue);
    }

    private static final OfInt integerDotProduct16BitSignedAccelerated$LAYOUT = (OfInt)$LAYOUT.select(groupElement("integerDotProduct16BitSignedAccelerated"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProduct16BitSignedAccelerated
     * }
     */
    public static final OfInt integerDotProduct16BitSignedAccelerated$layout() {
        return integerDotProduct16BitSignedAccelerated$LAYOUT;
    }

    private static final long integerDotProduct16BitSignedAccelerated$OFFSET = 44;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProduct16BitSignedAccelerated
     * }
     */
    public static final long integerDotProduct16BitSignedAccelerated$offset() {
        return integerDotProduct16BitSignedAccelerated$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProduct16BitSignedAccelerated
     * }
     */
    public static int integerDotProduct16BitSignedAccelerated(MemorySegment struct) {
        return struct.get(integerDotProduct16BitSignedAccelerated$LAYOUT, integerDotProduct16BitSignedAccelerated$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProduct16BitSignedAccelerated
     * }
     */
    public static void integerDotProduct16BitSignedAccelerated(MemorySegment struct, int fieldValue) {
        struct.set(integerDotProduct16BitSignedAccelerated$LAYOUT, integerDotProduct16BitSignedAccelerated$OFFSET, fieldValue);
    }

    private static final OfInt integerDotProduct16BitMixedSignednessAccelerated$LAYOUT = (OfInt)$LAYOUT.select(groupElement("integerDotProduct16BitMixedSignednessAccelerated"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProduct16BitMixedSignednessAccelerated
     * }
     */
    public static final OfInt integerDotProduct16BitMixedSignednessAccelerated$layout() {
        return integerDotProduct16BitMixedSignednessAccelerated$LAYOUT;
    }

    private static final long integerDotProduct16BitMixedSignednessAccelerated$OFFSET = 48;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProduct16BitMixedSignednessAccelerated
     * }
     */
    public static final long integerDotProduct16BitMixedSignednessAccelerated$offset() {
        return integerDotProduct16BitMixedSignednessAccelerated$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProduct16BitMixedSignednessAccelerated
     * }
     */
    public static int integerDotProduct16BitMixedSignednessAccelerated(MemorySegment struct) {
        return struct.get(integerDotProduct16BitMixedSignednessAccelerated$LAYOUT, integerDotProduct16BitMixedSignednessAccelerated$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProduct16BitMixedSignednessAccelerated
     * }
     */
    public static void integerDotProduct16BitMixedSignednessAccelerated(MemorySegment struct, int fieldValue) {
        struct.set(integerDotProduct16BitMixedSignednessAccelerated$LAYOUT, integerDotProduct16BitMixedSignednessAccelerated$OFFSET, fieldValue);
    }

    private static final OfInt integerDotProduct32BitUnsignedAccelerated$LAYOUT = (OfInt)$LAYOUT.select(groupElement("integerDotProduct32BitUnsignedAccelerated"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProduct32BitUnsignedAccelerated
     * }
     */
    public static final OfInt integerDotProduct32BitUnsignedAccelerated$layout() {
        return integerDotProduct32BitUnsignedAccelerated$LAYOUT;
    }

    private static final long integerDotProduct32BitUnsignedAccelerated$OFFSET = 52;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProduct32BitUnsignedAccelerated
     * }
     */
    public static final long integerDotProduct32BitUnsignedAccelerated$offset() {
        return integerDotProduct32BitUnsignedAccelerated$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProduct32BitUnsignedAccelerated
     * }
     */
    public static int integerDotProduct32BitUnsignedAccelerated(MemorySegment struct) {
        return struct.get(integerDotProduct32BitUnsignedAccelerated$LAYOUT, integerDotProduct32BitUnsignedAccelerated$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProduct32BitUnsignedAccelerated
     * }
     */
    public static void integerDotProduct32BitUnsignedAccelerated(MemorySegment struct, int fieldValue) {
        struct.set(integerDotProduct32BitUnsignedAccelerated$LAYOUT, integerDotProduct32BitUnsignedAccelerated$OFFSET, fieldValue);
    }

    private static final OfInt integerDotProduct32BitSignedAccelerated$LAYOUT = (OfInt)$LAYOUT.select(groupElement("integerDotProduct32BitSignedAccelerated"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProduct32BitSignedAccelerated
     * }
     */
    public static final OfInt integerDotProduct32BitSignedAccelerated$layout() {
        return integerDotProduct32BitSignedAccelerated$LAYOUT;
    }

    private static final long integerDotProduct32BitSignedAccelerated$OFFSET = 56;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProduct32BitSignedAccelerated
     * }
     */
    public static final long integerDotProduct32BitSignedAccelerated$offset() {
        return integerDotProduct32BitSignedAccelerated$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProduct32BitSignedAccelerated
     * }
     */
    public static int integerDotProduct32BitSignedAccelerated(MemorySegment struct) {
        return struct.get(integerDotProduct32BitSignedAccelerated$LAYOUT, integerDotProduct32BitSignedAccelerated$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProduct32BitSignedAccelerated
     * }
     */
    public static void integerDotProduct32BitSignedAccelerated(MemorySegment struct, int fieldValue) {
        struct.set(integerDotProduct32BitSignedAccelerated$LAYOUT, integerDotProduct32BitSignedAccelerated$OFFSET, fieldValue);
    }

    private static final OfInt integerDotProduct32BitMixedSignednessAccelerated$LAYOUT = (OfInt)$LAYOUT.select(groupElement("integerDotProduct32BitMixedSignednessAccelerated"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProduct32BitMixedSignednessAccelerated
     * }
     */
    public static final OfInt integerDotProduct32BitMixedSignednessAccelerated$layout() {
        return integerDotProduct32BitMixedSignednessAccelerated$LAYOUT;
    }

    private static final long integerDotProduct32BitMixedSignednessAccelerated$OFFSET = 60;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProduct32BitMixedSignednessAccelerated
     * }
     */
    public static final long integerDotProduct32BitMixedSignednessAccelerated$offset() {
        return integerDotProduct32BitMixedSignednessAccelerated$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProduct32BitMixedSignednessAccelerated
     * }
     */
    public static int integerDotProduct32BitMixedSignednessAccelerated(MemorySegment struct) {
        return struct.get(integerDotProduct32BitMixedSignednessAccelerated$LAYOUT, integerDotProduct32BitMixedSignednessAccelerated$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProduct32BitMixedSignednessAccelerated
     * }
     */
    public static void integerDotProduct32BitMixedSignednessAccelerated(MemorySegment struct, int fieldValue) {
        struct.set(integerDotProduct32BitMixedSignednessAccelerated$LAYOUT, integerDotProduct32BitMixedSignednessAccelerated$OFFSET, fieldValue);
    }

    private static final OfInt integerDotProduct64BitUnsignedAccelerated$LAYOUT = (OfInt)$LAYOUT.select(groupElement("integerDotProduct64BitUnsignedAccelerated"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProduct64BitUnsignedAccelerated
     * }
     */
    public static final OfInt integerDotProduct64BitUnsignedAccelerated$layout() {
        return integerDotProduct64BitUnsignedAccelerated$LAYOUT;
    }

    private static final long integerDotProduct64BitUnsignedAccelerated$OFFSET = 64;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProduct64BitUnsignedAccelerated
     * }
     */
    public static final long integerDotProduct64BitUnsignedAccelerated$offset() {
        return integerDotProduct64BitUnsignedAccelerated$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProduct64BitUnsignedAccelerated
     * }
     */
    public static int integerDotProduct64BitUnsignedAccelerated(MemorySegment struct) {
        return struct.get(integerDotProduct64BitUnsignedAccelerated$LAYOUT, integerDotProduct64BitUnsignedAccelerated$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProduct64BitUnsignedAccelerated
     * }
     */
    public static void integerDotProduct64BitUnsignedAccelerated(MemorySegment struct, int fieldValue) {
        struct.set(integerDotProduct64BitUnsignedAccelerated$LAYOUT, integerDotProduct64BitUnsignedAccelerated$OFFSET, fieldValue);
    }

    private static final OfInt integerDotProduct64BitSignedAccelerated$LAYOUT = (OfInt)$LAYOUT.select(groupElement("integerDotProduct64BitSignedAccelerated"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProduct64BitSignedAccelerated
     * }
     */
    public static final OfInt integerDotProduct64BitSignedAccelerated$layout() {
        return integerDotProduct64BitSignedAccelerated$LAYOUT;
    }

    private static final long integerDotProduct64BitSignedAccelerated$OFFSET = 68;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProduct64BitSignedAccelerated
     * }
     */
    public static final long integerDotProduct64BitSignedAccelerated$offset() {
        return integerDotProduct64BitSignedAccelerated$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProduct64BitSignedAccelerated
     * }
     */
    public static int integerDotProduct64BitSignedAccelerated(MemorySegment struct) {
        return struct.get(integerDotProduct64BitSignedAccelerated$LAYOUT, integerDotProduct64BitSignedAccelerated$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProduct64BitSignedAccelerated
     * }
     */
    public static void integerDotProduct64BitSignedAccelerated(MemorySegment struct, int fieldValue) {
        struct.set(integerDotProduct64BitSignedAccelerated$LAYOUT, integerDotProduct64BitSignedAccelerated$OFFSET, fieldValue);
    }

    private static final OfInt integerDotProduct64BitMixedSignednessAccelerated$LAYOUT = (OfInt)$LAYOUT.select(groupElement("integerDotProduct64BitMixedSignednessAccelerated"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProduct64BitMixedSignednessAccelerated
     * }
     */
    public static final OfInt integerDotProduct64BitMixedSignednessAccelerated$layout() {
        return integerDotProduct64BitMixedSignednessAccelerated$LAYOUT;
    }

    private static final long integerDotProduct64BitMixedSignednessAccelerated$OFFSET = 72;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProduct64BitMixedSignednessAccelerated
     * }
     */
    public static final long integerDotProduct64BitMixedSignednessAccelerated$offset() {
        return integerDotProduct64BitMixedSignednessAccelerated$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProduct64BitMixedSignednessAccelerated
     * }
     */
    public static int integerDotProduct64BitMixedSignednessAccelerated(MemorySegment struct) {
        return struct.get(integerDotProduct64BitMixedSignednessAccelerated$LAYOUT, integerDotProduct64BitMixedSignednessAccelerated$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProduct64BitMixedSignednessAccelerated
     * }
     */
    public static void integerDotProduct64BitMixedSignednessAccelerated(MemorySegment struct, int fieldValue) {
        struct.set(integerDotProduct64BitMixedSignednessAccelerated$LAYOUT, integerDotProduct64BitMixedSignednessAccelerated$OFFSET, fieldValue);
    }

    private static final OfInt integerDotProductAccumulatingSaturating8BitUnsignedAccelerated$LAYOUT = (OfInt)$LAYOUT.select(groupElement("integerDotProductAccumulatingSaturating8BitUnsignedAccelerated"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProductAccumulatingSaturating8BitUnsignedAccelerated
     * }
     */
    public static final OfInt integerDotProductAccumulatingSaturating8BitUnsignedAccelerated$layout() {
        return integerDotProductAccumulatingSaturating8BitUnsignedAccelerated$LAYOUT;
    }

    private static final long integerDotProductAccumulatingSaturating8BitUnsignedAccelerated$OFFSET = 76;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProductAccumulatingSaturating8BitUnsignedAccelerated
     * }
     */
    public static final long integerDotProductAccumulatingSaturating8BitUnsignedAccelerated$offset() {
        return integerDotProductAccumulatingSaturating8BitUnsignedAccelerated$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProductAccumulatingSaturating8BitUnsignedAccelerated
     * }
     */
    public static int integerDotProductAccumulatingSaturating8BitUnsignedAccelerated(MemorySegment struct) {
        return struct.get(integerDotProductAccumulatingSaturating8BitUnsignedAccelerated$LAYOUT, integerDotProductAccumulatingSaturating8BitUnsignedAccelerated$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProductAccumulatingSaturating8BitUnsignedAccelerated
     * }
     */
    public static void integerDotProductAccumulatingSaturating8BitUnsignedAccelerated(MemorySegment struct, int fieldValue) {
        struct.set(integerDotProductAccumulatingSaturating8BitUnsignedAccelerated$LAYOUT, integerDotProductAccumulatingSaturating8BitUnsignedAccelerated$OFFSET, fieldValue);
    }

    private static final OfInt integerDotProductAccumulatingSaturating8BitSignedAccelerated$LAYOUT = (OfInt)$LAYOUT.select(groupElement("integerDotProductAccumulatingSaturating8BitSignedAccelerated"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProductAccumulatingSaturating8BitSignedAccelerated
     * }
     */
    public static final OfInt integerDotProductAccumulatingSaturating8BitSignedAccelerated$layout() {
        return integerDotProductAccumulatingSaturating8BitSignedAccelerated$LAYOUT;
    }

    private static final long integerDotProductAccumulatingSaturating8BitSignedAccelerated$OFFSET = 80;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProductAccumulatingSaturating8BitSignedAccelerated
     * }
     */
    public static final long integerDotProductAccumulatingSaturating8BitSignedAccelerated$offset() {
        return integerDotProductAccumulatingSaturating8BitSignedAccelerated$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProductAccumulatingSaturating8BitSignedAccelerated
     * }
     */
    public static int integerDotProductAccumulatingSaturating8BitSignedAccelerated(MemorySegment struct) {
        return struct.get(integerDotProductAccumulatingSaturating8BitSignedAccelerated$LAYOUT, integerDotProductAccumulatingSaturating8BitSignedAccelerated$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProductAccumulatingSaturating8BitSignedAccelerated
     * }
     */
    public static void integerDotProductAccumulatingSaturating8BitSignedAccelerated(MemorySegment struct, int fieldValue) {
        struct.set(integerDotProductAccumulatingSaturating8BitSignedAccelerated$LAYOUT, integerDotProductAccumulatingSaturating8BitSignedAccelerated$OFFSET, fieldValue);
    }

    private static final OfInt integerDotProductAccumulatingSaturating8BitMixedSignednessAccelerated$LAYOUT = (OfInt)$LAYOUT.select(groupElement("integerDotProductAccumulatingSaturating8BitMixedSignednessAccelerated"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProductAccumulatingSaturating8BitMixedSignednessAccelerated
     * }
     */
    public static final OfInt integerDotProductAccumulatingSaturating8BitMixedSignednessAccelerated$layout() {
        return integerDotProductAccumulatingSaturating8BitMixedSignednessAccelerated$LAYOUT;
    }

    private static final long integerDotProductAccumulatingSaturating8BitMixedSignednessAccelerated$OFFSET = 84;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProductAccumulatingSaturating8BitMixedSignednessAccelerated
     * }
     */
    public static final long integerDotProductAccumulatingSaturating8BitMixedSignednessAccelerated$offset() {
        return integerDotProductAccumulatingSaturating8BitMixedSignednessAccelerated$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProductAccumulatingSaturating8BitMixedSignednessAccelerated
     * }
     */
    public static int integerDotProductAccumulatingSaturating8BitMixedSignednessAccelerated(MemorySegment struct) {
        return struct.get(integerDotProductAccumulatingSaturating8BitMixedSignednessAccelerated$LAYOUT, integerDotProductAccumulatingSaturating8BitMixedSignednessAccelerated$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProductAccumulatingSaturating8BitMixedSignednessAccelerated
     * }
     */
    public static void integerDotProductAccumulatingSaturating8BitMixedSignednessAccelerated(MemorySegment struct, int fieldValue) {
        struct.set(integerDotProductAccumulatingSaturating8BitMixedSignednessAccelerated$LAYOUT, integerDotProductAccumulatingSaturating8BitMixedSignednessAccelerated$OFFSET, fieldValue);
    }

    private static final OfInt integerDotProductAccumulatingSaturating4x8BitPackedUnsignedAccelerated$LAYOUT = (OfInt)$LAYOUT.select(groupElement("integerDotProductAccumulatingSaturating4x8BitPackedUnsignedAccelerated"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProductAccumulatingSaturating4x8BitPackedUnsignedAccelerated
     * }
     */
    public static final OfInt integerDotProductAccumulatingSaturating4x8BitPackedUnsignedAccelerated$layout() {
        return integerDotProductAccumulatingSaturating4x8BitPackedUnsignedAccelerated$LAYOUT;
    }

    private static final long integerDotProductAccumulatingSaturating4x8BitPackedUnsignedAccelerated$OFFSET = 88;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProductAccumulatingSaturating4x8BitPackedUnsignedAccelerated
     * }
     */
    public static final long integerDotProductAccumulatingSaturating4x8BitPackedUnsignedAccelerated$offset() {
        return integerDotProductAccumulatingSaturating4x8BitPackedUnsignedAccelerated$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProductAccumulatingSaturating4x8BitPackedUnsignedAccelerated
     * }
     */
    public static int integerDotProductAccumulatingSaturating4x8BitPackedUnsignedAccelerated(MemorySegment struct) {
        return struct.get(integerDotProductAccumulatingSaturating4x8BitPackedUnsignedAccelerated$LAYOUT, integerDotProductAccumulatingSaturating4x8BitPackedUnsignedAccelerated$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProductAccumulatingSaturating4x8BitPackedUnsignedAccelerated
     * }
     */
    public static void integerDotProductAccumulatingSaturating4x8BitPackedUnsignedAccelerated(MemorySegment struct, int fieldValue) {
        struct.set(integerDotProductAccumulatingSaturating4x8BitPackedUnsignedAccelerated$LAYOUT, integerDotProductAccumulatingSaturating4x8BitPackedUnsignedAccelerated$OFFSET, fieldValue);
    }

    private static final OfInt integerDotProductAccumulatingSaturating4x8BitPackedSignedAccelerated$LAYOUT = (OfInt)$LAYOUT.select(groupElement("integerDotProductAccumulatingSaturating4x8BitPackedSignedAccelerated"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProductAccumulatingSaturating4x8BitPackedSignedAccelerated
     * }
     */
    public static final OfInt integerDotProductAccumulatingSaturating4x8BitPackedSignedAccelerated$layout() {
        return integerDotProductAccumulatingSaturating4x8BitPackedSignedAccelerated$LAYOUT;
    }

    private static final long integerDotProductAccumulatingSaturating4x8BitPackedSignedAccelerated$OFFSET = 92;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProductAccumulatingSaturating4x8BitPackedSignedAccelerated
     * }
     */
    public static final long integerDotProductAccumulatingSaturating4x8BitPackedSignedAccelerated$offset() {
        return integerDotProductAccumulatingSaturating4x8BitPackedSignedAccelerated$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProductAccumulatingSaturating4x8BitPackedSignedAccelerated
     * }
     */
    public static int integerDotProductAccumulatingSaturating4x8BitPackedSignedAccelerated(MemorySegment struct) {
        return struct.get(integerDotProductAccumulatingSaturating4x8BitPackedSignedAccelerated$LAYOUT, integerDotProductAccumulatingSaturating4x8BitPackedSignedAccelerated$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProductAccumulatingSaturating4x8BitPackedSignedAccelerated
     * }
     */
    public static void integerDotProductAccumulatingSaturating4x8BitPackedSignedAccelerated(MemorySegment struct, int fieldValue) {
        struct.set(integerDotProductAccumulatingSaturating4x8BitPackedSignedAccelerated$LAYOUT, integerDotProductAccumulatingSaturating4x8BitPackedSignedAccelerated$OFFSET, fieldValue);
    }

    private static final OfInt integerDotProductAccumulatingSaturating4x8BitPackedMixedSignednessAccelerated$LAYOUT = (OfInt)$LAYOUT.select(groupElement("integerDotProductAccumulatingSaturating4x8BitPackedMixedSignednessAccelerated"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProductAccumulatingSaturating4x8BitPackedMixedSignednessAccelerated
     * }
     */
    public static final OfInt integerDotProductAccumulatingSaturating4x8BitPackedMixedSignednessAccelerated$layout() {
        return integerDotProductAccumulatingSaturating4x8BitPackedMixedSignednessAccelerated$LAYOUT;
    }

    private static final long integerDotProductAccumulatingSaturating4x8BitPackedMixedSignednessAccelerated$OFFSET = 96;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProductAccumulatingSaturating4x8BitPackedMixedSignednessAccelerated
     * }
     */
    public static final long integerDotProductAccumulatingSaturating4x8BitPackedMixedSignednessAccelerated$offset() {
        return integerDotProductAccumulatingSaturating4x8BitPackedMixedSignednessAccelerated$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProductAccumulatingSaturating4x8BitPackedMixedSignednessAccelerated
     * }
     */
    public static int integerDotProductAccumulatingSaturating4x8BitPackedMixedSignednessAccelerated(MemorySegment struct) {
        return struct.get(integerDotProductAccumulatingSaturating4x8BitPackedMixedSignednessAccelerated$LAYOUT, integerDotProductAccumulatingSaturating4x8BitPackedMixedSignednessAccelerated$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProductAccumulatingSaturating4x8BitPackedMixedSignednessAccelerated
     * }
     */
    public static void integerDotProductAccumulatingSaturating4x8BitPackedMixedSignednessAccelerated(MemorySegment struct, int fieldValue) {
        struct.set(integerDotProductAccumulatingSaturating4x8BitPackedMixedSignednessAccelerated$LAYOUT, integerDotProductAccumulatingSaturating4x8BitPackedMixedSignednessAccelerated$OFFSET, fieldValue);
    }

    private static final OfInt integerDotProductAccumulatingSaturating16BitUnsignedAccelerated$LAYOUT = (OfInt)$LAYOUT.select(groupElement("integerDotProductAccumulatingSaturating16BitUnsignedAccelerated"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProductAccumulatingSaturating16BitUnsignedAccelerated
     * }
     */
    public static final OfInt integerDotProductAccumulatingSaturating16BitUnsignedAccelerated$layout() {
        return integerDotProductAccumulatingSaturating16BitUnsignedAccelerated$LAYOUT;
    }

    private static final long integerDotProductAccumulatingSaturating16BitUnsignedAccelerated$OFFSET = 100;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProductAccumulatingSaturating16BitUnsignedAccelerated
     * }
     */
    public static final long integerDotProductAccumulatingSaturating16BitUnsignedAccelerated$offset() {
        return integerDotProductAccumulatingSaturating16BitUnsignedAccelerated$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProductAccumulatingSaturating16BitUnsignedAccelerated
     * }
     */
    public static int integerDotProductAccumulatingSaturating16BitUnsignedAccelerated(MemorySegment struct) {
        return struct.get(integerDotProductAccumulatingSaturating16BitUnsignedAccelerated$LAYOUT, integerDotProductAccumulatingSaturating16BitUnsignedAccelerated$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProductAccumulatingSaturating16BitUnsignedAccelerated
     * }
     */
    public static void integerDotProductAccumulatingSaturating16BitUnsignedAccelerated(MemorySegment struct, int fieldValue) {
        struct.set(integerDotProductAccumulatingSaturating16BitUnsignedAccelerated$LAYOUT, integerDotProductAccumulatingSaturating16BitUnsignedAccelerated$OFFSET, fieldValue);
    }

    private static final OfInt integerDotProductAccumulatingSaturating16BitSignedAccelerated$LAYOUT = (OfInt)$LAYOUT.select(groupElement("integerDotProductAccumulatingSaturating16BitSignedAccelerated"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProductAccumulatingSaturating16BitSignedAccelerated
     * }
     */
    public static final OfInt integerDotProductAccumulatingSaturating16BitSignedAccelerated$layout() {
        return integerDotProductAccumulatingSaturating16BitSignedAccelerated$LAYOUT;
    }

    private static final long integerDotProductAccumulatingSaturating16BitSignedAccelerated$OFFSET = 104;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProductAccumulatingSaturating16BitSignedAccelerated
     * }
     */
    public static final long integerDotProductAccumulatingSaturating16BitSignedAccelerated$offset() {
        return integerDotProductAccumulatingSaturating16BitSignedAccelerated$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProductAccumulatingSaturating16BitSignedAccelerated
     * }
     */
    public static int integerDotProductAccumulatingSaturating16BitSignedAccelerated(MemorySegment struct) {
        return struct.get(integerDotProductAccumulatingSaturating16BitSignedAccelerated$LAYOUT, integerDotProductAccumulatingSaturating16BitSignedAccelerated$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProductAccumulatingSaturating16BitSignedAccelerated
     * }
     */
    public static void integerDotProductAccumulatingSaturating16BitSignedAccelerated(MemorySegment struct, int fieldValue) {
        struct.set(integerDotProductAccumulatingSaturating16BitSignedAccelerated$LAYOUT, integerDotProductAccumulatingSaturating16BitSignedAccelerated$OFFSET, fieldValue);
    }

    private static final OfInt integerDotProductAccumulatingSaturating16BitMixedSignednessAccelerated$LAYOUT = (OfInt)$LAYOUT.select(groupElement("integerDotProductAccumulatingSaturating16BitMixedSignednessAccelerated"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProductAccumulatingSaturating16BitMixedSignednessAccelerated
     * }
     */
    public static final OfInt integerDotProductAccumulatingSaturating16BitMixedSignednessAccelerated$layout() {
        return integerDotProductAccumulatingSaturating16BitMixedSignednessAccelerated$LAYOUT;
    }

    private static final long integerDotProductAccumulatingSaturating16BitMixedSignednessAccelerated$OFFSET = 108;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProductAccumulatingSaturating16BitMixedSignednessAccelerated
     * }
     */
    public static final long integerDotProductAccumulatingSaturating16BitMixedSignednessAccelerated$offset() {
        return integerDotProductAccumulatingSaturating16BitMixedSignednessAccelerated$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProductAccumulatingSaturating16BitMixedSignednessAccelerated
     * }
     */
    public static int integerDotProductAccumulatingSaturating16BitMixedSignednessAccelerated(MemorySegment struct) {
        return struct.get(integerDotProductAccumulatingSaturating16BitMixedSignednessAccelerated$LAYOUT, integerDotProductAccumulatingSaturating16BitMixedSignednessAccelerated$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProductAccumulatingSaturating16BitMixedSignednessAccelerated
     * }
     */
    public static void integerDotProductAccumulatingSaturating16BitMixedSignednessAccelerated(MemorySegment struct, int fieldValue) {
        struct.set(integerDotProductAccumulatingSaturating16BitMixedSignednessAccelerated$LAYOUT, integerDotProductAccumulatingSaturating16BitMixedSignednessAccelerated$OFFSET, fieldValue);
    }

    private static final OfInt integerDotProductAccumulatingSaturating32BitUnsignedAccelerated$LAYOUT = (OfInt)$LAYOUT.select(groupElement("integerDotProductAccumulatingSaturating32BitUnsignedAccelerated"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProductAccumulatingSaturating32BitUnsignedAccelerated
     * }
     */
    public static final OfInt integerDotProductAccumulatingSaturating32BitUnsignedAccelerated$layout() {
        return integerDotProductAccumulatingSaturating32BitUnsignedAccelerated$LAYOUT;
    }

    private static final long integerDotProductAccumulatingSaturating32BitUnsignedAccelerated$OFFSET = 112;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProductAccumulatingSaturating32BitUnsignedAccelerated
     * }
     */
    public static final long integerDotProductAccumulatingSaturating32BitUnsignedAccelerated$offset() {
        return integerDotProductAccumulatingSaturating32BitUnsignedAccelerated$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProductAccumulatingSaturating32BitUnsignedAccelerated
     * }
     */
    public static int integerDotProductAccumulatingSaturating32BitUnsignedAccelerated(MemorySegment struct) {
        return struct.get(integerDotProductAccumulatingSaturating32BitUnsignedAccelerated$LAYOUT, integerDotProductAccumulatingSaturating32BitUnsignedAccelerated$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProductAccumulatingSaturating32BitUnsignedAccelerated
     * }
     */
    public static void integerDotProductAccumulatingSaturating32BitUnsignedAccelerated(MemorySegment struct, int fieldValue) {
        struct.set(integerDotProductAccumulatingSaturating32BitUnsignedAccelerated$LAYOUT, integerDotProductAccumulatingSaturating32BitUnsignedAccelerated$OFFSET, fieldValue);
    }

    private static final OfInt integerDotProductAccumulatingSaturating32BitSignedAccelerated$LAYOUT = (OfInt)$LAYOUT.select(groupElement("integerDotProductAccumulatingSaturating32BitSignedAccelerated"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProductAccumulatingSaturating32BitSignedAccelerated
     * }
     */
    public static final OfInt integerDotProductAccumulatingSaturating32BitSignedAccelerated$layout() {
        return integerDotProductAccumulatingSaturating32BitSignedAccelerated$LAYOUT;
    }

    private static final long integerDotProductAccumulatingSaturating32BitSignedAccelerated$OFFSET = 116;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProductAccumulatingSaturating32BitSignedAccelerated
     * }
     */
    public static final long integerDotProductAccumulatingSaturating32BitSignedAccelerated$offset() {
        return integerDotProductAccumulatingSaturating32BitSignedAccelerated$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProductAccumulatingSaturating32BitSignedAccelerated
     * }
     */
    public static int integerDotProductAccumulatingSaturating32BitSignedAccelerated(MemorySegment struct) {
        return struct.get(integerDotProductAccumulatingSaturating32BitSignedAccelerated$LAYOUT, integerDotProductAccumulatingSaturating32BitSignedAccelerated$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProductAccumulatingSaturating32BitSignedAccelerated
     * }
     */
    public static void integerDotProductAccumulatingSaturating32BitSignedAccelerated(MemorySegment struct, int fieldValue) {
        struct.set(integerDotProductAccumulatingSaturating32BitSignedAccelerated$LAYOUT, integerDotProductAccumulatingSaturating32BitSignedAccelerated$OFFSET, fieldValue);
    }

    private static final OfInt integerDotProductAccumulatingSaturating32BitMixedSignednessAccelerated$LAYOUT = (OfInt)$LAYOUT.select(groupElement("integerDotProductAccumulatingSaturating32BitMixedSignednessAccelerated"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProductAccumulatingSaturating32BitMixedSignednessAccelerated
     * }
     */
    public static final OfInt integerDotProductAccumulatingSaturating32BitMixedSignednessAccelerated$layout() {
        return integerDotProductAccumulatingSaturating32BitMixedSignednessAccelerated$LAYOUT;
    }

    private static final long integerDotProductAccumulatingSaturating32BitMixedSignednessAccelerated$OFFSET = 120;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProductAccumulatingSaturating32BitMixedSignednessAccelerated
     * }
     */
    public static final long integerDotProductAccumulatingSaturating32BitMixedSignednessAccelerated$offset() {
        return integerDotProductAccumulatingSaturating32BitMixedSignednessAccelerated$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProductAccumulatingSaturating32BitMixedSignednessAccelerated
     * }
     */
    public static int integerDotProductAccumulatingSaturating32BitMixedSignednessAccelerated(MemorySegment struct) {
        return struct.get(integerDotProductAccumulatingSaturating32BitMixedSignednessAccelerated$LAYOUT, integerDotProductAccumulatingSaturating32BitMixedSignednessAccelerated$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProductAccumulatingSaturating32BitMixedSignednessAccelerated
     * }
     */
    public static void integerDotProductAccumulatingSaturating32BitMixedSignednessAccelerated(MemorySegment struct, int fieldValue) {
        struct.set(integerDotProductAccumulatingSaturating32BitMixedSignednessAccelerated$LAYOUT, integerDotProductAccumulatingSaturating32BitMixedSignednessAccelerated$OFFSET, fieldValue);
    }

    private static final OfInt integerDotProductAccumulatingSaturating64BitUnsignedAccelerated$LAYOUT = (OfInt)$LAYOUT.select(groupElement("integerDotProductAccumulatingSaturating64BitUnsignedAccelerated"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProductAccumulatingSaturating64BitUnsignedAccelerated
     * }
     */
    public static final OfInt integerDotProductAccumulatingSaturating64BitUnsignedAccelerated$layout() {
        return integerDotProductAccumulatingSaturating64BitUnsignedAccelerated$LAYOUT;
    }

    private static final long integerDotProductAccumulatingSaturating64BitUnsignedAccelerated$OFFSET = 124;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProductAccumulatingSaturating64BitUnsignedAccelerated
     * }
     */
    public static final long integerDotProductAccumulatingSaturating64BitUnsignedAccelerated$offset() {
        return integerDotProductAccumulatingSaturating64BitUnsignedAccelerated$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProductAccumulatingSaturating64BitUnsignedAccelerated
     * }
     */
    public static int integerDotProductAccumulatingSaturating64BitUnsignedAccelerated(MemorySegment struct) {
        return struct.get(integerDotProductAccumulatingSaturating64BitUnsignedAccelerated$LAYOUT, integerDotProductAccumulatingSaturating64BitUnsignedAccelerated$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProductAccumulatingSaturating64BitUnsignedAccelerated
     * }
     */
    public static void integerDotProductAccumulatingSaturating64BitUnsignedAccelerated(MemorySegment struct, int fieldValue) {
        struct.set(integerDotProductAccumulatingSaturating64BitUnsignedAccelerated$LAYOUT, integerDotProductAccumulatingSaturating64BitUnsignedAccelerated$OFFSET, fieldValue);
    }

    private static final OfInt integerDotProductAccumulatingSaturating64BitSignedAccelerated$LAYOUT = (OfInt)$LAYOUT.select(groupElement("integerDotProductAccumulatingSaturating64BitSignedAccelerated"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProductAccumulatingSaturating64BitSignedAccelerated
     * }
     */
    public static final OfInt integerDotProductAccumulatingSaturating64BitSignedAccelerated$layout() {
        return integerDotProductAccumulatingSaturating64BitSignedAccelerated$LAYOUT;
    }

    private static final long integerDotProductAccumulatingSaturating64BitSignedAccelerated$OFFSET = 128;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProductAccumulatingSaturating64BitSignedAccelerated
     * }
     */
    public static final long integerDotProductAccumulatingSaturating64BitSignedAccelerated$offset() {
        return integerDotProductAccumulatingSaturating64BitSignedAccelerated$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProductAccumulatingSaturating64BitSignedAccelerated
     * }
     */
    public static int integerDotProductAccumulatingSaturating64BitSignedAccelerated(MemorySegment struct) {
        return struct.get(integerDotProductAccumulatingSaturating64BitSignedAccelerated$LAYOUT, integerDotProductAccumulatingSaturating64BitSignedAccelerated$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProductAccumulatingSaturating64BitSignedAccelerated
     * }
     */
    public static void integerDotProductAccumulatingSaturating64BitSignedAccelerated(MemorySegment struct, int fieldValue) {
        struct.set(integerDotProductAccumulatingSaturating64BitSignedAccelerated$LAYOUT, integerDotProductAccumulatingSaturating64BitSignedAccelerated$OFFSET, fieldValue);
    }

    private static final OfInt integerDotProductAccumulatingSaturating64BitMixedSignednessAccelerated$LAYOUT = (OfInt)$LAYOUT.select(groupElement("integerDotProductAccumulatingSaturating64BitMixedSignednessAccelerated"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProductAccumulatingSaturating64BitMixedSignednessAccelerated
     * }
     */
    public static final OfInt integerDotProductAccumulatingSaturating64BitMixedSignednessAccelerated$layout() {
        return integerDotProductAccumulatingSaturating64BitMixedSignednessAccelerated$LAYOUT;
    }

    private static final long integerDotProductAccumulatingSaturating64BitMixedSignednessAccelerated$OFFSET = 132;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProductAccumulatingSaturating64BitMixedSignednessAccelerated
     * }
     */
    public static final long integerDotProductAccumulatingSaturating64BitMixedSignednessAccelerated$offset() {
        return integerDotProductAccumulatingSaturating64BitMixedSignednessAccelerated$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkBool32 integerDotProductAccumulatingSaturating64BitMixedSignednessAccelerated
     * }
     */
    public static int integerDotProductAccumulatingSaturating64BitMixedSignednessAccelerated(MemorySegment struct) {
        return struct.get(integerDotProductAccumulatingSaturating64BitMixedSignednessAccelerated$LAYOUT, integerDotProductAccumulatingSaturating64BitMixedSignednessAccelerated$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
