// Generated by jextract

package org.vulkan;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct VkPhysicalDeviceShaderAtomicInt64Features {
 *     VkStructureType sType;
 *     void *pNext;
 *     VkBool32 shaderBufferInt64Atomics;
 *     VkBool32 shaderSharedInt64Atomics;
 * }
 * }
 */
public class VkPhysicalDeviceShaderAtomicInt64Features {

    VkPhysicalDeviceShaderAtomicInt64Features() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        vulkan_h.C_INT.withName("sType"),
        MemoryLayout.paddingLayout(4),
        vulkan_h.C_POINTER.withName("pNext"),
        vulkan_h.C_INT.withName("shaderBufferInt64Atomics"),
        vulkan_h.C_INT.withName("shaderSharedInt64Atomics")
    ).withName("VkPhysicalDeviceShaderAtomicInt64Features");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt sType$LAYOUT = (OfInt)$LAYOUT.select(groupElement("sType"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final OfInt sType$layout() {
        return sType$LAYOUT;
    }

    private static final long sType$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final long sType$offset() {
        return sType$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static int sType(MemorySegment struct) {
        return struct.get(sType$LAYOUT, sType$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static void sType(MemorySegment struct, int fieldValue) {
        struct.set(sType$LAYOUT, sType$OFFSET, fieldValue);
    }

    private static final AddressLayout pNext$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pNext"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * void *pNext
     * }
     */
    public static final AddressLayout pNext$layout() {
        return pNext$LAYOUT;
    }

    private static final long pNext$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * void *pNext
     * }
     */
    public static final long pNext$offset() {
        return pNext$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * void *pNext
     * }
     */
    public static MemorySegment pNext(MemorySegment struct) {
        return struct.get(pNext$LAYOUT, pNext$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * void *pNext
     * }
     */
    public static void pNext(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pNext$LAYOUT, pNext$OFFSET, fieldValue);
    }

    private static final OfInt shaderBufferInt64Atomics$LAYOUT = (OfInt)$LAYOUT.select(groupElement("shaderBufferInt64Atomics"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkBool32 shaderBufferInt64Atomics
     * }
     */
    public static final OfInt shaderBufferInt64Atomics$layout() {
        return shaderBufferInt64Atomics$LAYOUT;
    }

    private static final long shaderBufferInt64Atomics$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkBool32 shaderBufferInt64Atomics
     * }
     */
    public static final long shaderBufferInt64Atomics$offset() {
        return shaderBufferInt64Atomics$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkBool32 shaderBufferInt64Atomics
     * }
     */
    public static int shaderBufferInt64Atomics(MemorySegment struct) {
        return struct.get(shaderBufferInt64Atomics$LAYOUT, shaderBufferInt64Atomics$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkBool32 shaderBufferInt64Atomics
     * }
     */
    public static void shaderBufferInt64Atomics(MemorySegment struct, int fieldValue) {
        struct.set(shaderBufferInt64Atomics$LAYOUT, shaderBufferInt64Atomics$OFFSET, fieldValue);
    }

    private static final OfInt shaderSharedInt64Atomics$LAYOUT = (OfInt)$LAYOUT.select(groupElement("shaderSharedInt64Atomics"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkBool32 shaderSharedInt64Atomics
     * }
     */
    public static final OfInt shaderSharedInt64Atomics$layout() {
        return shaderSharedInt64Atomics$LAYOUT;
    }

    private static final long shaderSharedInt64Atomics$OFFSET = 20;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkBool32 shaderSharedInt64Atomics
     * }
     */
    public static final long shaderSharedInt64Atomics$offset() {
        return shaderSharedInt64Atomics$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkBool32 shaderSharedInt64Atomics
     * }
     */
    public static int shaderSharedInt64Atomics(MemorySegment struct) {
        return struct.get(shaderSharedInt64Atomics$LAYOUT, shaderSharedInt64Atomics$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkBool32 shaderSharedInt64Atomics
     * }
     */
    public static void shaderSharedInt64Atomics(MemorySegment struct, int fieldValue) {
        struct.set(shaderSharedInt64Atomics$LAYOUT, shaderSharedInt64Atomics$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

