// Generated by jextract

package org.vulkan;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct VkPipelineCacheHeaderVersionOne {
 *     uint32_t headerSize;
 *     VkPipelineCacheHeaderVersion headerVersion;
 *     uint32_t vendorID;
 *     uint32_t deviceID;
 *     uint8_t pipelineCacheUUID[16];
 * }
 * }
 */
public class VkPipelineCacheHeaderVersionOne {

    VkPipelineCacheHeaderVersionOne() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        vulkan_h.C_INT.withName("headerSize"),
        vulkan_h.C_INT.withName("headerVersion"),
        vulkan_h.C_INT.withName("vendorID"),
        vulkan_h.C_INT.withName("deviceID"),
        MemoryLayout.sequenceLayout(16, vulkan_h.C_CHAR).withName("pipelineCacheUUID")
    ).withName("VkPipelineCacheHeaderVersionOne");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt headerSize$LAYOUT = (OfInt)$LAYOUT.select(groupElement("headerSize"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t headerSize
     * }
     */
    public static final OfInt headerSize$layout() {
        return headerSize$LAYOUT;
    }

    private static final long headerSize$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t headerSize
     * }
     */
    public static final long headerSize$offset() {
        return headerSize$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t headerSize
     * }
     */
    public static int headerSize(MemorySegment struct) {
        return struct.get(headerSize$LAYOUT, headerSize$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t headerSize
     * }
     */
    public static void headerSize(MemorySegment struct, int fieldValue) {
        struct.set(headerSize$LAYOUT, headerSize$OFFSET, fieldValue);
    }

    private static final OfInt headerVersion$LAYOUT = (OfInt)$LAYOUT.select(groupElement("headerVersion"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkPipelineCacheHeaderVersion headerVersion
     * }
     */
    public static final OfInt headerVersion$layout() {
        return headerVersion$LAYOUT;
    }

    private static final long headerVersion$OFFSET = 4;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkPipelineCacheHeaderVersion headerVersion
     * }
     */
    public static final long headerVersion$offset() {
        return headerVersion$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkPipelineCacheHeaderVersion headerVersion
     * }
     */
    public static int headerVersion(MemorySegment struct) {
        return struct.get(headerVersion$LAYOUT, headerVersion$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkPipelineCacheHeaderVersion headerVersion
     * }
     */
    public static void headerVersion(MemorySegment struct, int fieldValue) {
        struct.set(headerVersion$LAYOUT, headerVersion$OFFSET, fieldValue);
    }

    private static final OfInt vendorID$LAYOUT = (OfInt)$LAYOUT.select(groupElement("vendorID"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t vendorID
     * }
     */
    public static final OfInt vendorID$layout() {
        return vendorID$LAYOUT;
    }

    private static final long vendorID$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t vendorID
     * }
     */
    public static final long vendorID$offset() {
        return vendorID$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t vendorID
     * }
     */
    public static int vendorID(MemorySegment struct) {
        return struct.get(vendorID$LAYOUT, vendorID$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t vendorID
     * }
     */
    public static void vendorID(MemorySegment struct, int fieldValue) {
        struct.set(vendorID$LAYOUT, vendorID$OFFSET, fieldValue);
    }

    private static final OfInt deviceID$LAYOUT = (OfInt)$LAYOUT.select(groupElement("deviceID"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t deviceID
     * }
     */
    public static final OfInt deviceID$layout() {
        return deviceID$LAYOUT;
    }

    private static final long deviceID$OFFSET = 12;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t deviceID
     * }
     */
    public static final long deviceID$offset() {
        return deviceID$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t deviceID
     * }
     */
    public static int deviceID(MemorySegment struct) {
        return struct.get(deviceID$LAYOUT, deviceID$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t deviceID
     * }
     */
    public static void deviceID(MemorySegment struct, int fieldValue) {
        struct.set(deviceID$LAYOUT, deviceID$OFFSET, fieldValue);
    }

    private static final SequenceLayout pipelineCacheUUID$LAYOUT = (SequenceLayout)$LAYOUT.select(groupElement("pipelineCacheUUID"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint8_t pipelineCacheUUID[16]
     * }
     */
    public static final SequenceLayout pipelineCacheUUID$layout() {
        return pipelineCacheUUID$LAYOUT;
    }

    private static final long pipelineCacheUUID$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint8_t pipelineCacheUUID[16]
     * }
     */
    public static final long pipelineCacheUUID$offset() {
        return pipelineCacheUUID$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint8_t pipelineCacheUUID[16]
     * }
     */
    public static MemorySegment pipelineCacheUUID(MemorySegment struct) {
        return struct.asSlice(pipelineCacheUUID$OFFSET, pipelineCacheUUID$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint8_t pipelineCacheUUID[16]
     * }
     */
    public static void pipelineCacheUUID(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, pipelineCacheUUID$OFFSET, pipelineCacheUUID$LAYOUT.byteSize());
    }

    private static long[] pipelineCacheUUID$DIMS = { 16 };

    /**
     * Dimensions for array field:
     * {@snippet lang=c :
     * uint8_t pipelineCacheUUID[16]
     * }
     */
    public static long[] pipelineCacheUUID$dimensions() {
        return pipelineCacheUUID$DIMS;
    }
    private static final VarHandle pipelineCacheUUID$ELEM_HANDLE = pipelineCacheUUID$LAYOUT.varHandle(sequenceElement());

    /**
     * Indexed getter for field:
     * {@snippet lang=c :
     * uint8_t pipelineCacheUUID[16]
     * }
     */
    public static byte pipelineCacheUUID(MemorySegment struct, long index0) {
        return (byte)pipelineCacheUUID$ELEM_HANDLE.get(struct, 0L, index0);
    }

    /**
     * Indexed setter for field:
     * {@snippet lang=c :
     * uint8_t pipelineCacheUUID[16]
     * }
     */
    public static void pipelineCacheUUID(MemorySegment struct, long index0, byte fieldValue) {
        pipelineCacheUUID$ELEM_HANDLE.set(struct, 0L, index0, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

