// Generated by jextract

package org.vulkan;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct VkPipelineRobustnessCreateInfoEXT {
 *     VkStructureType sType;
 *     const void *pNext;
 *     VkPipelineRobustnessBufferBehaviorEXT storageBuffers;
 *     VkPipelineRobustnessBufferBehaviorEXT uniformBuffers;
 *     VkPipelineRobustnessBufferBehaviorEXT vertexInputs;
 *     VkPipelineRobustnessImageBehaviorEXT images;
 * }
 * }
 */
public class VkPipelineRobustnessCreateInfoEXT {

    VkPipelineRobustnessCreateInfoEXT() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        vulkan_h.C_INT.withName("sType"),
        MemoryLayout.paddingLayout(4),
        vulkan_h.C_POINTER.withName("pNext"),
        vulkan_h.C_INT.withName("storageBuffers"),
        vulkan_h.C_INT.withName("uniformBuffers"),
        vulkan_h.C_INT.withName("vertexInputs"),
        vulkan_h.C_INT.withName("images")
    ).withName("VkPipelineRobustnessCreateInfoEXT");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt sType$LAYOUT = (OfInt)$LAYOUT.select(groupElement("sType"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final OfInt sType$layout() {
        return sType$LAYOUT;
    }

    private static final long sType$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final long sType$offset() {
        return sType$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static int sType(MemorySegment struct) {
        return struct.get(sType$LAYOUT, sType$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static void sType(MemorySegment struct, int fieldValue) {
        struct.set(sType$LAYOUT, sType$OFFSET, fieldValue);
    }

    private static final AddressLayout pNext$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pNext"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static final AddressLayout pNext$layout() {
        return pNext$LAYOUT;
    }

    private static final long pNext$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static final long pNext$offset() {
        return pNext$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static MemorySegment pNext(MemorySegment struct) {
        return struct.get(pNext$LAYOUT, pNext$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static void pNext(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pNext$LAYOUT, pNext$OFFSET, fieldValue);
    }

    private static final OfInt storageBuffers$LAYOUT = (OfInt)$LAYOUT.select(groupElement("storageBuffers"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkPipelineRobustnessBufferBehaviorEXT storageBuffers
     * }
     */
    public static final OfInt storageBuffers$layout() {
        return storageBuffers$LAYOUT;
    }

    private static final long storageBuffers$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkPipelineRobustnessBufferBehaviorEXT storageBuffers
     * }
     */
    public static final long storageBuffers$offset() {
        return storageBuffers$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkPipelineRobustnessBufferBehaviorEXT storageBuffers
     * }
     */
    public static int storageBuffers(MemorySegment struct) {
        return struct.get(storageBuffers$LAYOUT, storageBuffers$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkPipelineRobustnessBufferBehaviorEXT storageBuffers
     * }
     */
    public static void storageBuffers(MemorySegment struct, int fieldValue) {
        struct.set(storageBuffers$LAYOUT, storageBuffers$OFFSET, fieldValue);
    }

    private static final OfInt uniformBuffers$LAYOUT = (OfInt)$LAYOUT.select(groupElement("uniformBuffers"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkPipelineRobustnessBufferBehaviorEXT uniformBuffers
     * }
     */
    public static final OfInt uniformBuffers$layout() {
        return uniformBuffers$LAYOUT;
    }

    private static final long uniformBuffers$OFFSET = 20;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkPipelineRobustnessBufferBehaviorEXT uniformBuffers
     * }
     */
    public static final long uniformBuffers$offset() {
        return uniformBuffers$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkPipelineRobustnessBufferBehaviorEXT uniformBuffers
     * }
     */
    public static int uniformBuffers(MemorySegment struct) {
        return struct.get(uniformBuffers$LAYOUT, uniformBuffers$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkPipelineRobustnessBufferBehaviorEXT uniformBuffers
     * }
     */
    public static void uniformBuffers(MemorySegment struct, int fieldValue) {
        struct.set(uniformBuffers$LAYOUT, uniformBuffers$OFFSET, fieldValue);
    }

    private static final OfInt vertexInputs$LAYOUT = (OfInt)$LAYOUT.select(groupElement("vertexInputs"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkPipelineRobustnessBufferBehaviorEXT vertexInputs
     * }
     */
    public static final OfInt vertexInputs$layout() {
        return vertexInputs$LAYOUT;
    }

    private static final long vertexInputs$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkPipelineRobustnessBufferBehaviorEXT vertexInputs
     * }
     */
    public static final long vertexInputs$offset() {
        return vertexInputs$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkPipelineRobustnessBufferBehaviorEXT vertexInputs
     * }
     */
    public static int vertexInputs(MemorySegment struct) {
        return struct.get(vertexInputs$LAYOUT, vertexInputs$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkPipelineRobustnessBufferBehaviorEXT vertexInputs
     * }
     */
    public static void vertexInputs(MemorySegment struct, int fieldValue) {
        struct.set(vertexInputs$LAYOUT, vertexInputs$OFFSET, fieldValue);
    }

    private static final OfInt images$LAYOUT = (OfInt)$LAYOUT.select(groupElement("images"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkPipelineRobustnessImageBehaviorEXT images
     * }
     */
    public static final OfInt images$layout() {
        return images$LAYOUT;
    }

    private static final long images$OFFSET = 28;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkPipelineRobustnessImageBehaviorEXT images
     * }
     */
    public static final long images$offset() {
        return images$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkPipelineRobustnessImageBehaviorEXT images
     * }
     */
    public static int images(MemorySegment struct) {
        return struct.get(images$LAYOUT, images$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkPipelineRobustnessImageBehaviorEXT images
     * }
     */
    public static void images(MemorySegment struct, int fieldValue) {
        struct.set(images$LAYOUT, images$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

