// Generated by jextract

package org.vulkan;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct VkPipelineRenderingCreateInfo {
 *     VkStructureType sType;
 *     const void *pNext;
 *     uint32_t viewMask;
 *     uint32_t colorAttachmentCount;
 *     const VkFormat *pColorAttachmentFormats;
 *     VkFormat depthAttachmentFormat;
 *     VkFormat stencilAttachmentFormat;
 * }
 * }
 */
public class VkPipelineRenderingCreateInfo {

    VkPipelineRenderingCreateInfo() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        vulkan_h.C_INT.withName("sType"),
        MemoryLayout.paddingLayout(4),
        vulkan_h.C_POINTER.withName("pNext"),
        vulkan_h.C_INT.withName("viewMask"),
        vulkan_h.C_INT.withName("colorAttachmentCount"),
        vulkan_h.C_POINTER.withName("pColorAttachmentFormats"),
        vulkan_h.C_INT.withName("depthAttachmentFormat"),
        vulkan_h.C_INT.withName("stencilAttachmentFormat")
    ).withName("VkPipelineRenderingCreateInfo");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt sType$LAYOUT = (OfInt)$LAYOUT.select(groupElement("sType"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final OfInt sType$layout() {
        return sType$LAYOUT;
    }

    private static final long sType$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final long sType$offset() {
        return sType$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static int sType(MemorySegment struct) {
        return struct.get(sType$LAYOUT, sType$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static void sType(MemorySegment struct, int fieldValue) {
        struct.set(sType$LAYOUT, sType$OFFSET, fieldValue);
    }

    private static final AddressLayout pNext$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pNext"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static final AddressLayout pNext$layout() {
        return pNext$LAYOUT;
    }

    private static final long pNext$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static final long pNext$offset() {
        return pNext$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static MemorySegment pNext(MemorySegment struct) {
        return struct.get(pNext$LAYOUT, pNext$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static void pNext(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pNext$LAYOUT, pNext$OFFSET, fieldValue);
    }

    private static final OfInt viewMask$LAYOUT = (OfInt)$LAYOUT.select(groupElement("viewMask"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t viewMask
     * }
     */
    public static final OfInt viewMask$layout() {
        return viewMask$LAYOUT;
    }

    private static final long viewMask$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t viewMask
     * }
     */
    public static final long viewMask$offset() {
        return viewMask$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t viewMask
     * }
     */
    public static int viewMask(MemorySegment struct) {
        return struct.get(viewMask$LAYOUT, viewMask$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t viewMask
     * }
     */
    public static void viewMask(MemorySegment struct, int fieldValue) {
        struct.set(viewMask$LAYOUT, viewMask$OFFSET, fieldValue);
    }

    private static final OfInt colorAttachmentCount$LAYOUT = (OfInt)$LAYOUT.select(groupElement("colorAttachmentCount"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t colorAttachmentCount
     * }
     */
    public static final OfInt colorAttachmentCount$layout() {
        return colorAttachmentCount$LAYOUT;
    }

    private static final long colorAttachmentCount$OFFSET = 20;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t colorAttachmentCount
     * }
     */
    public static final long colorAttachmentCount$offset() {
        return colorAttachmentCount$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t colorAttachmentCount
     * }
     */
    public static int colorAttachmentCount(MemorySegment struct) {
        return struct.get(colorAttachmentCount$LAYOUT, colorAttachmentCount$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t colorAttachmentCount
     * }
     */
    public static void colorAttachmentCount(MemorySegment struct, int fieldValue) {
        struct.set(colorAttachmentCount$LAYOUT, colorAttachmentCount$OFFSET, fieldValue);
    }

    private static final AddressLayout pColorAttachmentFormats$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pColorAttachmentFormats"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const VkFormat *pColorAttachmentFormats
     * }
     */
    public static final AddressLayout pColorAttachmentFormats$layout() {
        return pColorAttachmentFormats$LAYOUT;
    }

    private static final long pColorAttachmentFormats$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const VkFormat *pColorAttachmentFormats
     * }
     */
    public static final long pColorAttachmentFormats$offset() {
        return pColorAttachmentFormats$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const VkFormat *pColorAttachmentFormats
     * }
     */
    public static MemorySegment pColorAttachmentFormats(MemorySegment struct) {
        return struct.get(pColorAttachmentFormats$LAYOUT, pColorAttachmentFormats$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const VkFormat *pColorAttachmentFormats
     * }
     */
    public static void pColorAttachmentFormats(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pColorAttachmentFormats$LAYOUT, pColorAttachmentFormats$OFFSET, fieldValue);
    }

    private static final OfInt depthAttachmentFormat$LAYOUT = (OfInt)$LAYOUT.select(groupElement("depthAttachmentFormat"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkFormat depthAttachmentFormat
     * }
     */
    public static final OfInt depthAttachmentFormat$layout() {
        return depthAttachmentFormat$LAYOUT;
    }

    private static final long depthAttachmentFormat$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkFormat depthAttachmentFormat
     * }
     */
    public static final long depthAttachmentFormat$offset() {
        return depthAttachmentFormat$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkFormat depthAttachmentFormat
     * }
     */
    public static int depthAttachmentFormat(MemorySegment struct) {
        return struct.get(depthAttachmentFormat$LAYOUT, depthAttachmentFormat$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkFormat depthAttachmentFormat
     * }
     */
    public static void depthAttachmentFormat(MemorySegment struct, int fieldValue) {
        struct.set(depthAttachmentFormat$LAYOUT, depthAttachmentFormat$OFFSET, fieldValue);
    }

    private static final OfInt stencilAttachmentFormat$LAYOUT = (OfInt)$LAYOUT.select(groupElement("stencilAttachmentFormat"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkFormat stencilAttachmentFormat
     * }
     */
    public static final OfInt stencilAttachmentFormat$layout() {
        return stencilAttachmentFormat$LAYOUT;
    }

    private static final long stencilAttachmentFormat$OFFSET = 36;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkFormat stencilAttachmentFormat
     * }
     */
    public static final long stencilAttachmentFormat$offset() {
        return stencilAttachmentFormat$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkFormat stencilAttachmentFormat
     * }
     */
    public static int stencilAttachmentFormat(MemorySegment struct) {
        return struct.get(stencilAttachmentFormat$LAYOUT, stencilAttachmentFormat$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkFormat stencilAttachmentFormat
     * }
     */
    public static void stencilAttachmentFormat(MemorySegment struct, int fieldValue) {
        struct.set(stencilAttachmentFormat$LAYOUT, stencilAttachmentFormat$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

