// Generated by jextract

package org.vulkan;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct VkPipelineFragmentShadingRateStateCreateInfoKHR {
 *     VkStructureType sType;
 *     const void *pNext;
 *     VkExtent2D fragmentSize;
 *     VkFragmentShadingRateCombinerOpKHR combinerOps[2];
 * }
 * }
 */
public class VkPipelineFragmentShadingRateStateCreateInfoKHR {

    VkPipelineFragmentShadingRateStateCreateInfoKHR() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        vulkan_h.C_INT.withName("sType"),
        MemoryLayout.paddingLayout(4),
        vulkan_h.C_POINTER.withName("pNext"),
        VkExtent2D.layout().withName("fragmentSize"),
        MemoryLayout.sequenceLayout(2, vulkan_h.C_INT).withName("combinerOps")
    ).withName("VkPipelineFragmentShadingRateStateCreateInfoKHR");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt sType$LAYOUT = (OfInt)$LAYOUT.select(groupElement("sType"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final OfInt sType$layout() {
        return sType$LAYOUT;
    }

    private static final long sType$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final long sType$offset() {
        return sType$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static int sType(MemorySegment struct) {
        return struct.get(sType$LAYOUT, sType$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static void sType(MemorySegment struct, int fieldValue) {
        struct.set(sType$LAYOUT, sType$OFFSET, fieldValue);
    }

    private static final AddressLayout pNext$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pNext"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static final AddressLayout pNext$layout() {
        return pNext$LAYOUT;
    }

    private static final long pNext$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static final long pNext$offset() {
        return pNext$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static MemorySegment pNext(MemorySegment struct) {
        return struct.get(pNext$LAYOUT, pNext$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static void pNext(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pNext$LAYOUT, pNext$OFFSET, fieldValue);
    }

    private static final GroupLayout fragmentSize$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("fragmentSize"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkExtent2D fragmentSize
     * }
     */
    public static final GroupLayout fragmentSize$layout() {
        return fragmentSize$LAYOUT;
    }

    private static final long fragmentSize$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkExtent2D fragmentSize
     * }
     */
    public static final long fragmentSize$offset() {
        return fragmentSize$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkExtent2D fragmentSize
     * }
     */
    public static MemorySegment fragmentSize(MemorySegment struct) {
        return struct.asSlice(fragmentSize$OFFSET, fragmentSize$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkExtent2D fragmentSize
     * }
     */
    public static void fragmentSize(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, fragmentSize$OFFSET, fragmentSize$LAYOUT.byteSize());
    }

    private static final SequenceLayout combinerOps$LAYOUT = (SequenceLayout)$LAYOUT.select(groupElement("combinerOps"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkFragmentShadingRateCombinerOpKHR combinerOps[2]
     * }
     */
    public static final SequenceLayout combinerOps$layout() {
        return combinerOps$LAYOUT;
    }

    private static final long combinerOps$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkFragmentShadingRateCombinerOpKHR combinerOps[2]
     * }
     */
    public static final long combinerOps$offset() {
        return combinerOps$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkFragmentShadingRateCombinerOpKHR combinerOps[2]
     * }
     */
    public static MemorySegment combinerOps(MemorySegment struct) {
        return struct.asSlice(combinerOps$OFFSET, combinerOps$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkFragmentShadingRateCombinerOpKHR combinerOps[2]
     * }
     */
    public static void combinerOps(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, combinerOps$OFFSET, combinerOps$LAYOUT.byteSize());
    }

    private static long[] combinerOps$DIMS = { 2 };

    /**
     * Dimensions for array field:
     * {@snippet lang=c :
     * VkFragmentShadingRateCombinerOpKHR combinerOps[2]
     * }
     */
    public static long[] combinerOps$dimensions() {
        return combinerOps$DIMS;
    }
    private static final VarHandle combinerOps$ELEM_HANDLE = combinerOps$LAYOUT.varHandle(sequenceElement());

    /**
     * Indexed getter for field:
     * {@snippet lang=c :
     * VkFragmentShadingRateCombinerOpKHR combinerOps[2]
     * }
     */
    public static int combinerOps(MemorySegment struct, long index0) {
        return (int)combinerOps$ELEM_HANDLE.get(struct, 0L, index0);
    }

    /**
     * Indexed setter for field:
     * {@snippet lang=c :
     * VkFragmentShadingRateCombinerOpKHR combinerOps[2]
     * }
     */
    public static void combinerOps(MemorySegment struct, long index0, int fieldValue) {
        combinerOps$ELEM_HANDLE.set(struct, 0L, index0, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

