// Generated by jextract

package org.vulkan;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct VkPipelineViewportCoarseSampleOrderStateCreateInfoNV {
 *     VkStructureType sType;
 *     const void *pNext;
 *     VkCoarseSampleOrderTypeNV sampleOrderType;
 *     uint32_t customSampleOrderCount;
 *     const VkCoarseSampleOrderCustomNV *pCustomSampleOrders;
 * }
 * }
 */
public class VkPipelineViewportCoarseSampleOrderStateCreateInfoNV {

    VkPipelineViewportCoarseSampleOrderStateCreateInfoNV() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        vulkan_h.C_INT.withName("sType"),
        MemoryLayout.paddingLayout(4),
        vulkan_h.C_POINTER.withName("pNext"),
        vulkan_h.C_INT.withName("sampleOrderType"),
        vulkan_h.C_INT.withName("customSampleOrderCount"),
        vulkan_h.C_POINTER.withName("pCustomSampleOrders")
    ).withName("VkPipelineViewportCoarseSampleOrderStateCreateInfoNV");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt sType$LAYOUT = (OfInt)$LAYOUT.select(groupElement("sType"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final OfInt sType$layout() {
        return sType$LAYOUT;
    }

    private static final long sType$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final long sType$offset() {
        return sType$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static int sType(MemorySegment struct) {
        return struct.get(sType$LAYOUT, sType$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static void sType(MemorySegment struct, int fieldValue) {
        struct.set(sType$LAYOUT, sType$OFFSET, fieldValue);
    }

    private static final AddressLayout pNext$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pNext"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static final AddressLayout pNext$layout() {
        return pNext$LAYOUT;
    }

    private static final long pNext$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static final long pNext$offset() {
        return pNext$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static MemorySegment pNext(MemorySegment struct) {
        return struct.get(pNext$LAYOUT, pNext$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static void pNext(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pNext$LAYOUT, pNext$OFFSET, fieldValue);
    }

    private static final OfInt sampleOrderType$LAYOUT = (OfInt)$LAYOUT.select(groupElement("sampleOrderType"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkCoarseSampleOrderTypeNV sampleOrderType
     * }
     */
    public static final OfInt sampleOrderType$layout() {
        return sampleOrderType$LAYOUT;
    }

    private static final long sampleOrderType$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkCoarseSampleOrderTypeNV sampleOrderType
     * }
     */
    public static final long sampleOrderType$offset() {
        return sampleOrderType$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkCoarseSampleOrderTypeNV sampleOrderType
     * }
     */
    public static int sampleOrderType(MemorySegment struct) {
        return struct.get(sampleOrderType$LAYOUT, sampleOrderType$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkCoarseSampleOrderTypeNV sampleOrderType
     * }
     */
    public static void sampleOrderType(MemorySegment struct, int fieldValue) {
        struct.set(sampleOrderType$LAYOUT, sampleOrderType$OFFSET, fieldValue);
    }

    private static final OfInt customSampleOrderCount$LAYOUT = (OfInt)$LAYOUT.select(groupElement("customSampleOrderCount"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t customSampleOrderCount
     * }
     */
    public static final OfInt customSampleOrderCount$layout() {
        return customSampleOrderCount$LAYOUT;
    }

    private static final long customSampleOrderCount$OFFSET = 20;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t customSampleOrderCount
     * }
     */
    public static final long customSampleOrderCount$offset() {
        return customSampleOrderCount$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t customSampleOrderCount
     * }
     */
    public static int customSampleOrderCount(MemorySegment struct) {
        return struct.get(customSampleOrderCount$LAYOUT, customSampleOrderCount$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t customSampleOrderCount
     * }
     */
    public static void customSampleOrderCount(MemorySegment struct, int fieldValue) {
        struct.set(customSampleOrderCount$LAYOUT, customSampleOrderCount$OFFSET, fieldValue);
    }

    private static final AddressLayout pCustomSampleOrders$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pCustomSampleOrders"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const VkCoarseSampleOrderCustomNV *pCustomSampleOrders
     * }
     */
    public static final AddressLayout pCustomSampleOrders$layout() {
        return pCustomSampleOrders$LAYOUT;
    }

    private static final long pCustomSampleOrders$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const VkCoarseSampleOrderCustomNV *pCustomSampleOrders
     * }
     */
    public static final long pCustomSampleOrders$offset() {
        return pCustomSampleOrders$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const VkCoarseSampleOrderCustomNV *pCustomSampleOrders
     * }
     */
    public static MemorySegment pCustomSampleOrders(MemorySegment struct) {
        return struct.get(pCustomSampleOrders$LAYOUT, pCustomSampleOrders$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const VkCoarseSampleOrderCustomNV *pCustomSampleOrders
     * }
     */
    public static void pCustomSampleOrders(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pCustomSampleOrders$LAYOUT, pCustomSampleOrders$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

