// Generated by jextract

package org.vulkan;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct VkPipelineVertexInputStateCreateInfo {
 *     VkStructureType sType;
 *     const void *pNext;
 *     VkPipelineVertexInputStateCreateFlags flags;
 *     uint32_t vertexBindingDescriptionCount;
 *     const VkVertexInputBindingDescription *pVertexBindingDescriptions;
 *     uint32_t vertexAttributeDescriptionCount;
 *     const VkVertexInputAttributeDescription *pVertexAttributeDescriptions;
 * }
 * }
 */
public class VkPipelineVertexInputStateCreateInfo {

    VkPipelineVertexInputStateCreateInfo() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        vulkan_h.C_INT.withName("sType"),
        MemoryLayout.paddingLayout(4),
        vulkan_h.C_POINTER.withName("pNext"),
        vulkan_h.C_INT.withName("flags"),
        vulkan_h.C_INT.withName("vertexBindingDescriptionCount"),
        vulkan_h.C_POINTER.withName("pVertexBindingDescriptions"),
        vulkan_h.C_INT.withName("vertexAttributeDescriptionCount"),
        MemoryLayout.paddingLayout(4),
        vulkan_h.C_POINTER.withName("pVertexAttributeDescriptions")
    ).withName("VkPipelineVertexInputStateCreateInfo");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt sType$LAYOUT = (OfInt)$LAYOUT.select(groupElement("sType"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final OfInt sType$layout() {
        return sType$LAYOUT;
    }

    private static final long sType$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final long sType$offset() {
        return sType$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static int sType(MemorySegment struct) {
        return struct.get(sType$LAYOUT, sType$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static void sType(MemorySegment struct, int fieldValue) {
        struct.set(sType$LAYOUT, sType$OFFSET, fieldValue);
    }

    private static final AddressLayout pNext$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pNext"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static final AddressLayout pNext$layout() {
        return pNext$LAYOUT;
    }

    private static final long pNext$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static final long pNext$offset() {
        return pNext$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static MemorySegment pNext(MemorySegment struct) {
        return struct.get(pNext$LAYOUT, pNext$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static void pNext(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pNext$LAYOUT, pNext$OFFSET, fieldValue);
    }

    private static final OfInt flags$LAYOUT = (OfInt)$LAYOUT.select(groupElement("flags"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkPipelineVertexInputStateCreateFlags flags
     * }
     */
    public static final OfInt flags$layout() {
        return flags$LAYOUT;
    }

    private static final long flags$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkPipelineVertexInputStateCreateFlags flags
     * }
     */
    public static final long flags$offset() {
        return flags$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkPipelineVertexInputStateCreateFlags flags
     * }
     */
    public static int flags(MemorySegment struct) {
        return struct.get(flags$LAYOUT, flags$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkPipelineVertexInputStateCreateFlags flags
     * }
     */
    public static void flags(MemorySegment struct, int fieldValue) {
        struct.set(flags$LAYOUT, flags$OFFSET, fieldValue);
    }

    private static final OfInt vertexBindingDescriptionCount$LAYOUT = (OfInt)$LAYOUT.select(groupElement("vertexBindingDescriptionCount"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t vertexBindingDescriptionCount
     * }
     */
    public static final OfInt vertexBindingDescriptionCount$layout() {
        return vertexBindingDescriptionCount$LAYOUT;
    }

    private static final long vertexBindingDescriptionCount$OFFSET = 20;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t vertexBindingDescriptionCount
     * }
     */
    public static final long vertexBindingDescriptionCount$offset() {
        return vertexBindingDescriptionCount$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t vertexBindingDescriptionCount
     * }
     */
    public static int vertexBindingDescriptionCount(MemorySegment struct) {
        return struct.get(vertexBindingDescriptionCount$LAYOUT, vertexBindingDescriptionCount$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t vertexBindingDescriptionCount
     * }
     */
    public static void vertexBindingDescriptionCount(MemorySegment struct, int fieldValue) {
        struct.set(vertexBindingDescriptionCount$LAYOUT, vertexBindingDescriptionCount$OFFSET, fieldValue);
    }

    private static final AddressLayout pVertexBindingDescriptions$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pVertexBindingDescriptions"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const VkVertexInputBindingDescription *pVertexBindingDescriptions
     * }
     */
    public static final AddressLayout pVertexBindingDescriptions$layout() {
        return pVertexBindingDescriptions$LAYOUT;
    }

    private static final long pVertexBindingDescriptions$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const VkVertexInputBindingDescription *pVertexBindingDescriptions
     * }
     */
    public static final long pVertexBindingDescriptions$offset() {
        return pVertexBindingDescriptions$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const VkVertexInputBindingDescription *pVertexBindingDescriptions
     * }
     */
    public static MemorySegment pVertexBindingDescriptions(MemorySegment struct) {
        return struct.get(pVertexBindingDescriptions$LAYOUT, pVertexBindingDescriptions$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const VkVertexInputBindingDescription *pVertexBindingDescriptions
     * }
     */
    public static void pVertexBindingDescriptions(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pVertexBindingDescriptions$LAYOUT, pVertexBindingDescriptions$OFFSET, fieldValue);
    }

    private static final OfInt vertexAttributeDescriptionCount$LAYOUT = (OfInt)$LAYOUT.select(groupElement("vertexAttributeDescriptionCount"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t vertexAttributeDescriptionCount
     * }
     */
    public static final OfInt vertexAttributeDescriptionCount$layout() {
        return vertexAttributeDescriptionCount$LAYOUT;
    }

    private static final long vertexAttributeDescriptionCount$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t vertexAttributeDescriptionCount
     * }
     */
    public static final long vertexAttributeDescriptionCount$offset() {
        return vertexAttributeDescriptionCount$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t vertexAttributeDescriptionCount
     * }
     */
    public static int vertexAttributeDescriptionCount(MemorySegment struct) {
        return struct.get(vertexAttributeDescriptionCount$LAYOUT, vertexAttributeDescriptionCount$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t vertexAttributeDescriptionCount
     * }
     */
    public static void vertexAttributeDescriptionCount(MemorySegment struct, int fieldValue) {
        struct.set(vertexAttributeDescriptionCount$LAYOUT, vertexAttributeDescriptionCount$OFFSET, fieldValue);
    }

    private static final AddressLayout pVertexAttributeDescriptions$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pVertexAttributeDescriptions"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const VkVertexInputAttributeDescription *pVertexAttributeDescriptions
     * }
     */
    public static final AddressLayout pVertexAttributeDescriptions$layout() {
        return pVertexAttributeDescriptions$LAYOUT;
    }

    private static final long pVertexAttributeDescriptions$OFFSET = 40;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const VkVertexInputAttributeDescription *pVertexAttributeDescriptions
     * }
     */
    public static final long pVertexAttributeDescriptions$offset() {
        return pVertexAttributeDescriptions$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const VkVertexInputAttributeDescription *pVertexAttributeDescriptions
     * }
     */
    public static MemorySegment pVertexAttributeDescriptions(MemorySegment struct) {
        return struct.get(pVertexAttributeDescriptions$LAYOUT, pVertexAttributeDescriptions$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const VkVertexInputAttributeDescription *pVertexAttributeDescriptions
     * }
     */
    public static void pVertexAttributeDescriptions(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pVertexAttributeDescriptions$LAYOUT, pVertexAttributeDescriptions$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

