// Generated by jextract

package org.vulkan;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct VkPipelineLayoutCreateInfo {
 *     VkStructureType sType;
 *     const void *pNext;
 *     VkPipelineLayoutCreateFlags flags;
 *     uint32_t setLayoutCount;
 *     const VkDescriptorSetLayout *pSetLayouts;
 *     uint32_t pushConstantRangeCount;
 *     const VkPushConstantRange *pPushConstantRanges;
 * }
 * }
 */
public class VkPipelineLayoutCreateInfo {

    VkPipelineLayoutCreateInfo() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        vulkan_h.C_INT.withName("sType"),
        MemoryLayout.paddingLayout(4),
        vulkan_h.C_POINTER.withName("pNext"),
        vulkan_h.C_INT.withName("flags"),
        vulkan_h.C_INT.withName("setLayoutCount"),
        vulkan_h.C_POINTER.withName("pSetLayouts"),
        vulkan_h.C_INT.withName("pushConstantRangeCount"),
        MemoryLayout.paddingLayout(4),
        vulkan_h.C_POINTER.withName("pPushConstantRanges")
    ).withName("VkPipelineLayoutCreateInfo");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt sType$LAYOUT = (OfInt)$LAYOUT.select(groupElement("sType"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final OfInt sType$layout() {
        return sType$LAYOUT;
    }

    private static final long sType$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final long sType$offset() {
        return sType$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static int sType(MemorySegment struct) {
        return struct.get(sType$LAYOUT, sType$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static void sType(MemorySegment struct, int fieldValue) {
        struct.set(sType$LAYOUT, sType$OFFSET, fieldValue);
    }

    private static final AddressLayout pNext$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pNext"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static final AddressLayout pNext$layout() {
        return pNext$LAYOUT;
    }

    private static final long pNext$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static final long pNext$offset() {
        return pNext$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static MemorySegment pNext(MemorySegment struct) {
        return struct.get(pNext$LAYOUT, pNext$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static void pNext(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pNext$LAYOUT, pNext$OFFSET, fieldValue);
    }

    private static final OfInt flags$LAYOUT = (OfInt)$LAYOUT.select(groupElement("flags"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkPipelineLayoutCreateFlags flags
     * }
     */
    public static final OfInt flags$layout() {
        return flags$LAYOUT;
    }

    private static final long flags$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkPipelineLayoutCreateFlags flags
     * }
     */
    public static final long flags$offset() {
        return flags$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkPipelineLayoutCreateFlags flags
     * }
     */
    public static int flags(MemorySegment struct) {
        return struct.get(flags$LAYOUT, flags$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkPipelineLayoutCreateFlags flags
     * }
     */
    public static void flags(MemorySegment struct, int fieldValue) {
        struct.set(flags$LAYOUT, flags$OFFSET, fieldValue);
    }

    private static final OfInt setLayoutCount$LAYOUT = (OfInt)$LAYOUT.select(groupElement("setLayoutCount"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t setLayoutCount
     * }
     */
    public static final OfInt setLayoutCount$layout() {
        return setLayoutCount$LAYOUT;
    }

    private static final long setLayoutCount$OFFSET = 20;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t setLayoutCount
     * }
     */
    public static final long setLayoutCount$offset() {
        return setLayoutCount$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t setLayoutCount
     * }
     */
    public static int setLayoutCount(MemorySegment struct) {
        return struct.get(setLayoutCount$LAYOUT, setLayoutCount$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t setLayoutCount
     * }
     */
    public static void setLayoutCount(MemorySegment struct, int fieldValue) {
        struct.set(setLayoutCount$LAYOUT, setLayoutCount$OFFSET, fieldValue);
    }

    private static final AddressLayout pSetLayouts$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pSetLayouts"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const VkDescriptorSetLayout *pSetLayouts
     * }
     */
    public static final AddressLayout pSetLayouts$layout() {
        return pSetLayouts$LAYOUT;
    }

    private static final long pSetLayouts$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const VkDescriptorSetLayout *pSetLayouts
     * }
     */
    public static final long pSetLayouts$offset() {
        return pSetLayouts$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const VkDescriptorSetLayout *pSetLayouts
     * }
     */
    public static MemorySegment pSetLayouts(MemorySegment struct) {
        return struct.get(pSetLayouts$LAYOUT, pSetLayouts$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const VkDescriptorSetLayout *pSetLayouts
     * }
     */
    public static void pSetLayouts(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pSetLayouts$LAYOUT, pSetLayouts$OFFSET, fieldValue);
    }

    private static final OfInt pushConstantRangeCount$LAYOUT = (OfInt)$LAYOUT.select(groupElement("pushConstantRangeCount"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t pushConstantRangeCount
     * }
     */
    public static final OfInt pushConstantRangeCount$layout() {
        return pushConstantRangeCount$LAYOUT;
    }

    private static final long pushConstantRangeCount$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t pushConstantRangeCount
     * }
     */
    public static final long pushConstantRangeCount$offset() {
        return pushConstantRangeCount$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t pushConstantRangeCount
     * }
     */
    public static int pushConstantRangeCount(MemorySegment struct) {
        return struct.get(pushConstantRangeCount$LAYOUT, pushConstantRangeCount$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t pushConstantRangeCount
     * }
     */
    public static void pushConstantRangeCount(MemorySegment struct, int fieldValue) {
        struct.set(pushConstantRangeCount$LAYOUT, pushConstantRangeCount$OFFSET, fieldValue);
    }

    private static final AddressLayout pPushConstantRanges$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pPushConstantRanges"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const VkPushConstantRange *pPushConstantRanges
     * }
     */
    public static final AddressLayout pPushConstantRanges$layout() {
        return pPushConstantRanges$LAYOUT;
    }

    private static final long pPushConstantRanges$OFFSET = 40;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const VkPushConstantRange *pPushConstantRanges
     * }
     */
    public static final long pPushConstantRanges$offset() {
        return pPushConstantRanges$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const VkPushConstantRange *pPushConstantRanges
     * }
     */
    public static MemorySegment pPushConstantRanges(MemorySegment struct) {
        return struct.get(pPushConstantRanges$LAYOUT, pPushConstantRanges$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const VkPushConstantRange *pPushConstantRanges
     * }
     */
    public static void pPushConstantRanges(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pPushConstantRanges$LAYOUT, pPushConstantRanges$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

