// Generated by jextract

package org.vulkan;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct VkQueryPoolPerformanceCreateInfoKHR {
 *     VkStructureType sType;
 *     const void *pNext;
 *     uint32_t queueFamilyIndex;
 *     uint32_t counterIndexCount;
 *     const uint32_t *pCounterIndices;
 * }
 * }
 */
public class VkQueryPoolPerformanceCreateInfoKHR {

    VkQueryPoolPerformanceCreateInfoKHR() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        vulkan_h.C_INT.withName("sType"),
        MemoryLayout.paddingLayout(4),
        vulkan_h.C_POINTER.withName("pNext"),
        vulkan_h.C_INT.withName("queueFamilyIndex"),
        vulkan_h.C_INT.withName("counterIndexCount"),
        vulkan_h.C_POINTER.withName("pCounterIndices")
    ).withName("VkQueryPoolPerformanceCreateInfoKHR");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt sType$LAYOUT = (OfInt)$LAYOUT.select(groupElement("sType"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final OfInt sType$layout() {
        return sType$LAYOUT;
    }

    private static final long sType$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final long sType$offset() {
        return sType$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static int sType(MemorySegment struct) {
        return struct.get(sType$LAYOUT, sType$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static void sType(MemorySegment struct, int fieldValue) {
        struct.set(sType$LAYOUT, sType$OFFSET, fieldValue);
    }

    private static final AddressLayout pNext$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pNext"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static final AddressLayout pNext$layout() {
        return pNext$LAYOUT;
    }

    private static final long pNext$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static final long pNext$offset() {
        return pNext$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static MemorySegment pNext(MemorySegment struct) {
        return struct.get(pNext$LAYOUT, pNext$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static void pNext(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pNext$LAYOUT, pNext$OFFSET, fieldValue);
    }

    private static final OfInt queueFamilyIndex$LAYOUT = (OfInt)$LAYOUT.select(groupElement("queueFamilyIndex"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t queueFamilyIndex
     * }
     */
    public static final OfInt queueFamilyIndex$layout() {
        return queueFamilyIndex$LAYOUT;
    }

    private static final long queueFamilyIndex$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t queueFamilyIndex
     * }
     */
    public static final long queueFamilyIndex$offset() {
        return queueFamilyIndex$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t queueFamilyIndex
     * }
     */
    public static int queueFamilyIndex(MemorySegment struct) {
        return struct.get(queueFamilyIndex$LAYOUT, queueFamilyIndex$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t queueFamilyIndex
     * }
     */
    public static void queueFamilyIndex(MemorySegment struct, int fieldValue) {
        struct.set(queueFamilyIndex$LAYOUT, queueFamilyIndex$OFFSET, fieldValue);
    }

    private static final OfInt counterIndexCount$LAYOUT = (OfInt)$LAYOUT.select(groupElement("counterIndexCount"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t counterIndexCount
     * }
     */
    public static final OfInt counterIndexCount$layout() {
        return counterIndexCount$LAYOUT;
    }

    private static final long counterIndexCount$OFFSET = 20;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t counterIndexCount
     * }
     */
    public static final long counterIndexCount$offset() {
        return counterIndexCount$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t counterIndexCount
     * }
     */
    public static int counterIndexCount(MemorySegment struct) {
        return struct.get(counterIndexCount$LAYOUT, counterIndexCount$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t counterIndexCount
     * }
     */
    public static void counterIndexCount(MemorySegment struct, int fieldValue) {
        struct.set(counterIndexCount$LAYOUT, counterIndexCount$OFFSET, fieldValue);
    }

    private static final AddressLayout pCounterIndices$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pCounterIndices"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const uint32_t *pCounterIndices
     * }
     */
    public static final AddressLayout pCounterIndices$layout() {
        return pCounterIndices$LAYOUT;
    }

    private static final long pCounterIndices$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const uint32_t *pCounterIndices
     * }
     */
    public static final long pCounterIndices$offset() {
        return pCounterIndices$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const uint32_t *pCounterIndices
     * }
     */
    public static MemorySegment pCounterIndices(MemorySegment struct) {
        return struct.get(pCounterIndices$LAYOUT, pCounterIndices$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const uint32_t *pCounterIndices
     * }
     */
    public static void pCounterIndices(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pCounterIndices$LAYOUT, pCounterIndices$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

