// Generated by jextract

package org.vulkan;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct VkReleaseSwapchainImagesInfoEXT {
 *     VkStructureType sType;
 *     const void *pNext;
 *     VkSwapchainKHR swapchain;
 *     uint32_t imageIndexCount;
 *     const uint32_t *pImageIndices;
 * }
 * }
 */
public class VkReleaseSwapchainImagesInfoEXT {

    VkReleaseSwapchainImagesInfoEXT() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        vulkan_h.C_INT.withName("sType"),
        MemoryLayout.paddingLayout(4),
        vulkan_h.C_POINTER.withName("pNext"),
        vulkan_h.C_POINTER.withName("swapchain"),
        vulkan_h.C_INT.withName("imageIndexCount"),
        MemoryLayout.paddingLayout(4),
        vulkan_h.C_POINTER.withName("pImageIndices")
    ).withName("VkReleaseSwapchainImagesInfoEXT");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt sType$LAYOUT = (OfInt)$LAYOUT.select(groupElement("sType"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final OfInt sType$layout() {
        return sType$LAYOUT;
    }

    private static final long sType$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final long sType$offset() {
        return sType$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static int sType(MemorySegment struct) {
        return struct.get(sType$LAYOUT, sType$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static void sType(MemorySegment struct, int fieldValue) {
        struct.set(sType$LAYOUT, sType$OFFSET, fieldValue);
    }

    private static final AddressLayout pNext$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pNext"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static final AddressLayout pNext$layout() {
        return pNext$LAYOUT;
    }

    private static final long pNext$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static final long pNext$offset() {
        return pNext$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static MemorySegment pNext(MemorySegment struct) {
        return struct.get(pNext$LAYOUT, pNext$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static void pNext(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pNext$LAYOUT, pNext$OFFSET, fieldValue);
    }

    private static final AddressLayout swapchain$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("swapchain"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkSwapchainKHR swapchain
     * }
     */
    public static final AddressLayout swapchain$layout() {
        return swapchain$LAYOUT;
    }

    private static final long swapchain$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkSwapchainKHR swapchain
     * }
     */
    public static final long swapchain$offset() {
        return swapchain$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkSwapchainKHR swapchain
     * }
     */
    public static MemorySegment swapchain(MemorySegment struct) {
        return struct.get(swapchain$LAYOUT, swapchain$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkSwapchainKHR swapchain
     * }
     */
    public static void swapchain(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(swapchain$LAYOUT, swapchain$OFFSET, fieldValue);
    }

    private static final OfInt imageIndexCount$LAYOUT = (OfInt)$LAYOUT.select(groupElement("imageIndexCount"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t imageIndexCount
     * }
     */
    public static final OfInt imageIndexCount$layout() {
        return imageIndexCount$LAYOUT;
    }

    private static final long imageIndexCount$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t imageIndexCount
     * }
     */
    public static final long imageIndexCount$offset() {
        return imageIndexCount$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t imageIndexCount
     * }
     */
    public static int imageIndexCount(MemorySegment struct) {
        return struct.get(imageIndexCount$LAYOUT, imageIndexCount$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t imageIndexCount
     * }
     */
    public static void imageIndexCount(MemorySegment struct, int fieldValue) {
        struct.set(imageIndexCount$LAYOUT, imageIndexCount$OFFSET, fieldValue);
    }

    private static final AddressLayout pImageIndices$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pImageIndices"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const uint32_t *pImageIndices
     * }
     */
    public static final AddressLayout pImageIndices$layout() {
        return pImageIndices$LAYOUT;
    }

    private static final long pImageIndices$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const uint32_t *pImageIndices
     * }
     */
    public static final long pImageIndices$offset() {
        return pImageIndices$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const uint32_t *pImageIndices
     * }
     */
    public static MemorySegment pImageIndices(MemorySegment struct) {
        return struct.get(pImageIndices$LAYOUT, pImageIndices$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const uint32_t *pImageIndices
     * }
     */
    public static void pImageIndices(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pImageIndices$LAYOUT, pImageIndices$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

