// Generated by jextract

package org.vulkan;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct VkRenderPassSampleLocationsBeginInfoEXT {
 *     VkStructureType sType;
 *     const void *pNext;
 *     uint32_t attachmentInitialSampleLocationsCount;
 *     const VkAttachmentSampleLocationsEXT *pAttachmentInitialSampleLocations;
 *     uint32_t postSubpassSampleLocationsCount;
 *     const VkSubpassSampleLocationsEXT *pPostSubpassSampleLocations;
 * }
 * }
 */
public class VkRenderPassSampleLocationsBeginInfoEXT {

    VkRenderPassSampleLocationsBeginInfoEXT() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        vulkan_h.C_INT.withName("sType"),
        MemoryLayout.paddingLayout(4),
        vulkan_h.C_POINTER.withName("pNext"),
        vulkan_h.C_INT.withName("attachmentInitialSampleLocationsCount"),
        MemoryLayout.paddingLayout(4),
        vulkan_h.C_POINTER.withName("pAttachmentInitialSampleLocations"),
        vulkan_h.C_INT.withName("postSubpassSampleLocationsCount"),
        MemoryLayout.paddingLayout(4),
        vulkan_h.C_POINTER.withName("pPostSubpassSampleLocations")
    ).withName("VkRenderPassSampleLocationsBeginInfoEXT");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt sType$LAYOUT = (OfInt)$LAYOUT.select(groupElement("sType"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final OfInt sType$layout() {
        return sType$LAYOUT;
    }

    private static final long sType$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final long sType$offset() {
        return sType$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static int sType(MemorySegment struct) {
        return struct.get(sType$LAYOUT, sType$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static void sType(MemorySegment struct, int fieldValue) {
        struct.set(sType$LAYOUT, sType$OFFSET, fieldValue);
    }

    private static final AddressLayout pNext$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pNext"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static final AddressLayout pNext$layout() {
        return pNext$LAYOUT;
    }

    private static final long pNext$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static final long pNext$offset() {
        return pNext$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static MemorySegment pNext(MemorySegment struct) {
        return struct.get(pNext$LAYOUT, pNext$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static void pNext(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pNext$LAYOUT, pNext$OFFSET, fieldValue);
    }

    private static final OfInt attachmentInitialSampleLocationsCount$LAYOUT = (OfInt)$LAYOUT.select(groupElement("attachmentInitialSampleLocationsCount"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t attachmentInitialSampleLocationsCount
     * }
     */
    public static final OfInt attachmentInitialSampleLocationsCount$layout() {
        return attachmentInitialSampleLocationsCount$LAYOUT;
    }

    private static final long attachmentInitialSampleLocationsCount$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t attachmentInitialSampleLocationsCount
     * }
     */
    public static final long attachmentInitialSampleLocationsCount$offset() {
        return attachmentInitialSampleLocationsCount$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t attachmentInitialSampleLocationsCount
     * }
     */
    public static int attachmentInitialSampleLocationsCount(MemorySegment struct) {
        return struct.get(attachmentInitialSampleLocationsCount$LAYOUT, attachmentInitialSampleLocationsCount$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t attachmentInitialSampleLocationsCount
     * }
     */
    public static void attachmentInitialSampleLocationsCount(MemorySegment struct, int fieldValue) {
        struct.set(attachmentInitialSampleLocationsCount$LAYOUT, attachmentInitialSampleLocationsCount$OFFSET, fieldValue);
    }

    private static final AddressLayout pAttachmentInitialSampleLocations$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pAttachmentInitialSampleLocations"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const VkAttachmentSampleLocationsEXT *pAttachmentInitialSampleLocations
     * }
     */
    public static final AddressLayout pAttachmentInitialSampleLocations$layout() {
        return pAttachmentInitialSampleLocations$LAYOUT;
    }

    private static final long pAttachmentInitialSampleLocations$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const VkAttachmentSampleLocationsEXT *pAttachmentInitialSampleLocations
     * }
     */
    public static final long pAttachmentInitialSampleLocations$offset() {
        return pAttachmentInitialSampleLocations$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const VkAttachmentSampleLocationsEXT *pAttachmentInitialSampleLocations
     * }
     */
    public static MemorySegment pAttachmentInitialSampleLocations(MemorySegment struct) {
        return struct.get(pAttachmentInitialSampleLocations$LAYOUT, pAttachmentInitialSampleLocations$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const VkAttachmentSampleLocationsEXT *pAttachmentInitialSampleLocations
     * }
     */
    public static void pAttachmentInitialSampleLocations(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pAttachmentInitialSampleLocations$LAYOUT, pAttachmentInitialSampleLocations$OFFSET, fieldValue);
    }

    private static final OfInt postSubpassSampleLocationsCount$LAYOUT = (OfInt)$LAYOUT.select(groupElement("postSubpassSampleLocationsCount"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t postSubpassSampleLocationsCount
     * }
     */
    public static final OfInt postSubpassSampleLocationsCount$layout() {
        return postSubpassSampleLocationsCount$LAYOUT;
    }

    private static final long postSubpassSampleLocationsCount$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t postSubpassSampleLocationsCount
     * }
     */
    public static final long postSubpassSampleLocationsCount$offset() {
        return postSubpassSampleLocationsCount$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t postSubpassSampleLocationsCount
     * }
     */
    public static int postSubpassSampleLocationsCount(MemorySegment struct) {
        return struct.get(postSubpassSampleLocationsCount$LAYOUT, postSubpassSampleLocationsCount$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t postSubpassSampleLocationsCount
     * }
     */
    public static void postSubpassSampleLocationsCount(MemorySegment struct, int fieldValue) {
        struct.set(postSubpassSampleLocationsCount$LAYOUT, postSubpassSampleLocationsCount$OFFSET, fieldValue);
    }

    private static final AddressLayout pPostSubpassSampleLocations$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pPostSubpassSampleLocations"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const VkSubpassSampleLocationsEXT *pPostSubpassSampleLocations
     * }
     */
    public static final AddressLayout pPostSubpassSampleLocations$layout() {
        return pPostSubpassSampleLocations$LAYOUT;
    }

    private static final long pPostSubpassSampleLocations$OFFSET = 40;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const VkSubpassSampleLocationsEXT *pPostSubpassSampleLocations
     * }
     */
    public static final long pPostSubpassSampleLocations$offset() {
        return pPostSubpassSampleLocations$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const VkSubpassSampleLocationsEXT *pPostSubpassSampleLocations
     * }
     */
    public static MemorySegment pPostSubpassSampleLocations(MemorySegment struct) {
        return struct.get(pPostSubpassSampleLocations$LAYOUT, pPostSubpassSampleLocations$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const VkSubpassSampleLocationsEXT *pPostSubpassSampleLocations
     * }
     */
    public static void pPostSubpassSampleLocations(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pPostSubpassSampleLocations$LAYOUT, pPostSubpassSampleLocations$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

