// Generated by jextract

package org.vulkan;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct VkRenderPassMultiviewCreateInfo {
 *     VkStructureType sType;
 *     const void *pNext;
 *     uint32_t subpassCount;
 *     const uint32_t *pViewMasks;
 *     uint32_t dependencyCount;
 *     const int32_t *pViewOffsets;
 *     uint32_t correlationMaskCount;
 *     const uint32_t *pCorrelationMasks;
 * }
 * }
 */
public class VkRenderPassMultiviewCreateInfo {

    VkRenderPassMultiviewCreateInfo() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        vulkan_h.C_INT.withName("sType"),
        MemoryLayout.paddingLayout(4),
        vulkan_h.C_POINTER.withName("pNext"),
        vulkan_h.C_INT.withName("subpassCount"),
        MemoryLayout.paddingLayout(4),
        vulkan_h.C_POINTER.withName("pViewMasks"),
        vulkan_h.C_INT.withName("dependencyCount"),
        MemoryLayout.paddingLayout(4),
        vulkan_h.C_POINTER.withName("pViewOffsets"),
        vulkan_h.C_INT.withName("correlationMaskCount"),
        MemoryLayout.paddingLayout(4),
        vulkan_h.C_POINTER.withName("pCorrelationMasks")
    ).withName("VkRenderPassMultiviewCreateInfo");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt sType$LAYOUT = (OfInt)$LAYOUT.select(groupElement("sType"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final OfInt sType$layout() {
        return sType$LAYOUT;
    }

    private static final long sType$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final long sType$offset() {
        return sType$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static int sType(MemorySegment struct) {
        return struct.get(sType$LAYOUT, sType$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static void sType(MemorySegment struct, int fieldValue) {
        struct.set(sType$LAYOUT, sType$OFFSET, fieldValue);
    }

    private static final AddressLayout pNext$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pNext"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static final AddressLayout pNext$layout() {
        return pNext$LAYOUT;
    }

    private static final long pNext$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static final long pNext$offset() {
        return pNext$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static MemorySegment pNext(MemorySegment struct) {
        return struct.get(pNext$LAYOUT, pNext$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static void pNext(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pNext$LAYOUT, pNext$OFFSET, fieldValue);
    }

    private static final OfInt subpassCount$LAYOUT = (OfInt)$LAYOUT.select(groupElement("subpassCount"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t subpassCount
     * }
     */
    public static final OfInt subpassCount$layout() {
        return subpassCount$LAYOUT;
    }

    private static final long subpassCount$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t subpassCount
     * }
     */
    public static final long subpassCount$offset() {
        return subpassCount$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t subpassCount
     * }
     */
    public static int subpassCount(MemorySegment struct) {
        return struct.get(subpassCount$LAYOUT, subpassCount$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t subpassCount
     * }
     */
    public static void subpassCount(MemorySegment struct, int fieldValue) {
        struct.set(subpassCount$LAYOUT, subpassCount$OFFSET, fieldValue);
    }

    private static final AddressLayout pViewMasks$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pViewMasks"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const uint32_t *pViewMasks
     * }
     */
    public static final AddressLayout pViewMasks$layout() {
        return pViewMasks$LAYOUT;
    }

    private static final long pViewMasks$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const uint32_t *pViewMasks
     * }
     */
    public static final long pViewMasks$offset() {
        return pViewMasks$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const uint32_t *pViewMasks
     * }
     */
    public static MemorySegment pViewMasks(MemorySegment struct) {
        return struct.get(pViewMasks$LAYOUT, pViewMasks$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const uint32_t *pViewMasks
     * }
     */
    public static void pViewMasks(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pViewMasks$LAYOUT, pViewMasks$OFFSET, fieldValue);
    }

    private static final OfInt dependencyCount$LAYOUT = (OfInt)$LAYOUT.select(groupElement("dependencyCount"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t dependencyCount
     * }
     */
    public static final OfInt dependencyCount$layout() {
        return dependencyCount$LAYOUT;
    }

    private static final long dependencyCount$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t dependencyCount
     * }
     */
    public static final long dependencyCount$offset() {
        return dependencyCount$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t dependencyCount
     * }
     */
    public static int dependencyCount(MemorySegment struct) {
        return struct.get(dependencyCount$LAYOUT, dependencyCount$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t dependencyCount
     * }
     */
    public static void dependencyCount(MemorySegment struct, int fieldValue) {
        struct.set(dependencyCount$LAYOUT, dependencyCount$OFFSET, fieldValue);
    }

    private static final AddressLayout pViewOffsets$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pViewOffsets"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const int32_t *pViewOffsets
     * }
     */
    public static final AddressLayout pViewOffsets$layout() {
        return pViewOffsets$LAYOUT;
    }

    private static final long pViewOffsets$OFFSET = 40;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const int32_t *pViewOffsets
     * }
     */
    public static final long pViewOffsets$offset() {
        return pViewOffsets$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const int32_t *pViewOffsets
     * }
     */
    public static MemorySegment pViewOffsets(MemorySegment struct) {
        return struct.get(pViewOffsets$LAYOUT, pViewOffsets$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const int32_t *pViewOffsets
     * }
     */
    public static void pViewOffsets(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pViewOffsets$LAYOUT, pViewOffsets$OFFSET, fieldValue);
    }

    private static final OfInt correlationMaskCount$LAYOUT = (OfInt)$LAYOUT.select(groupElement("correlationMaskCount"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t correlationMaskCount
     * }
     */
    public static final OfInt correlationMaskCount$layout() {
        return correlationMaskCount$LAYOUT;
    }

    private static final long correlationMaskCount$OFFSET = 48;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t correlationMaskCount
     * }
     */
    public static final long correlationMaskCount$offset() {
        return correlationMaskCount$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t correlationMaskCount
     * }
     */
    public static int correlationMaskCount(MemorySegment struct) {
        return struct.get(correlationMaskCount$LAYOUT, correlationMaskCount$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t correlationMaskCount
     * }
     */
    public static void correlationMaskCount(MemorySegment struct, int fieldValue) {
        struct.set(correlationMaskCount$LAYOUT, correlationMaskCount$OFFSET, fieldValue);
    }

    private static final AddressLayout pCorrelationMasks$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pCorrelationMasks"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const uint32_t *pCorrelationMasks
     * }
     */
    public static final AddressLayout pCorrelationMasks$layout() {
        return pCorrelationMasks$LAYOUT;
    }

    private static final long pCorrelationMasks$OFFSET = 56;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const uint32_t *pCorrelationMasks
     * }
     */
    public static final long pCorrelationMasks$offset() {
        return pCorrelationMasks$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const uint32_t *pCorrelationMasks
     * }
     */
    public static MemorySegment pCorrelationMasks(MemorySegment struct) {
        return struct.get(pCorrelationMasks$LAYOUT, pCorrelationMasks$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const uint32_t *pCorrelationMasks
     * }
     */
    public static void pCorrelationMasks(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pCorrelationMasks$LAYOUT, pCorrelationMasks$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

