// Generated by jextract

package org.vulkan;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct VkRenderingInputAttachmentIndexInfoKHR {
 *     VkStructureType sType;
 *     const void *pNext;
 *     uint32_t colorAttachmentCount;
 *     const uint32_t *pColorAttachmentInputIndices;
 *     const uint32_t *pDepthInputAttachmentIndex;
 *     const uint32_t *pStencilInputAttachmentIndex;
 * }
 * }
 */
public class VkRenderingInputAttachmentIndexInfoKHR {

    VkRenderingInputAttachmentIndexInfoKHR() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        vulkan_h.C_INT.withName("sType"),
        MemoryLayout.paddingLayout(4),
        vulkan_h.C_POINTER.withName("pNext"),
        vulkan_h.C_INT.withName("colorAttachmentCount"),
        MemoryLayout.paddingLayout(4),
        vulkan_h.C_POINTER.withName("pColorAttachmentInputIndices"),
        vulkan_h.C_POINTER.withName("pDepthInputAttachmentIndex"),
        vulkan_h.C_POINTER.withName("pStencilInputAttachmentIndex")
    ).withName("VkRenderingInputAttachmentIndexInfoKHR");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt sType$LAYOUT = (OfInt)$LAYOUT.select(groupElement("sType"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final OfInt sType$layout() {
        return sType$LAYOUT;
    }

    private static final long sType$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final long sType$offset() {
        return sType$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static int sType(MemorySegment struct) {
        return struct.get(sType$LAYOUT, sType$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static void sType(MemorySegment struct, int fieldValue) {
        struct.set(sType$LAYOUT, sType$OFFSET, fieldValue);
    }

    private static final AddressLayout pNext$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pNext"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static final AddressLayout pNext$layout() {
        return pNext$LAYOUT;
    }

    private static final long pNext$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static final long pNext$offset() {
        return pNext$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static MemorySegment pNext(MemorySegment struct) {
        return struct.get(pNext$LAYOUT, pNext$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static void pNext(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pNext$LAYOUT, pNext$OFFSET, fieldValue);
    }

    private static final OfInt colorAttachmentCount$LAYOUT = (OfInt)$LAYOUT.select(groupElement("colorAttachmentCount"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t colorAttachmentCount
     * }
     */
    public static final OfInt colorAttachmentCount$layout() {
        return colorAttachmentCount$LAYOUT;
    }

    private static final long colorAttachmentCount$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t colorAttachmentCount
     * }
     */
    public static final long colorAttachmentCount$offset() {
        return colorAttachmentCount$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t colorAttachmentCount
     * }
     */
    public static int colorAttachmentCount(MemorySegment struct) {
        return struct.get(colorAttachmentCount$LAYOUT, colorAttachmentCount$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t colorAttachmentCount
     * }
     */
    public static void colorAttachmentCount(MemorySegment struct, int fieldValue) {
        struct.set(colorAttachmentCount$LAYOUT, colorAttachmentCount$OFFSET, fieldValue);
    }

    private static final AddressLayout pColorAttachmentInputIndices$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pColorAttachmentInputIndices"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const uint32_t *pColorAttachmentInputIndices
     * }
     */
    public static final AddressLayout pColorAttachmentInputIndices$layout() {
        return pColorAttachmentInputIndices$LAYOUT;
    }

    private static final long pColorAttachmentInputIndices$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const uint32_t *pColorAttachmentInputIndices
     * }
     */
    public static final long pColorAttachmentInputIndices$offset() {
        return pColorAttachmentInputIndices$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const uint32_t *pColorAttachmentInputIndices
     * }
     */
    public static MemorySegment pColorAttachmentInputIndices(MemorySegment struct) {
        return struct.get(pColorAttachmentInputIndices$LAYOUT, pColorAttachmentInputIndices$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const uint32_t *pColorAttachmentInputIndices
     * }
     */
    public static void pColorAttachmentInputIndices(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pColorAttachmentInputIndices$LAYOUT, pColorAttachmentInputIndices$OFFSET, fieldValue);
    }

    private static final AddressLayout pDepthInputAttachmentIndex$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pDepthInputAttachmentIndex"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const uint32_t *pDepthInputAttachmentIndex
     * }
     */
    public static final AddressLayout pDepthInputAttachmentIndex$layout() {
        return pDepthInputAttachmentIndex$LAYOUT;
    }

    private static final long pDepthInputAttachmentIndex$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const uint32_t *pDepthInputAttachmentIndex
     * }
     */
    public static final long pDepthInputAttachmentIndex$offset() {
        return pDepthInputAttachmentIndex$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const uint32_t *pDepthInputAttachmentIndex
     * }
     */
    public static MemorySegment pDepthInputAttachmentIndex(MemorySegment struct) {
        return struct.get(pDepthInputAttachmentIndex$LAYOUT, pDepthInputAttachmentIndex$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const uint32_t *pDepthInputAttachmentIndex
     * }
     */
    public static void pDepthInputAttachmentIndex(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pDepthInputAttachmentIndex$LAYOUT, pDepthInputAttachmentIndex$OFFSET, fieldValue);
    }

    private static final AddressLayout pStencilInputAttachmentIndex$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pStencilInputAttachmentIndex"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const uint32_t *pStencilInputAttachmentIndex
     * }
     */
    public static final AddressLayout pStencilInputAttachmentIndex$layout() {
        return pStencilInputAttachmentIndex$LAYOUT;
    }

    private static final long pStencilInputAttachmentIndex$OFFSET = 40;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const uint32_t *pStencilInputAttachmentIndex
     * }
     */
    public static final long pStencilInputAttachmentIndex$offset() {
        return pStencilInputAttachmentIndex$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const uint32_t *pStencilInputAttachmentIndex
     * }
     */
    public static MemorySegment pStencilInputAttachmentIndex(MemorySegment struct) {
        return struct.get(pStencilInputAttachmentIndex$LAYOUT, pStencilInputAttachmentIndex$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const uint32_t *pStencilInputAttachmentIndex
     * }
     */
    public static void pStencilInputAttachmentIndex(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pStencilInputAttachmentIndex$LAYOUT, pStencilInputAttachmentIndex$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

