// Generated by jextract

package org.vulkan;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct VkRenderingFragmentShadingRateAttachmentInfoKHR {
 *     VkStructureType sType;
 *     const void *pNext;
 *     VkImageView imageView;
 *     VkImageLayout imageLayout;
 *     VkExtent2D shadingRateAttachmentTexelSize;
 * }
 * }
 */
public class VkRenderingFragmentShadingRateAttachmentInfoKHR {

    VkRenderingFragmentShadingRateAttachmentInfoKHR() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        vulkan_h.C_INT.withName("sType"),
        MemoryLayout.paddingLayout(4),
        vulkan_h.C_POINTER.withName("pNext"),
        vulkan_h.C_POINTER.withName("imageView"),
        vulkan_h.C_INT.withName("imageLayout"),
        VkExtent2D.layout().withName("shadingRateAttachmentTexelSize"),
        MemoryLayout.paddingLayout(4)
    ).withName("VkRenderingFragmentShadingRateAttachmentInfoKHR");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt sType$LAYOUT = (OfInt)$LAYOUT.select(groupElement("sType"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final OfInt sType$layout() {
        return sType$LAYOUT;
    }

    private static final long sType$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final long sType$offset() {
        return sType$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static int sType(MemorySegment struct) {
        return struct.get(sType$LAYOUT, sType$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static void sType(MemorySegment struct, int fieldValue) {
        struct.set(sType$LAYOUT, sType$OFFSET, fieldValue);
    }

    private static final AddressLayout pNext$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pNext"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static final AddressLayout pNext$layout() {
        return pNext$LAYOUT;
    }

    private static final long pNext$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static final long pNext$offset() {
        return pNext$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static MemorySegment pNext(MemorySegment struct) {
        return struct.get(pNext$LAYOUT, pNext$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static void pNext(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pNext$LAYOUT, pNext$OFFSET, fieldValue);
    }

    private static final AddressLayout imageView$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("imageView"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkImageView imageView
     * }
     */
    public static final AddressLayout imageView$layout() {
        return imageView$LAYOUT;
    }

    private static final long imageView$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkImageView imageView
     * }
     */
    public static final long imageView$offset() {
        return imageView$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkImageView imageView
     * }
     */
    public static MemorySegment imageView(MemorySegment struct) {
        return struct.get(imageView$LAYOUT, imageView$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkImageView imageView
     * }
     */
    public static void imageView(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(imageView$LAYOUT, imageView$OFFSET, fieldValue);
    }

    private static final OfInt imageLayout$LAYOUT = (OfInt)$LAYOUT.select(groupElement("imageLayout"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkImageLayout imageLayout
     * }
     */
    public static final OfInt imageLayout$layout() {
        return imageLayout$LAYOUT;
    }

    private static final long imageLayout$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkImageLayout imageLayout
     * }
     */
    public static final long imageLayout$offset() {
        return imageLayout$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkImageLayout imageLayout
     * }
     */
    public static int imageLayout(MemorySegment struct) {
        return struct.get(imageLayout$LAYOUT, imageLayout$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkImageLayout imageLayout
     * }
     */
    public static void imageLayout(MemorySegment struct, int fieldValue) {
        struct.set(imageLayout$LAYOUT, imageLayout$OFFSET, fieldValue);
    }

    private static final GroupLayout shadingRateAttachmentTexelSize$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("shadingRateAttachmentTexelSize"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkExtent2D shadingRateAttachmentTexelSize
     * }
     */
    public static final GroupLayout shadingRateAttachmentTexelSize$layout() {
        return shadingRateAttachmentTexelSize$LAYOUT;
    }

    private static final long shadingRateAttachmentTexelSize$OFFSET = 28;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkExtent2D shadingRateAttachmentTexelSize
     * }
     */
    public static final long shadingRateAttachmentTexelSize$offset() {
        return shadingRateAttachmentTexelSize$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkExtent2D shadingRateAttachmentTexelSize
     * }
     */
    public static MemorySegment shadingRateAttachmentTexelSize(MemorySegment struct) {
        return struct.asSlice(shadingRateAttachmentTexelSize$OFFSET, shadingRateAttachmentTexelSize$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkExtent2D shadingRateAttachmentTexelSize
     * }
     */
    public static void shadingRateAttachmentTexelSize(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, shadingRateAttachmentTexelSize$OFFSET, shadingRateAttachmentTexelSize$LAYOUT.byteSize());
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

