// Generated by jextract

package org.vulkan;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct VkRenderingAttachmentInfo {
 *     VkStructureType sType;
 *     const void *pNext;
 *     VkImageView imageView;
 *     VkImageLayout imageLayout;
 *     VkResolveModeFlagBits resolveMode;
 *     VkImageView resolveImageView;
 *     VkImageLayout resolveImageLayout;
 *     VkAttachmentLoadOp loadOp;
 *     VkAttachmentStoreOp storeOp;
 *     VkClearValue clearValue;
 * }
 * }
 */
public class VkRenderingAttachmentInfo {

    VkRenderingAttachmentInfo() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        vulkan_h.C_INT.withName("sType"),
        MemoryLayout.paddingLayout(4),
        vulkan_h.C_POINTER.withName("pNext"),
        vulkan_h.C_POINTER.withName("imageView"),
        vulkan_h.C_INT.withName("imageLayout"),
        vulkan_h.C_INT.withName("resolveMode"),
        vulkan_h.C_POINTER.withName("resolveImageView"),
        vulkan_h.C_INT.withName("resolveImageLayout"),
        vulkan_h.C_INT.withName("loadOp"),
        vulkan_h.C_INT.withName("storeOp"),
        VkClearValue.layout().withName("clearValue"),
        MemoryLayout.paddingLayout(4)
    ).withName("VkRenderingAttachmentInfo");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt sType$LAYOUT = (OfInt)$LAYOUT.select(groupElement("sType"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final OfInt sType$layout() {
        return sType$LAYOUT;
    }

    private static final long sType$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final long sType$offset() {
        return sType$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static int sType(MemorySegment struct) {
        return struct.get(sType$LAYOUT, sType$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static void sType(MemorySegment struct, int fieldValue) {
        struct.set(sType$LAYOUT, sType$OFFSET, fieldValue);
    }

    private static final AddressLayout pNext$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pNext"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static final AddressLayout pNext$layout() {
        return pNext$LAYOUT;
    }

    private static final long pNext$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static final long pNext$offset() {
        return pNext$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static MemorySegment pNext(MemorySegment struct) {
        return struct.get(pNext$LAYOUT, pNext$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static void pNext(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pNext$LAYOUT, pNext$OFFSET, fieldValue);
    }

    private static final AddressLayout imageView$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("imageView"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkImageView imageView
     * }
     */
    public static final AddressLayout imageView$layout() {
        return imageView$LAYOUT;
    }

    private static final long imageView$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkImageView imageView
     * }
     */
    public static final long imageView$offset() {
        return imageView$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkImageView imageView
     * }
     */
    public static MemorySegment imageView(MemorySegment struct) {
        return struct.get(imageView$LAYOUT, imageView$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkImageView imageView
     * }
     */
    public static void imageView(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(imageView$LAYOUT, imageView$OFFSET, fieldValue);
    }

    private static final OfInt imageLayout$LAYOUT = (OfInt)$LAYOUT.select(groupElement("imageLayout"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkImageLayout imageLayout
     * }
     */
    public static final OfInt imageLayout$layout() {
        return imageLayout$LAYOUT;
    }

    private static final long imageLayout$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkImageLayout imageLayout
     * }
     */
    public static final long imageLayout$offset() {
        return imageLayout$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkImageLayout imageLayout
     * }
     */
    public static int imageLayout(MemorySegment struct) {
        return struct.get(imageLayout$LAYOUT, imageLayout$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkImageLayout imageLayout
     * }
     */
    public static void imageLayout(MemorySegment struct, int fieldValue) {
        struct.set(imageLayout$LAYOUT, imageLayout$OFFSET, fieldValue);
    }

    private static final OfInt resolveMode$LAYOUT = (OfInt)$LAYOUT.select(groupElement("resolveMode"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkResolveModeFlagBits resolveMode
     * }
     */
    public static final OfInt resolveMode$layout() {
        return resolveMode$LAYOUT;
    }

    private static final long resolveMode$OFFSET = 28;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkResolveModeFlagBits resolveMode
     * }
     */
    public static final long resolveMode$offset() {
        return resolveMode$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkResolveModeFlagBits resolveMode
     * }
     */
    public static int resolveMode(MemorySegment struct) {
        return struct.get(resolveMode$LAYOUT, resolveMode$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkResolveModeFlagBits resolveMode
     * }
     */
    public static void resolveMode(MemorySegment struct, int fieldValue) {
        struct.set(resolveMode$LAYOUT, resolveMode$OFFSET, fieldValue);
    }

    private static final AddressLayout resolveImageView$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("resolveImageView"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkImageView resolveImageView
     * }
     */
    public static final AddressLayout resolveImageView$layout() {
        return resolveImageView$LAYOUT;
    }

    private static final long resolveImageView$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkImageView resolveImageView
     * }
     */
    public static final long resolveImageView$offset() {
        return resolveImageView$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkImageView resolveImageView
     * }
     */
    public static MemorySegment resolveImageView(MemorySegment struct) {
        return struct.get(resolveImageView$LAYOUT, resolveImageView$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkImageView resolveImageView
     * }
     */
    public static void resolveImageView(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(resolveImageView$LAYOUT, resolveImageView$OFFSET, fieldValue);
    }

    private static final OfInt resolveImageLayout$LAYOUT = (OfInt)$LAYOUT.select(groupElement("resolveImageLayout"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkImageLayout resolveImageLayout
     * }
     */
    public static final OfInt resolveImageLayout$layout() {
        return resolveImageLayout$LAYOUT;
    }

    private static final long resolveImageLayout$OFFSET = 40;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkImageLayout resolveImageLayout
     * }
     */
    public static final long resolveImageLayout$offset() {
        return resolveImageLayout$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkImageLayout resolveImageLayout
     * }
     */
    public static int resolveImageLayout(MemorySegment struct) {
        return struct.get(resolveImageLayout$LAYOUT, resolveImageLayout$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkImageLayout resolveImageLayout
     * }
     */
    public static void resolveImageLayout(MemorySegment struct, int fieldValue) {
        struct.set(resolveImageLayout$LAYOUT, resolveImageLayout$OFFSET, fieldValue);
    }

    private static final OfInt loadOp$LAYOUT = (OfInt)$LAYOUT.select(groupElement("loadOp"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkAttachmentLoadOp loadOp
     * }
     */
    public static final OfInt loadOp$layout() {
        return loadOp$LAYOUT;
    }

    private static final long loadOp$OFFSET = 44;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkAttachmentLoadOp loadOp
     * }
     */
    public static final long loadOp$offset() {
        return loadOp$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkAttachmentLoadOp loadOp
     * }
     */
    public static int loadOp(MemorySegment struct) {
        return struct.get(loadOp$LAYOUT, loadOp$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkAttachmentLoadOp loadOp
     * }
     */
    public static void loadOp(MemorySegment struct, int fieldValue) {
        struct.set(loadOp$LAYOUT, loadOp$OFFSET, fieldValue);
    }

    private static final OfInt storeOp$LAYOUT = (OfInt)$LAYOUT.select(groupElement("storeOp"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkAttachmentStoreOp storeOp
     * }
     */
    public static final OfInt storeOp$layout() {
        return storeOp$LAYOUT;
    }

    private static final long storeOp$OFFSET = 48;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkAttachmentStoreOp storeOp
     * }
     */
    public static final long storeOp$offset() {
        return storeOp$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkAttachmentStoreOp storeOp
     * }
     */
    public static int storeOp(MemorySegment struct) {
        return struct.get(storeOp$LAYOUT, storeOp$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkAttachmentStoreOp storeOp
     * }
     */
    public static void storeOp(MemorySegment struct, int fieldValue) {
        struct.set(storeOp$LAYOUT, storeOp$OFFSET, fieldValue);
    }

    private static final GroupLayout clearValue$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("clearValue"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkClearValue clearValue
     * }
     */
    public static final GroupLayout clearValue$layout() {
        return clearValue$LAYOUT;
    }

    private static final long clearValue$OFFSET = 52;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkClearValue clearValue
     * }
     */
    public static final long clearValue$offset() {
        return clearValue$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkClearValue clearValue
     * }
     */
    public static MemorySegment clearValue(MemorySegment struct) {
        return struct.asSlice(clearValue$OFFSET, clearValue$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkClearValue clearValue
     * }
     */
    public static void clearValue(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, clearValue$OFFSET, clearValue$LAYOUT.byteSize());
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

