// Generated by jextract

package org.vulkan;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct VkSetDescriptorBufferOffsetsInfoEXT {
 *     VkStructureType sType;
 *     const void *pNext;
 *     VkShaderStageFlags stageFlags;
 *     VkPipelineLayout layout;
 *     uint32_t firstSet;
 *     uint32_t setCount;
 *     const uint32_t *pBufferIndices;
 *     const VkDeviceSize *pOffsets;
 * }
 * }
 */
public class VkSetDescriptorBufferOffsetsInfoEXT {

    VkSetDescriptorBufferOffsetsInfoEXT() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        vulkan_h.C_INT.withName("sType"),
        MemoryLayout.paddingLayout(4),
        vulkan_h.C_POINTER.withName("pNext"),
        vulkan_h.C_INT.withName("stageFlags"),
        MemoryLayout.paddingLayout(4),
        vulkan_h.C_POINTER.withName("layout"),
        vulkan_h.C_INT.withName("firstSet"),
        vulkan_h.C_INT.withName("setCount"),
        vulkan_h.C_POINTER.withName("pBufferIndices"),
        vulkan_h.C_POINTER.withName("pOffsets")
    ).withName("VkSetDescriptorBufferOffsetsInfoEXT");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt sType$LAYOUT = (OfInt)$LAYOUT.select(groupElement("sType"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final OfInt sType$layout() {
        return sType$LAYOUT;
    }

    private static final long sType$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final long sType$offset() {
        return sType$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static int sType(MemorySegment struct) {
        return struct.get(sType$LAYOUT, sType$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static void sType(MemorySegment struct, int fieldValue) {
        struct.set(sType$LAYOUT, sType$OFFSET, fieldValue);
    }

    private static final AddressLayout pNext$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pNext"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static final AddressLayout pNext$layout() {
        return pNext$LAYOUT;
    }

    private static final long pNext$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static final long pNext$offset() {
        return pNext$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static MemorySegment pNext(MemorySegment struct) {
        return struct.get(pNext$LAYOUT, pNext$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static void pNext(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pNext$LAYOUT, pNext$OFFSET, fieldValue);
    }

    private static final OfInt stageFlags$LAYOUT = (OfInt)$LAYOUT.select(groupElement("stageFlags"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkShaderStageFlags stageFlags
     * }
     */
    public static final OfInt stageFlags$layout() {
        return stageFlags$LAYOUT;
    }

    private static final long stageFlags$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkShaderStageFlags stageFlags
     * }
     */
    public static final long stageFlags$offset() {
        return stageFlags$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkShaderStageFlags stageFlags
     * }
     */
    public static int stageFlags(MemorySegment struct) {
        return struct.get(stageFlags$LAYOUT, stageFlags$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkShaderStageFlags stageFlags
     * }
     */
    public static void stageFlags(MemorySegment struct, int fieldValue) {
        struct.set(stageFlags$LAYOUT, stageFlags$OFFSET, fieldValue);
    }

    private static final AddressLayout layout$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("layout"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkPipelineLayout layout
     * }
     */
    public static final AddressLayout layout$layout() {
        return layout$LAYOUT;
    }

    private static final long layout$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkPipelineLayout layout
     * }
     */
    public static final long layout$offset() {
        return layout$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkPipelineLayout layout
     * }
     */
    public static MemorySegment layout(MemorySegment struct) {
        return struct.get(layout$LAYOUT, layout$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkPipelineLayout layout
     * }
     */
    public static void layout(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(layout$LAYOUT, layout$OFFSET, fieldValue);
    }

    private static final OfInt firstSet$LAYOUT = (OfInt)$LAYOUT.select(groupElement("firstSet"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t firstSet
     * }
     */
    public static final OfInt firstSet$layout() {
        return firstSet$LAYOUT;
    }

    private static final long firstSet$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t firstSet
     * }
     */
    public static final long firstSet$offset() {
        return firstSet$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t firstSet
     * }
     */
    public static int firstSet(MemorySegment struct) {
        return struct.get(firstSet$LAYOUT, firstSet$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t firstSet
     * }
     */
    public static void firstSet(MemorySegment struct, int fieldValue) {
        struct.set(firstSet$LAYOUT, firstSet$OFFSET, fieldValue);
    }

    private static final OfInt setCount$LAYOUT = (OfInt)$LAYOUT.select(groupElement("setCount"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t setCount
     * }
     */
    public static final OfInt setCount$layout() {
        return setCount$LAYOUT;
    }

    private static final long setCount$OFFSET = 36;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t setCount
     * }
     */
    public static final long setCount$offset() {
        return setCount$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t setCount
     * }
     */
    public static int setCount(MemorySegment struct) {
        return struct.get(setCount$LAYOUT, setCount$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t setCount
     * }
     */
    public static void setCount(MemorySegment struct, int fieldValue) {
        struct.set(setCount$LAYOUT, setCount$OFFSET, fieldValue);
    }

    private static final AddressLayout pBufferIndices$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pBufferIndices"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const uint32_t *pBufferIndices
     * }
     */
    public static final AddressLayout pBufferIndices$layout() {
        return pBufferIndices$LAYOUT;
    }

    private static final long pBufferIndices$OFFSET = 40;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const uint32_t *pBufferIndices
     * }
     */
    public static final long pBufferIndices$offset() {
        return pBufferIndices$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const uint32_t *pBufferIndices
     * }
     */
    public static MemorySegment pBufferIndices(MemorySegment struct) {
        return struct.get(pBufferIndices$LAYOUT, pBufferIndices$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const uint32_t *pBufferIndices
     * }
     */
    public static void pBufferIndices(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pBufferIndices$LAYOUT, pBufferIndices$OFFSET, fieldValue);
    }

    private static final AddressLayout pOffsets$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pOffsets"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const VkDeviceSize *pOffsets
     * }
     */
    public static final AddressLayout pOffsets$layout() {
        return pOffsets$LAYOUT;
    }

    private static final long pOffsets$OFFSET = 48;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const VkDeviceSize *pOffsets
     * }
     */
    public static final long pOffsets$offset() {
        return pOffsets$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const VkDeviceSize *pOffsets
     * }
     */
    public static MemorySegment pOffsets(MemorySegment struct) {
        return struct.get(pOffsets$LAYOUT, pOffsets$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const VkDeviceSize *pOffsets
     * }
     */
    public static void pOffsets(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pOffsets$LAYOUT, pOffsets$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

