// Generated by jextract

package org.vulkan;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct VkShaderModuleIdentifierEXT {
 *     VkStructureType sType;
 *     void *pNext;
 *     uint32_t identifierSize;
 *     uint8_t identifier[32];
 * }
 * }
 */
public class VkShaderModuleIdentifierEXT {

    VkShaderModuleIdentifierEXT() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        vulkan_h.C_INT.withName("sType"),
        MemoryLayout.paddingLayout(4),
        vulkan_h.C_POINTER.withName("pNext"),
        vulkan_h.C_INT.withName("identifierSize"),
        MemoryLayout.sequenceLayout(32, vulkan_h.C_CHAR).withName("identifier"),
        MemoryLayout.paddingLayout(4)
    ).withName("VkShaderModuleIdentifierEXT");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt sType$LAYOUT = (OfInt)$LAYOUT.select(groupElement("sType"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final OfInt sType$layout() {
        return sType$LAYOUT;
    }

    private static final long sType$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final long sType$offset() {
        return sType$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static int sType(MemorySegment struct) {
        return struct.get(sType$LAYOUT, sType$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static void sType(MemorySegment struct, int fieldValue) {
        struct.set(sType$LAYOUT, sType$OFFSET, fieldValue);
    }

    private static final AddressLayout pNext$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pNext"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * void *pNext
     * }
     */
    public static final AddressLayout pNext$layout() {
        return pNext$LAYOUT;
    }

    private static final long pNext$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * void *pNext
     * }
     */
    public static final long pNext$offset() {
        return pNext$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * void *pNext
     * }
     */
    public static MemorySegment pNext(MemorySegment struct) {
        return struct.get(pNext$LAYOUT, pNext$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * void *pNext
     * }
     */
    public static void pNext(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pNext$LAYOUT, pNext$OFFSET, fieldValue);
    }

    private static final OfInt identifierSize$LAYOUT = (OfInt)$LAYOUT.select(groupElement("identifierSize"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t identifierSize
     * }
     */
    public static final OfInt identifierSize$layout() {
        return identifierSize$LAYOUT;
    }

    private static final long identifierSize$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t identifierSize
     * }
     */
    public static final long identifierSize$offset() {
        return identifierSize$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t identifierSize
     * }
     */
    public static int identifierSize(MemorySegment struct) {
        return struct.get(identifierSize$LAYOUT, identifierSize$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t identifierSize
     * }
     */
    public static void identifierSize(MemorySegment struct, int fieldValue) {
        struct.set(identifierSize$LAYOUT, identifierSize$OFFSET, fieldValue);
    }

    private static final SequenceLayout identifier$LAYOUT = (SequenceLayout)$LAYOUT.select(groupElement("identifier"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint8_t identifier[32]
     * }
     */
    public static final SequenceLayout identifier$layout() {
        return identifier$LAYOUT;
    }

    private static final long identifier$OFFSET = 20;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint8_t identifier[32]
     * }
     */
    public static final long identifier$offset() {
        return identifier$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint8_t identifier[32]
     * }
     */
    public static MemorySegment identifier(MemorySegment struct) {
        return struct.asSlice(identifier$OFFSET, identifier$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint8_t identifier[32]
     * }
     */
    public static void identifier(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, identifier$OFFSET, identifier$LAYOUT.byteSize());
    }

    private static long[] identifier$DIMS = { 32 };

    /**
     * Dimensions for array field:
     * {@snippet lang=c :
     * uint8_t identifier[32]
     * }
     */
    public static long[] identifier$dimensions() {
        return identifier$DIMS;
    }
    private static final VarHandle identifier$ELEM_HANDLE = identifier$LAYOUT.varHandle(sequenceElement());

    /**
     * Indexed getter for field:
     * {@snippet lang=c :
     * uint8_t identifier[32]
     * }
     */
    public static byte identifier(MemorySegment struct, long index0) {
        return (byte)identifier$ELEM_HANDLE.get(struct, 0L, index0);
    }

    /**
     * Indexed setter for field:
     * {@snippet lang=c :
     * uint8_t identifier[32]
     * }
     */
    public static void identifier(MemorySegment struct, long index0, byte fieldValue) {
        identifier$ELEM_HANDLE.set(struct, 0L, index0, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

