// Generated by jextract

package org.vulkan;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct VkSubmitInfo2 {
 *     VkStructureType sType;
 *     const void *pNext;
 *     VkSubmitFlags flags;
 *     uint32_t waitSemaphoreInfoCount;
 *     const VkSemaphoreSubmitInfo *pWaitSemaphoreInfos;
 *     uint32_t commandBufferInfoCount;
 *     const VkCommandBufferSubmitInfo *pCommandBufferInfos;
 *     uint32_t signalSemaphoreInfoCount;
 *     const VkSemaphoreSubmitInfo *pSignalSemaphoreInfos;
 * }
 * }
 */
public class VkSubmitInfo2 {

    VkSubmitInfo2() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        vulkan_h.C_INT.withName("sType"),
        MemoryLayout.paddingLayout(4),
        vulkan_h.C_POINTER.withName("pNext"),
        vulkan_h.C_INT.withName("flags"),
        vulkan_h.C_INT.withName("waitSemaphoreInfoCount"),
        vulkan_h.C_POINTER.withName("pWaitSemaphoreInfos"),
        vulkan_h.C_INT.withName("commandBufferInfoCount"),
        MemoryLayout.paddingLayout(4),
        vulkan_h.C_POINTER.withName("pCommandBufferInfos"),
        vulkan_h.C_INT.withName("signalSemaphoreInfoCount"),
        MemoryLayout.paddingLayout(4),
        vulkan_h.C_POINTER.withName("pSignalSemaphoreInfos")
    ).withName("VkSubmitInfo2");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt sType$LAYOUT = (OfInt)$LAYOUT.select(groupElement("sType"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final OfInt sType$layout() {
        return sType$LAYOUT;
    }

    private static final long sType$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final long sType$offset() {
        return sType$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static int sType(MemorySegment struct) {
        return struct.get(sType$LAYOUT, sType$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static void sType(MemorySegment struct, int fieldValue) {
        struct.set(sType$LAYOUT, sType$OFFSET, fieldValue);
    }

    private static final AddressLayout pNext$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pNext"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static final AddressLayout pNext$layout() {
        return pNext$LAYOUT;
    }

    private static final long pNext$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static final long pNext$offset() {
        return pNext$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static MemorySegment pNext(MemorySegment struct) {
        return struct.get(pNext$LAYOUT, pNext$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static void pNext(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pNext$LAYOUT, pNext$OFFSET, fieldValue);
    }

    private static final OfInt flags$LAYOUT = (OfInt)$LAYOUT.select(groupElement("flags"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkSubmitFlags flags
     * }
     */
    public static final OfInt flags$layout() {
        return flags$LAYOUT;
    }

    private static final long flags$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkSubmitFlags flags
     * }
     */
    public static final long flags$offset() {
        return flags$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkSubmitFlags flags
     * }
     */
    public static int flags(MemorySegment struct) {
        return struct.get(flags$LAYOUT, flags$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkSubmitFlags flags
     * }
     */
    public static void flags(MemorySegment struct, int fieldValue) {
        struct.set(flags$LAYOUT, flags$OFFSET, fieldValue);
    }

    private static final OfInt waitSemaphoreInfoCount$LAYOUT = (OfInt)$LAYOUT.select(groupElement("waitSemaphoreInfoCount"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t waitSemaphoreInfoCount
     * }
     */
    public static final OfInt waitSemaphoreInfoCount$layout() {
        return waitSemaphoreInfoCount$LAYOUT;
    }

    private static final long waitSemaphoreInfoCount$OFFSET = 20;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t waitSemaphoreInfoCount
     * }
     */
    public static final long waitSemaphoreInfoCount$offset() {
        return waitSemaphoreInfoCount$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t waitSemaphoreInfoCount
     * }
     */
    public static int waitSemaphoreInfoCount(MemorySegment struct) {
        return struct.get(waitSemaphoreInfoCount$LAYOUT, waitSemaphoreInfoCount$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t waitSemaphoreInfoCount
     * }
     */
    public static void waitSemaphoreInfoCount(MemorySegment struct, int fieldValue) {
        struct.set(waitSemaphoreInfoCount$LAYOUT, waitSemaphoreInfoCount$OFFSET, fieldValue);
    }

    private static final AddressLayout pWaitSemaphoreInfos$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pWaitSemaphoreInfos"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const VkSemaphoreSubmitInfo *pWaitSemaphoreInfos
     * }
     */
    public static final AddressLayout pWaitSemaphoreInfos$layout() {
        return pWaitSemaphoreInfos$LAYOUT;
    }

    private static final long pWaitSemaphoreInfos$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const VkSemaphoreSubmitInfo *pWaitSemaphoreInfos
     * }
     */
    public static final long pWaitSemaphoreInfos$offset() {
        return pWaitSemaphoreInfos$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const VkSemaphoreSubmitInfo *pWaitSemaphoreInfos
     * }
     */
    public static MemorySegment pWaitSemaphoreInfos(MemorySegment struct) {
        return struct.get(pWaitSemaphoreInfos$LAYOUT, pWaitSemaphoreInfos$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const VkSemaphoreSubmitInfo *pWaitSemaphoreInfos
     * }
     */
    public static void pWaitSemaphoreInfos(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pWaitSemaphoreInfos$LAYOUT, pWaitSemaphoreInfos$OFFSET, fieldValue);
    }

    private static final OfInt commandBufferInfoCount$LAYOUT = (OfInt)$LAYOUT.select(groupElement("commandBufferInfoCount"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t commandBufferInfoCount
     * }
     */
    public static final OfInt commandBufferInfoCount$layout() {
        return commandBufferInfoCount$LAYOUT;
    }

    private static final long commandBufferInfoCount$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t commandBufferInfoCount
     * }
     */
    public static final long commandBufferInfoCount$offset() {
        return commandBufferInfoCount$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t commandBufferInfoCount
     * }
     */
    public static int commandBufferInfoCount(MemorySegment struct) {
        return struct.get(commandBufferInfoCount$LAYOUT, commandBufferInfoCount$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t commandBufferInfoCount
     * }
     */
    public static void commandBufferInfoCount(MemorySegment struct, int fieldValue) {
        struct.set(commandBufferInfoCount$LAYOUT, commandBufferInfoCount$OFFSET, fieldValue);
    }

    private static final AddressLayout pCommandBufferInfos$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pCommandBufferInfos"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const VkCommandBufferSubmitInfo *pCommandBufferInfos
     * }
     */
    public static final AddressLayout pCommandBufferInfos$layout() {
        return pCommandBufferInfos$LAYOUT;
    }

    private static final long pCommandBufferInfos$OFFSET = 40;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const VkCommandBufferSubmitInfo *pCommandBufferInfos
     * }
     */
    public static final long pCommandBufferInfos$offset() {
        return pCommandBufferInfos$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const VkCommandBufferSubmitInfo *pCommandBufferInfos
     * }
     */
    public static MemorySegment pCommandBufferInfos(MemorySegment struct) {
        return struct.get(pCommandBufferInfos$LAYOUT, pCommandBufferInfos$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const VkCommandBufferSubmitInfo *pCommandBufferInfos
     * }
     */
    public static void pCommandBufferInfos(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pCommandBufferInfos$LAYOUT, pCommandBufferInfos$OFFSET, fieldValue);
    }

    private static final OfInt signalSemaphoreInfoCount$LAYOUT = (OfInt)$LAYOUT.select(groupElement("signalSemaphoreInfoCount"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t signalSemaphoreInfoCount
     * }
     */
    public static final OfInt signalSemaphoreInfoCount$layout() {
        return signalSemaphoreInfoCount$LAYOUT;
    }

    private static final long signalSemaphoreInfoCount$OFFSET = 48;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t signalSemaphoreInfoCount
     * }
     */
    public static final long signalSemaphoreInfoCount$offset() {
        return signalSemaphoreInfoCount$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t signalSemaphoreInfoCount
     * }
     */
    public static int signalSemaphoreInfoCount(MemorySegment struct) {
        return struct.get(signalSemaphoreInfoCount$LAYOUT, signalSemaphoreInfoCount$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t signalSemaphoreInfoCount
     * }
     */
    public static void signalSemaphoreInfoCount(MemorySegment struct, int fieldValue) {
        struct.set(signalSemaphoreInfoCount$LAYOUT, signalSemaphoreInfoCount$OFFSET, fieldValue);
    }

    private static final AddressLayout pSignalSemaphoreInfos$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pSignalSemaphoreInfos"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const VkSemaphoreSubmitInfo *pSignalSemaphoreInfos
     * }
     */
    public static final AddressLayout pSignalSemaphoreInfos$layout() {
        return pSignalSemaphoreInfos$LAYOUT;
    }

    private static final long pSignalSemaphoreInfos$OFFSET = 56;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const VkSemaphoreSubmitInfo *pSignalSemaphoreInfos
     * }
     */
    public static final long pSignalSemaphoreInfos$offset() {
        return pSignalSemaphoreInfos$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const VkSemaphoreSubmitInfo *pSignalSemaphoreInfos
     * }
     */
    public static MemorySegment pSignalSemaphoreInfos(MemorySegment struct) {
        return struct.get(pSignalSemaphoreInfos$LAYOUT, pSignalSemaphoreInfos$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const VkSemaphoreSubmitInfo *pSignalSemaphoreInfos
     * }
     */
    public static void pSignalSemaphoreInfos(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pSignalSemaphoreInfos$LAYOUT, pSignalSemaphoreInfos$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

