// Generated by jextract

package org.vulkan;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct VkValidationFeaturesEXT {
 *     VkStructureType sType;
 *     const void *pNext;
 *     uint32_t enabledValidationFeatureCount;
 *     const VkValidationFeatureEnableEXT *pEnabledValidationFeatures;
 *     uint32_t disabledValidationFeatureCount;
 *     const VkValidationFeatureDisableEXT *pDisabledValidationFeatures;
 * }
 * }
 */
public class VkValidationFeaturesEXT {

    VkValidationFeaturesEXT() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        vulkan_h.C_INT.withName("sType"),
        MemoryLayout.paddingLayout(4),
        vulkan_h.C_POINTER.withName("pNext"),
        vulkan_h.C_INT.withName("enabledValidationFeatureCount"),
        MemoryLayout.paddingLayout(4),
        vulkan_h.C_POINTER.withName("pEnabledValidationFeatures"),
        vulkan_h.C_INT.withName("disabledValidationFeatureCount"),
        MemoryLayout.paddingLayout(4),
        vulkan_h.C_POINTER.withName("pDisabledValidationFeatures")
    ).withName("VkValidationFeaturesEXT");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt sType$LAYOUT = (OfInt)$LAYOUT.select(groupElement("sType"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final OfInt sType$layout() {
        return sType$LAYOUT;
    }

    private static final long sType$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final long sType$offset() {
        return sType$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static int sType(MemorySegment struct) {
        return struct.get(sType$LAYOUT, sType$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static void sType(MemorySegment struct, int fieldValue) {
        struct.set(sType$LAYOUT, sType$OFFSET, fieldValue);
    }

    private static final AddressLayout pNext$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pNext"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static final AddressLayout pNext$layout() {
        return pNext$LAYOUT;
    }

    private static final long pNext$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static final long pNext$offset() {
        return pNext$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static MemorySegment pNext(MemorySegment struct) {
        return struct.get(pNext$LAYOUT, pNext$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static void pNext(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pNext$LAYOUT, pNext$OFFSET, fieldValue);
    }

    private static final OfInt enabledValidationFeatureCount$LAYOUT = (OfInt)$LAYOUT.select(groupElement("enabledValidationFeatureCount"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t enabledValidationFeatureCount
     * }
     */
    public static final OfInt enabledValidationFeatureCount$layout() {
        return enabledValidationFeatureCount$LAYOUT;
    }

    private static final long enabledValidationFeatureCount$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t enabledValidationFeatureCount
     * }
     */
    public static final long enabledValidationFeatureCount$offset() {
        return enabledValidationFeatureCount$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t enabledValidationFeatureCount
     * }
     */
    public static int enabledValidationFeatureCount(MemorySegment struct) {
        return struct.get(enabledValidationFeatureCount$LAYOUT, enabledValidationFeatureCount$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t enabledValidationFeatureCount
     * }
     */
    public static void enabledValidationFeatureCount(MemorySegment struct, int fieldValue) {
        struct.set(enabledValidationFeatureCount$LAYOUT, enabledValidationFeatureCount$OFFSET, fieldValue);
    }

    private static final AddressLayout pEnabledValidationFeatures$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pEnabledValidationFeatures"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const VkValidationFeatureEnableEXT *pEnabledValidationFeatures
     * }
     */
    public static final AddressLayout pEnabledValidationFeatures$layout() {
        return pEnabledValidationFeatures$LAYOUT;
    }

    private static final long pEnabledValidationFeatures$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const VkValidationFeatureEnableEXT *pEnabledValidationFeatures
     * }
     */
    public static final long pEnabledValidationFeatures$offset() {
        return pEnabledValidationFeatures$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const VkValidationFeatureEnableEXT *pEnabledValidationFeatures
     * }
     */
    public static MemorySegment pEnabledValidationFeatures(MemorySegment struct) {
        return struct.get(pEnabledValidationFeatures$LAYOUT, pEnabledValidationFeatures$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const VkValidationFeatureEnableEXT *pEnabledValidationFeatures
     * }
     */
    public static void pEnabledValidationFeatures(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pEnabledValidationFeatures$LAYOUT, pEnabledValidationFeatures$OFFSET, fieldValue);
    }

    private static final OfInt disabledValidationFeatureCount$LAYOUT = (OfInt)$LAYOUT.select(groupElement("disabledValidationFeatureCount"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t disabledValidationFeatureCount
     * }
     */
    public static final OfInt disabledValidationFeatureCount$layout() {
        return disabledValidationFeatureCount$LAYOUT;
    }

    private static final long disabledValidationFeatureCount$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t disabledValidationFeatureCount
     * }
     */
    public static final long disabledValidationFeatureCount$offset() {
        return disabledValidationFeatureCount$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t disabledValidationFeatureCount
     * }
     */
    public static int disabledValidationFeatureCount(MemorySegment struct) {
        return struct.get(disabledValidationFeatureCount$LAYOUT, disabledValidationFeatureCount$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t disabledValidationFeatureCount
     * }
     */
    public static void disabledValidationFeatureCount(MemorySegment struct, int fieldValue) {
        struct.set(disabledValidationFeatureCount$LAYOUT, disabledValidationFeatureCount$OFFSET, fieldValue);
    }

    private static final AddressLayout pDisabledValidationFeatures$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pDisabledValidationFeatures"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const VkValidationFeatureDisableEXT *pDisabledValidationFeatures
     * }
     */
    public static final AddressLayout pDisabledValidationFeatures$layout() {
        return pDisabledValidationFeatures$LAYOUT;
    }

    private static final long pDisabledValidationFeatures$OFFSET = 40;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const VkValidationFeatureDisableEXT *pDisabledValidationFeatures
     * }
     */
    public static final long pDisabledValidationFeatures$offset() {
        return pDisabledValidationFeatures$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const VkValidationFeatureDisableEXT *pDisabledValidationFeatures
     * }
     */
    public static MemorySegment pDisabledValidationFeatures(MemorySegment struct) {
        return struct.get(pDisabledValidationFeatures$LAYOUT, pDisabledValidationFeatures$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const VkValidationFeatureDisableEXT *pDisabledValidationFeatures
     * }
     */
    public static void pDisabledValidationFeatures(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pDisabledValidationFeatures$LAYOUT, pDisabledValidationFeatures$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

