// Generated by jextract

package org.vulkan;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct VkVideoEncodeH264PictureInfoKHR {
 *     VkStructureType sType;
 *     const void *pNext;
 *     uint32_t naluSliceEntryCount;
 *     const VkVideoEncodeH264NaluSliceInfoKHR *pNaluSliceEntries;
 *     const StdVideoEncodeH264PictureInfo *pStdPictureInfo;
 *     VkBool32 generatePrefixNalu;
 * }
 * }
 */
public class VkVideoEncodeH264PictureInfoKHR {

    VkVideoEncodeH264PictureInfoKHR() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        vulkan_h.C_INT.withName("sType"),
        MemoryLayout.paddingLayout(4),
        vulkan_h.C_POINTER.withName("pNext"),
        vulkan_h.C_INT.withName("naluSliceEntryCount"),
        MemoryLayout.paddingLayout(4),
        vulkan_h.C_POINTER.withName("pNaluSliceEntries"),
        vulkan_h.C_POINTER.withName("pStdPictureInfo"),
        vulkan_h.C_INT.withName("generatePrefixNalu"),
        MemoryLayout.paddingLayout(4)
    ).withName("VkVideoEncodeH264PictureInfoKHR");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt sType$LAYOUT = (OfInt)$LAYOUT.select(groupElement("sType"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final OfInt sType$layout() {
        return sType$LAYOUT;
    }

    private static final long sType$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final long sType$offset() {
        return sType$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static int sType(MemorySegment struct) {
        return struct.get(sType$LAYOUT, sType$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static void sType(MemorySegment struct, int fieldValue) {
        struct.set(sType$LAYOUT, sType$OFFSET, fieldValue);
    }

    private static final AddressLayout pNext$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pNext"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static final AddressLayout pNext$layout() {
        return pNext$LAYOUT;
    }

    private static final long pNext$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static final long pNext$offset() {
        return pNext$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static MemorySegment pNext(MemorySegment struct) {
        return struct.get(pNext$LAYOUT, pNext$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static void pNext(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pNext$LAYOUT, pNext$OFFSET, fieldValue);
    }

    private static final OfInt naluSliceEntryCount$LAYOUT = (OfInt)$LAYOUT.select(groupElement("naluSliceEntryCount"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t naluSliceEntryCount
     * }
     */
    public static final OfInt naluSliceEntryCount$layout() {
        return naluSliceEntryCount$LAYOUT;
    }

    private static final long naluSliceEntryCount$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t naluSliceEntryCount
     * }
     */
    public static final long naluSliceEntryCount$offset() {
        return naluSliceEntryCount$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t naluSliceEntryCount
     * }
     */
    public static int naluSliceEntryCount(MemorySegment struct) {
        return struct.get(naluSliceEntryCount$LAYOUT, naluSliceEntryCount$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t naluSliceEntryCount
     * }
     */
    public static void naluSliceEntryCount(MemorySegment struct, int fieldValue) {
        struct.set(naluSliceEntryCount$LAYOUT, naluSliceEntryCount$OFFSET, fieldValue);
    }

    private static final AddressLayout pNaluSliceEntries$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pNaluSliceEntries"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const VkVideoEncodeH264NaluSliceInfoKHR *pNaluSliceEntries
     * }
     */
    public static final AddressLayout pNaluSliceEntries$layout() {
        return pNaluSliceEntries$LAYOUT;
    }

    private static final long pNaluSliceEntries$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const VkVideoEncodeH264NaluSliceInfoKHR *pNaluSliceEntries
     * }
     */
    public static final long pNaluSliceEntries$offset() {
        return pNaluSliceEntries$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const VkVideoEncodeH264NaluSliceInfoKHR *pNaluSliceEntries
     * }
     */
    public static MemorySegment pNaluSliceEntries(MemorySegment struct) {
        return struct.get(pNaluSliceEntries$LAYOUT, pNaluSliceEntries$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const VkVideoEncodeH264NaluSliceInfoKHR *pNaluSliceEntries
     * }
     */
    public static void pNaluSliceEntries(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pNaluSliceEntries$LAYOUT, pNaluSliceEntries$OFFSET, fieldValue);
    }

    private static final AddressLayout pStdPictureInfo$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pStdPictureInfo"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const StdVideoEncodeH264PictureInfo *pStdPictureInfo
     * }
     */
    public static final AddressLayout pStdPictureInfo$layout() {
        return pStdPictureInfo$LAYOUT;
    }

    private static final long pStdPictureInfo$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const StdVideoEncodeH264PictureInfo *pStdPictureInfo
     * }
     */
    public static final long pStdPictureInfo$offset() {
        return pStdPictureInfo$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const StdVideoEncodeH264PictureInfo *pStdPictureInfo
     * }
     */
    public static MemorySegment pStdPictureInfo(MemorySegment struct) {
        return struct.get(pStdPictureInfo$LAYOUT, pStdPictureInfo$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const StdVideoEncodeH264PictureInfo *pStdPictureInfo
     * }
     */
    public static void pStdPictureInfo(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pStdPictureInfo$LAYOUT, pStdPictureInfo$OFFSET, fieldValue);
    }

    private static final OfInt generatePrefixNalu$LAYOUT = (OfInt)$LAYOUT.select(groupElement("generatePrefixNalu"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkBool32 generatePrefixNalu
     * }
     */
    public static final OfInt generatePrefixNalu$layout() {
        return generatePrefixNalu$LAYOUT;
    }

    private static final long generatePrefixNalu$OFFSET = 40;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkBool32 generatePrefixNalu
     * }
     */
    public static final long generatePrefixNalu$offset() {
        return generatePrefixNalu$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkBool32 generatePrefixNalu
     * }
     */
    public static int generatePrefixNalu(MemorySegment struct) {
        return struct.get(generatePrefixNalu$LAYOUT, generatePrefixNalu$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkBool32 generatePrefixNalu
     * }
     */
    public static void generatePrefixNalu(MemorySegment struct, int fieldValue) {
        struct.set(generatePrefixNalu$LAYOUT, generatePrefixNalu$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

