// Generated by jextract

package org.vulkan;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct VkVideoEncodeH265RateControlInfoKHR {
 *     VkStructureType sType;
 *     const void *pNext;
 *     VkVideoEncodeH265RateControlFlagsKHR flags;
 *     uint32_t gopFrameCount;
 *     uint32_t idrPeriod;
 *     uint32_t consecutiveBFrameCount;
 *     uint32_t subLayerCount;
 * }
 * }
 */
public class VkVideoEncodeH265RateControlInfoKHR {

    VkVideoEncodeH265RateControlInfoKHR() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        vulkan_h.C_INT.withName("sType"),
        MemoryLayout.paddingLayout(4),
        vulkan_h.C_POINTER.withName("pNext"),
        vulkan_h.C_INT.withName("flags"),
        vulkan_h.C_INT.withName("gopFrameCount"),
        vulkan_h.C_INT.withName("idrPeriod"),
        vulkan_h.C_INT.withName("consecutiveBFrameCount"),
        vulkan_h.C_INT.withName("subLayerCount"),
        MemoryLayout.paddingLayout(4)
    ).withName("VkVideoEncodeH265RateControlInfoKHR");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt sType$LAYOUT = (OfInt)$LAYOUT.select(groupElement("sType"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final OfInt sType$layout() {
        return sType$LAYOUT;
    }

    private static final long sType$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final long sType$offset() {
        return sType$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static int sType(MemorySegment struct) {
        return struct.get(sType$LAYOUT, sType$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static void sType(MemorySegment struct, int fieldValue) {
        struct.set(sType$LAYOUT, sType$OFFSET, fieldValue);
    }

    private static final AddressLayout pNext$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pNext"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static final AddressLayout pNext$layout() {
        return pNext$LAYOUT;
    }

    private static final long pNext$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static final long pNext$offset() {
        return pNext$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static MemorySegment pNext(MemorySegment struct) {
        return struct.get(pNext$LAYOUT, pNext$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static void pNext(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pNext$LAYOUT, pNext$OFFSET, fieldValue);
    }

    private static final OfInt flags$LAYOUT = (OfInt)$LAYOUT.select(groupElement("flags"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkVideoEncodeH265RateControlFlagsKHR flags
     * }
     */
    public static final OfInt flags$layout() {
        return flags$LAYOUT;
    }

    private static final long flags$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkVideoEncodeH265RateControlFlagsKHR flags
     * }
     */
    public static final long flags$offset() {
        return flags$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkVideoEncodeH265RateControlFlagsKHR flags
     * }
     */
    public static int flags(MemorySegment struct) {
        return struct.get(flags$LAYOUT, flags$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkVideoEncodeH265RateControlFlagsKHR flags
     * }
     */
    public static void flags(MemorySegment struct, int fieldValue) {
        struct.set(flags$LAYOUT, flags$OFFSET, fieldValue);
    }

    private static final OfInt gopFrameCount$LAYOUT = (OfInt)$LAYOUT.select(groupElement("gopFrameCount"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t gopFrameCount
     * }
     */
    public static final OfInt gopFrameCount$layout() {
        return gopFrameCount$LAYOUT;
    }

    private static final long gopFrameCount$OFFSET = 20;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t gopFrameCount
     * }
     */
    public static final long gopFrameCount$offset() {
        return gopFrameCount$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t gopFrameCount
     * }
     */
    public static int gopFrameCount(MemorySegment struct) {
        return struct.get(gopFrameCount$LAYOUT, gopFrameCount$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t gopFrameCount
     * }
     */
    public static void gopFrameCount(MemorySegment struct, int fieldValue) {
        struct.set(gopFrameCount$LAYOUT, gopFrameCount$OFFSET, fieldValue);
    }

    private static final OfInt idrPeriod$LAYOUT = (OfInt)$LAYOUT.select(groupElement("idrPeriod"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t idrPeriod
     * }
     */
    public static final OfInt idrPeriod$layout() {
        return idrPeriod$LAYOUT;
    }

    private static final long idrPeriod$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t idrPeriod
     * }
     */
    public static final long idrPeriod$offset() {
        return idrPeriod$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t idrPeriod
     * }
     */
    public static int idrPeriod(MemorySegment struct) {
        return struct.get(idrPeriod$LAYOUT, idrPeriod$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t idrPeriod
     * }
     */
    public static void idrPeriod(MemorySegment struct, int fieldValue) {
        struct.set(idrPeriod$LAYOUT, idrPeriod$OFFSET, fieldValue);
    }

    private static final OfInt consecutiveBFrameCount$LAYOUT = (OfInt)$LAYOUT.select(groupElement("consecutiveBFrameCount"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t consecutiveBFrameCount
     * }
     */
    public static final OfInt consecutiveBFrameCount$layout() {
        return consecutiveBFrameCount$LAYOUT;
    }

    private static final long consecutiveBFrameCount$OFFSET = 28;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t consecutiveBFrameCount
     * }
     */
    public static final long consecutiveBFrameCount$offset() {
        return consecutiveBFrameCount$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t consecutiveBFrameCount
     * }
     */
    public static int consecutiveBFrameCount(MemorySegment struct) {
        return struct.get(consecutiveBFrameCount$LAYOUT, consecutiveBFrameCount$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t consecutiveBFrameCount
     * }
     */
    public static void consecutiveBFrameCount(MemorySegment struct, int fieldValue) {
        struct.set(consecutiveBFrameCount$LAYOUT, consecutiveBFrameCount$OFFSET, fieldValue);
    }

    private static final OfInt subLayerCount$LAYOUT = (OfInt)$LAYOUT.select(groupElement("subLayerCount"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t subLayerCount
     * }
     */
    public static final OfInt subLayerCount$layout() {
        return subLayerCount$LAYOUT;
    }

    private static final long subLayerCount$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t subLayerCount
     * }
     */
    public static final long subLayerCount$offset() {
        return subLayerCount$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t subLayerCount
     * }
     */
    public static int subLayerCount(MemorySegment struct) {
        return struct.get(subLayerCount$LAYOUT, subLayerCount$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t subLayerCount
     * }
     */
    public static void subLayerCount(MemorySegment struct, int fieldValue) {
        struct.set(subLayerCount$LAYOUT, subLayerCount$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

