// Generated by jextract

package org.vulkan;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct VkVideoDecodeH265SessionParametersCreateInfoKHR {
 *     VkStructureType sType;
 *     const void *pNext;
 *     uint32_t maxStdVPSCount;
 *     uint32_t maxStdSPSCount;
 *     uint32_t maxStdPPSCount;
 *     const VkVideoDecodeH265SessionParametersAddInfoKHR *pParametersAddInfo;
 * }
 * }
 */
public class VkVideoDecodeH265SessionParametersCreateInfoKHR {

    VkVideoDecodeH265SessionParametersCreateInfoKHR() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        vulkan_h.C_INT.withName("sType"),
        MemoryLayout.paddingLayout(4),
        vulkan_h.C_POINTER.withName("pNext"),
        vulkan_h.C_INT.withName("maxStdVPSCount"),
        vulkan_h.C_INT.withName("maxStdSPSCount"),
        vulkan_h.C_INT.withName("maxStdPPSCount"),
        MemoryLayout.paddingLayout(4),
        vulkan_h.C_POINTER.withName("pParametersAddInfo")
    ).withName("VkVideoDecodeH265SessionParametersCreateInfoKHR");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt sType$LAYOUT = (OfInt)$LAYOUT.select(groupElement("sType"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final OfInt sType$layout() {
        return sType$LAYOUT;
    }

    private static final long sType$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final long sType$offset() {
        return sType$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static int sType(MemorySegment struct) {
        return struct.get(sType$LAYOUT, sType$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static void sType(MemorySegment struct, int fieldValue) {
        struct.set(sType$LAYOUT, sType$OFFSET, fieldValue);
    }

    private static final AddressLayout pNext$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pNext"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static final AddressLayout pNext$layout() {
        return pNext$LAYOUT;
    }

    private static final long pNext$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static final long pNext$offset() {
        return pNext$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static MemorySegment pNext(MemorySegment struct) {
        return struct.get(pNext$LAYOUT, pNext$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static void pNext(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pNext$LAYOUT, pNext$OFFSET, fieldValue);
    }

    private static final OfInt maxStdVPSCount$LAYOUT = (OfInt)$LAYOUT.select(groupElement("maxStdVPSCount"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t maxStdVPSCount
     * }
     */
    public static final OfInt maxStdVPSCount$layout() {
        return maxStdVPSCount$LAYOUT;
    }

    private static final long maxStdVPSCount$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t maxStdVPSCount
     * }
     */
    public static final long maxStdVPSCount$offset() {
        return maxStdVPSCount$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t maxStdVPSCount
     * }
     */
    public static int maxStdVPSCount(MemorySegment struct) {
        return struct.get(maxStdVPSCount$LAYOUT, maxStdVPSCount$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t maxStdVPSCount
     * }
     */
    public static void maxStdVPSCount(MemorySegment struct, int fieldValue) {
        struct.set(maxStdVPSCount$LAYOUT, maxStdVPSCount$OFFSET, fieldValue);
    }

    private static final OfInt maxStdSPSCount$LAYOUT = (OfInt)$LAYOUT.select(groupElement("maxStdSPSCount"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t maxStdSPSCount
     * }
     */
    public static final OfInt maxStdSPSCount$layout() {
        return maxStdSPSCount$LAYOUT;
    }

    private static final long maxStdSPSCount$OFFSET = 20;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t maxStdSPSCount
     * }
     */
    public static final long maxStdSPSCount$offset() {
        return maxStdSPSCount$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t maxStdSPSCount
     * }
     */
    public static int maxStdSPSCount(MemorySegment struct) {
        return struct.get(maxStdSPSCount$LAYOUT, maxStdSPSCount$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t maxStdSPSCount
     * }
     */
    public static void maxStdSPSCount(MemorySegment struct, int fieldValue) {
        struct.set(maxStdSPSCount$LAYOUT, maxStdSPSCount$OFFSET, fieldValue);
    }

    private static final OfInt maxStdPPSCount$LAYOUT = (OfInt)$LAYOUT.select(groupElement("maxStdPPSCount"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t maxStdPPSCount
     * }
     */
    public static final OfInt maxStdPPSCount$layout() {
        return maxStdPPSCount$LAYOUT;
    }

    private static final long maxStdPPSCount$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t maxStdPPSCount
     * }
     */
    public static final long maxStdPPSCount$offset() {
        return maxStdPPSCount$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t maxStdPPSCount
     * }
     */
    public static int maxStdPPSCount(MemorySegment struct) {
        return struct.get(maxStdPPSCount$LAYOUT, maxStdPPSCount$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t maxStdPPSCount
     * }
     */
    public static void maxStdPPSCount(MemorySegment struct, int fieldValue) {
        struct.set(maxStdPPSCount$LAYOUT, maxStdPPSCount$OFFSET, fieldValue);
    }

    private static final AddressLayout pParametersAddInfo$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pParametersAddInfo"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const VkVideoDecodeH265SessionParametersAddInfoKHR *pParametersAddInfo
     * }
     */
    public static final AddressLayout pParametersAddInfo$layout() {
        return pParametersAddInfo$LAYOUT;
    }

    private static final long pParametersAddInfo$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const VkVideoDecodeH265SessionParametersAddInfoKHR *pParametersAddInfo
     * }
     */
    public static final long pParametersAddInfo$offset() {
        return pParametersAddInfo$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const VkVideoDecodeH265SessionParametersAddInfoKHR *pParametersAddInfo
     * }
     */
    public static MemorySegment pParametersAddInfo(MemorySegment struct) {
        return struct.get(pParametersAddInfo$LAYOUT, pParametersAddInfo$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const VkVideoDecodeH265SessionParametersAddInfoKHR *pParametersAddInfo
     * }
     */
    public static void pParametersAddInfo(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pParametersAddInfo$LAYOUT, pParametersAddInfo$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

