// Generated by jextract

package org.vulkan;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct VkVideoEncodeRateControlLayerInfoKHR {
 *     VkStructureType sType;
 *     const void *pNext;
 *     uint64_t averageBitrate;
 *     uint64_t maxBitrate;
 *     uint32_t frameRateNumerator;
 *     uint32_t frameRateDenominator;
 * }
 * }
 */
public class VkVideoEncodeRateControlLayerInfoKHR {

    VkVideoEncodeRateControlLayerInfoKHR() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        vulkan_h.C_INT.withName("sType"),
        MemoryLayout.paddingLayout(4),
        vulkan_h.C_POINTER.withName("pNext"),
        vulkan_h.C_LONG_LONG.withName("averageBitrate"),
        vulkan_h.C_LONG_LONG.withName("maxBitrate"),
        vulkan_h.C_INT.withName("frameRateNumerator"),
        vulkan_h.C_INT.withName("frameRateDenominator")
    ).withName("VkVideoEncodeRateControlLayerInfoKHR");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt sType$LAYOUT = (OfInt)$LAYOUT.select(groupElement("sType"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final OfInt sType$layout() {
        return sType$LAYOUT;
    }

    private static final long sType$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final long sType$offset() {
        return sType$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static int sType(MemorySegment struct) {
        return struct.get(sType$LAYOUT, sType$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static void sType(MemorySegment struct, int fieldValue) {
        struct.set(sType$LAYOUT, sType$OFFSET, fieldValue);
    }

    private static final AddressLayout pNext$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pNext"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static final AddressLayout pNext$layout() {
        return pNext$LAYOUT;
    }

    private static final long pNext$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static final long pNext$offset() {
        return pNext$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static MemorySegment pNext(MemorySegment struct) {
        return struct.get(pNext$LAYOUT, pNext$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static void pNext(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pNext$LAYOUT, pNext$OFFSET, fieldValue);
    }

    private static final OfLong averageBitrate$LAYOUT = (OfLong)$LAYOUT.select(groupElement("averageBitrate"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint64_t averageBitrate
     * }
     */
    public static final OfLong averageBitrate$layout() {
        return averageBitrate$LAYOUT;
    }

    private static final long averageBitrate$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint64_t averageBitrate
     * }
     */
    public static final long averageBitrate$offset() {
        return averageBitrate$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint64_t averageBitrate
     * }
     */
    public static long averageBitrate(MemorySegment struct) {
        return struct.get(averageBitrate$LAYOUT, averageBitrate$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint64_t averageBitrate
     * }
     */
    public static void averageBitrate(MemorySegment struct, long fieldValue) {
        struct.set(averageBitrate$LAYOUT, averageBitrate$OFFSET, fieldValue);
    }

    private static final OfLong maxBitrate$LAYOUT = (OfLong)$LAYOUT.select(groupElement("maxBitrate"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint64_t maxBitrate
     * }
     */
    public static final OfLong maxBitrate$layout() {
        return maxBitrate$LAYOUT;
    }

    private static final long maxBitrate$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint64_t maxBitrate
     * }
     */
    public static final long maxBitrate$offset() {
        return maxBitrate$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint64_t maxBitrate
     * }
     */
    public static long maxBitrate(MemorySegment struct) {
        return struct.get(maxBitrate$LAYOUT, maxBitrate$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint64_t maxBitrate
     * }
     */
    public static void maxBitrate(MemorySegment struct, long fieldValue) {
        struct.set(maxBitrate$LAYOUT, maxBitrate$OFFSET, fieldValue);
    }

    private static final OfInt frameRateNumerator$LAYOUT = (OfInt)$LAYOUT.select(groupElement("frameRateNumerator"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t frameRateNumerator
     * }
     */
    public static final OfInt frameRateNumerator$layout() {
        return frameRateNumerator$LAYOUT;
    }

    private static final long frameRateNumerator$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t frameRateNumerator
     * }
     */
    public static final long frameRateNumerator$offset() {
        return frameRateNumerator$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t frameRateNumerator
     * }
     */
    public static int frameRateNumerator(MemorySegment struct) {
        return struct.get(frameRateNumerator$LAYOUT, frameRateNumerator$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t frameRateNumerator
     * }
     */
    public static void frameRateNumerator(MemorySegment struct, int fieldValue) {
        struct.set(frameRateNumerator$LAYOUT, frameRateNumerator$OFFSET, fieldValue);
    }

    private static final OfInt frameRateDenominator$LAYOUT = (OfInt)$LAYOUT.select(groupElement("frameRateDenominator"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t frameRateDenominator
     * }
     */
    public static final OfInt frameRateDenominator$layout() {
        return frameRateDenominator$LAYOUT;
    }

    private static final long frameRateDenominator$OFFSET = 36;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t frameRateDenominator
     * }
     */
    public static final long frameRateDenominator$offset() {
        return frameRateDenominator$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t frameRateDenominator
     * }
     */
    public static int frameRateDenominator(MemorySegment struct) {
        return struct.get(frameRateDenominator$LAYOUT, frameRateDenominator$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t frameRateDenominator
     * }
     */
    public static void frameRateDenominator(MemorySegment struct, int fieldValue) {
        struct.set(frameRateDenominator$LAYOUT, frameRateDenominator$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

