// Generated by jextract

package org.vulkan;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct VkVideoEncodeH265SessionCreateInfoKHR {
 *     VkStructureType sType;
 *     const void *pNext;
 *     VkBool32 useMaxLevelIdc;
 *     StdVideoH265LevelIdc maxLevelIdc;
 * }
 * }
 */
public class VkVideoEncodeH265SessionCreateInfoKHR {

    VkVideoEncodeH265SessionCreateInfoKHR() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        vulkan_h.C_INT.withName("sType"),
        MemoryLayout.paddingLayout(4),
        vulkan_h.C_POINTER.withName("pNext"),
        vulkan_h.C_INT.withName("useMaxLevelIdc"),
        vulkan_h.C_INT.withName("maxLevelIdc")
    ).withName("VkVideoEncodeH265SessionCreateInfoKHR");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt sType$LAYOUT = (OfInt)$LAYOUT.select(groupElement("sType"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final OfInt sType$layout() {
        return sType$LAYOUT;
    }

    private static final long sType$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final long sType$offset() {
        return sType$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static int sType(MemorySegment struct) {
        return struct.get(sType$LAYOUT, sType$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static void sType(MemorySegment struct, int fieldValue) {
        struct.set(sType$LAYOUT, sType$OFFSET, fieldValue);
    }

    private static final AddressLayout pNext$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pNext"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static final AddressLayout pNext$layout() {
        return pNext$LAYOUT;
    }

    private static final long pNext$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static final long pNext$offset() {
        return pNext$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static MemorySegment pNext(MemorySegment struct) {
        return struct.get(pNext$LAYOUT, pNext$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static void pNext(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pNext$LAYOUT, pNext$OFFSET, fieldValue);
    }

    private static final OfInt useMaxLevelIdc$LAYOUT = (OfInt)$LAYOUT.select(groupElement("useMaxLevelIdc"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkBool32 useMaxLevelIdc
     * }
     */
    public static final OfInt useMaxLevelIdc$layout() {
        return useMaxLevelIdc$LAYOUT;
    }

    private static final long useMaxLevelIdc$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkBool32 useMaxLevelIdc
     * }
     */
    public static final long useMaxLevelIdc$offset() {
        return useMaxLevelIdc$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkBool32 useMaxLevelIdc
     * }
     */
    public static int useMaxLevelIdc(MemorySegment struct) {
        return struct.get(useMaxLevelIdc$LAYOUT, useMaxLevelIdc$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkBool32 useMaxLevelIdc
     * }
     */
    public static void useMaxLevelIdc(MemorySegment struct, int fieldValue) {
        struct.set(useMaxLevelIdc$LAYOUT, useMaxLevelIdc$OFFSET, fieldValue);
    }

    private static final OfInt maxLevelIdc$LAYOUT = (OfInt)$LAYOUT.select(groupElement("maxLevelIdc"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * StdVideoH265LevelIdc maxLevelIdc
     * }
     */
    public static final OfInt maxLevelIdc$layout() {
        return maxLevelIdc$LAYOUT;
    }

    private static final long maxLevelIdc$OFFSET = 20;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * StdVideoH265LevelIdc maxLevelIdc
     * }
     */
    public static final long maxLevelIdc$offset() {
        return maxLevelIdc$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * StdVideoH265LevelIdc maxLevelIdc
     * }
     */
    public static int maxLevelIdc(MemorySegment struct) {
        return struct.get(maxLevelIdc$LAYOUT, maxLevelIdc$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * StdVideoH265LevelIdc maxLevelIdc
     * }
     */
    public static void maxLevelIdc(MemorySegment struct, int fieldValue) {
        struct.set(maxLevelIdc$LAYOUT, maxLevelIdc$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

