// Generated by jextract

package org.vulkan;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct VkWriteDescriptorSetAccelerationStructureNV {
 *     VkStructureType sType;
 *     const void *pNext;
 *     uint32_t accelerationStructureCount;
 *     const VkAccelerationStructureNV *pAccelerationStructures;
 * }
 * }
 */
public class VkWriteDescriptorSetAccelerationStructureNV {

    VkWriteDescriptorSetAccelerationStructureNV() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        vulkan_h.C_INT.withName("sType"),
        MemoryLayout.paddingLayout(4),
        vulkan_h.C_POINTER.withName("pNext"),
        vulkan_h.C_INT.withName("accelerationStructureCount"),
        MemoryLayout.paddingLayout(4),
        vulkan_h.C_POINTER.withName("pAccelerationStructures")
    ).withName("VkWriteDescriptorSetAccelerationStructureNV");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt sType$LAYOUT = (OfInt)$LAYOUT.select(groupElement("sType"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final OfInt sType$layout() {
        return sType$LAYOUT;
    }

    private static final long sType$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final long sType$offset() {
        return sType$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static int sType(MemorySegment struct) {
        return struct.get(sType$LAYOUT, sType$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static void sType(MemorySegment struct, int fieldValue) {
        struct.set(sType$LAYOUT, sType$OFFSET, fieldValue);
    }

    private static final AddressLayout pNext$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pNext"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static final AddressLayout pNext$layout() {
        return pNext$LAYOUT;
    }

    private static final long pNext$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static final long pNext$offset() {
        return pNext$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static MemorySegment pNext(MemorySegment struct) {
        return struct.get(pNext$LAYOUT, pNext$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static void pNext(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pNext$LAYOUT, pNext$OFFSET, fieldValue);
    }

    private static final OfInt accelerationStructureCount$LAYOUT = (OfInt)$LAYOUT.select(groupElement("accelerationStructureCount"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t accelerationStructureCount
     * }
     */
    public static final OfInt accelerationStructureCount$layout() {
        return accelerationStructureCount$LAYOUT;
    }

    private static final long accelerationStructureCount$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t accelerationStructureCount
     * }
     */
    public static final long accelerationStructureCount$offset() {
        return accelerationStructureCount$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t accelerationStructureCount
     * }
     */
    public static int accelerationStructureCount(MemorySegment struct) {
        return struct.get(accelerationStructureCount$LAYOUT, accelerationStructureCount$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t accelerationStructureCount
     * }
     */
    public static void accelerationStructureCount(MemorySegment struct, int fieldValue) {
        struct.set(accelerationStructureCount$LAYOUT, accelerationStructureCount$OFFSET, fieldValue);
    }

    private static final AddressLayout pAccelerationStructures$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pAccelerationStructures"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const VkAccelerationStructureNV *pAccelerationStructures
     * }
     */
    public static final AddressLayout pAccelerationStructures$layout() {
        return pAccelerationStructures$LAYOUT;
    }

    private static final long pAccelerationStructures$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const VkAccelerationStructureNV *pAccelerationStructures
     * }
     */
    public static final long pAccelerationStructures$offset() {
        return pAccelerationStructures$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const VkAccelerationStructureNV *pAccelerationStructures
     * }
     */
    public static MemorySegment pAccelerationStructures(MemorySegment struct) {
        return struct.get(pAccelerationStructures$LAYOUT, pAccelerationStructures$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const VkAccelerationStructureNV *pAccelerationStructures
     * }
     */
    public static void pAccelerationStructures(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pAccelerationStructures$LAYOUT, pAccelerationStructures$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

